#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AI_Projectile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPPrjBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AI_Projectile.AI_Projectile_C
// 0x0020 (0x0540 - 0x0520)
class AAI_Projectile_C : public ABPPrjBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AI_Projectile_C;                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystem*                        DeadlyBulletVFX;                                   // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeakBulletVFX;                                     // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSetParticle;                                     // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AI_Projectile(int32 EntryPoint);
	void Evt_InitSetting(const struct FVector& Speed);
	void InitSetting(const struct FVector& Speed);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AI_Projectile_C">();
	}
	static class AAI_Projectile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAI_Projectile_C>();
	}
};
static_assert(alignof(AAI_Projectile_C) == 0x000008, "Wrong alignment on AAI_Projectile_C");
static_assert(sizeof(AAI_Projectile_C) == 0x000540, "Wrong size on AAI_Projectile_C");
static_assert(offsetof(AAI_Projectile_C, UberGraphFrame_AI_Projectile_C) == 0x000520, "Member 'AAI_Projectile_C::UberGraphFrame_AI_Projectile_C' has a wrong offset!");
static_assert(offsetof(AAI_Projectile_C, DeadlyBulletVFX) == 0x000528, "Member 'AAI_Projectile_C::DeadlyBulletVFX' has a wrong offset!");
static_assert(offsetof(AAI_Projectile_C, WeakBulletVFX) == 0x000530, "Member 'AAI_Projectile_C::WeakBulletVFX' has a wrong offset!");
static_assert(offsetof(AAI_Projectile_C, IsSetParticle) == 0x000538, "Member 'AAI_Projectile_C::IsSetParticle' has a wrong offset!");

}

