#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AI_Projectile_Sniper

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "EnumDifficuty_structs.hpp"
#include "Lv2_DifficultStruct_structs.hpp"


namespace SDK::Params
{

// Function AI_Projectile_Sniper.AI_Projectile_Sniper_C.ExecuteUbergraph_AI_Projectile_Sniper
// 0x0350 (0x0350 - 0x0000)
struct AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_HitComponent;                         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USoundBase*                             CallFunc_GetSFX_Sound;                             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_GetVFX_VFX;                               // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMC_Result;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp1;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse1;                       // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit1;                                 // 0x01A0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable1;                               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_lsGameINP1__flag;                         // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0292(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_293[0x5];                                      // 0x0293(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable2;                               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable3;                               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumDifficuty                                 Temp_byte_Variable;                                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaledBoxExtent_ReturnValue;           // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x02E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyRadialDamageWithFalloff_ReturnValue; // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLv2_DifficultStruct                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0310(0x0038)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper) == 0x000008, "Wrong alignment on AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper");
static_assert(sizeof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper) == 0x000350, "Wrong size on AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, EntryPoint) == 0x000000, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::EntryPoint' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_HitComponent) == 0x000008, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_HitComponent' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_OtherActor) == 0x000010, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_OtherComp) == 0x000018, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_NormalImpulse) == 0x000020, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_Hit) == 0x000030, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetSFX_Sound) == 0x0000B8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetSFX_Sound' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetVFX_VFX) == 0x0000C0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetVFX_VFX' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C9, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_Time) == 0x0000CC, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_Distance) == 0x0000D0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_Location) == 0x0000D4, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_Normal) == 0x0000EC, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_HitItem) == 0x000128, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_FaceIndex) == 0x00012C, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_TraceStart) == 0x000130, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_BreakHitResult_TraceEnd) == 0x00013C, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_IsMC_Result) == 0x000148, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_IsMC_Result' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_ComponentHasTag_ReturnValue) == 0x000149, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_ComponentHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_MakeRotFromX_ReturnValue) == 0x00014C, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_SpawnParticle_ReturnValue) == 0x000158, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_SpawnParticle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_MyComp) == 0x000160, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_Other) == 0x000168, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_OtherComp1) == 0x000170, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_OtherComp1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_bSelfMoved) == 0x000178, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_HitLocation) == 0x00017C, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_HitNormal) == 0x000188, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_NormalImpulse1) == 0x000194, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_NormalImpulse1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_Hit1) == 0x0001A0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_Hit1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Event_DeltaSeconds) == 0x000228, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetInstigatorController_ReturnValue) == 0x000230, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_IsValid_ReturnValue) == 0x000238, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_K2_GetPawn_ReturnValue) == 0x000240, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_AsBP_Character_Base) == 0x000248, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_name_Variable) == 0x000258, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_name_Variable1) == 0x000260, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_name_Variable1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetGameInstance_ReturnValue) == 0x000268, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000270, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_bSuccess1) == 0x000278, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000280, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_lsGameINP1__flag) == 0x000290, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_lsGameINP1__flag' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_Contains_ReturnValue) == 0x000291, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_Not_PreBool_ReturnValue) == 0x000292, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_name_Variable2) == 0x000298, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_ApplyDamage_ReturnValue) == 0x0002A0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_name_Variable3) == 0x0002A8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_name_Variable3' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_byte_Variable) == 0x0002B0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002B4, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetScaledBoxExtent_ReturnValue) == 0x0002C0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetScaledBoxExtent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0002CC, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_HasAuthority_ReturnValue) == 0x0002D8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetGameInstance_ReturnValue1) == 0x0002E0, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, Temp_object_Variable) == 0x0002E8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x0002F8, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_DynamicCast_bSuccess2) == 0x000300, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_ApplyRadialDamageWithFalloff_ReturnValue) == 0x000301, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_ApplyRadialDamageWithFalloff_ReturnValue' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, K2Node_Select_Default) == 0x000308, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetDataTableRowFromName_OutRow) == 0x000310, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000348, "Member 'AI_Projectile_Sniper_C_ExecuteUbergraph_AI_Projectile_Sniper::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");

// Function AI_Projectile_Sniper.AI_Projectile_Sniper_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct AI_Projectile_Sniper_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AI_Projectile_Sniper_C_ReceiveHit) == 0x000008, "Wrong alignment on AI_Projectile_Sniper_C_ReceiveHit");
static_assert(sizeof(AI_Projectile_Sniper_C_ReceiveHit) == 0x0000C8, "Wrong size on AI_Projectile_Sniper_C_ReceiveHit");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, MyComp) == 0x000000, "Member 'AI_Projectile_Sniper_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, Other) == 0x000008, "Member 'AI_Projectile_Sniper_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, OtherComp) == 0x000010, "Member 'AI_Projectile_Sniper_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'AI_Projectile_Sniper_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'AI_Projectile_Sniper_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, HitNormal) == 0x000028, "Member 'AI_Projectile_Sniper_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'AI_Projectile_Sniper_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveHit, Hit) == 0x000040, "Member 'AI_Projectile_Sniper_C_ReceiveHit::Hit' has a wrong offset!");

// Function AI_Projectile_Sniper.AI_Projectile_Sniper_C.OnMulticastBulletHit
// 0x00B0 (0x00B0 - 0x0000)
struct AI_Projectile_Sniper_C_OnMulticastBulletHit final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AI_Projectile_Sniper_C_OnMulticastBulletHit) == 0x000008, "Wrong alignment on AI_Projectile_Sniper_C_OnMulticastBulletHit");
static_assert(sizeof(AI_Projectile_Sniper_C_OnMulticastBulletHit) == 0x0000B0, "Wrong size on AI_Projectile_Sniper_C_OnMulticastBulletHit");
static_assert(offsetof(AI_Projectile_Sniper_C_OnMulticastBulletHit, HitComponent) == 0x000000, "Member 'AI_Projectile_Sniper_C_OnMulticastBulletHit::HitComponent' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_OnMulticastBulletHit, OtherActor) == 0x000008, "Member 'AI_Projectile_Sniper_C_OnMulticastBulletHit::OtherActor' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_OnMulticastBulletHit, OtherComp) == 0x000010, "Member 'AI_Projectile_Sniper_C_OnMulticastBulletHit::OtherComp' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_OnMulticastBulletHit, NormalImpulse) == 0x000018, "Member 'AI_Projectile_Sniper_C_OnMulticastBulletHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(AI_Projectile_Sniper_C_OnMulticastBulletHit, Hit) == 0x000028, "Member 'AI_Projectile_Sniper_C_OnMulticastBulletHit::Hit' has a wrong offset!");

// Function AI_Projectile_Sniper.AI_Projectile_Sniper_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AI_Projectile_Sniper_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AI_Projectile_Sniper_C_ReceiveTick) == 0x000004, "Wrong alignment on AI_Projectile_Sniper_C_ReceiveTick");
static_assert(sizeof(AI_Projectile_Sniper_C_ReceiveTick) == 0x000004, "Wrong size on AI_Projectile_Sniper_C_ReceiveTick");
static_assert(offsetof(AI_Projectile_Sniper_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'AI_Projectile_Sniper_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

