#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_M32

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_M32.AnimBP_Wpn_M32_C
// 0x0CB8 (0x10C8 - 0x0410)
class UAnimBP_Wpn_M32_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_47B776CE4056398DCBEE93BCF9CD5DFC; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F629FF82487B6B0D538594AF7C4B2D99; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54F3A720414DBF2386F89EADF5D8299A; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9BCC75E84F8D520821115F9407EC281D; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48A18FB84AC98759C1686BBE1DFA4D94; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D89CA2C44B788B09633BDBB1F6CDCE9D; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55CC43B949F4994A9D2A2F993FDEA270; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8F18374B44E9605DCB14DF9AD1197FB0; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0CA3BEE142CD285B56DEA88203D791F7; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3DC922DC408272636A04BA84F6D47131; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90E119A64A3C31CF948D68BEB44FAF67; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_088B2B4243C2AEE84C50BDA848E42D6E; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B677A99F4B555843D606C693F2FFC157; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_01F5967745A6E74224A1D0BF10865CC5; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_285E8EE44AB898E3C307A999549AC386; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D9206A834A25961394AC9EAFBC5B3548; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_686AF6704AECFEEA0EFF0BAE1594AAC9; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EB5D8BAF49E31A6417C889A02EBAFE52; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E64D26F34D1D6D3D6A02FDAC0153446D; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8D8AC1AD40AD002E07E96C969EC2E1A0; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26467A024A027F9D6A9653848AE47553; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3D7426F145BC7B056F3D27A25B3177BF; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8F9D1A5D426378B83EB35888A4B87883; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86944C3942A0A0BBEBD19BAEE747BA2F; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D594656F47CC8E597F7B1D967BB5B82D; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9C77C93B493F9B5104E1B5B3AEA900D8; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A385B7A447381C74041F98876EB6D73D; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29920B8041562C7020F77A9DC2CFCD16; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5530674343990C1FBAE134A241EC6641; // 0x1028(0x00A0)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_M32_AnimGraphNode_TransitionResult_55CC43B949F4994A9D2A2F993FDEA270();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_M32_AnimGraphNode_TransitionResult_54F3A720414DBF2386F89EADF5D8299A();
	void ExecuteUbergraph_AnimBP_Wpn_M32(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_M32_AnimGraphNode_TransitionResult_9BCC75E84F8D520821115F9407EC281D();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_M32_AnimGraphNode_TransitionResult_F629FF82487B6B0D538594AF7C4B2D99();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_M32_C">();
	}
	static class UAnimBP_Wpn_M32_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_M32_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_M32_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_M32_C");
static_assert(sizeof(UAnimBP_Wpn_M32_C) == 0x0010C8, "Wrong size on UAnimBP_Wpn_M32_C");
static_assert(offsetof(UAnimBP_Wpn_M32_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_M32_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_Root_47B776CE4056398DCBEE93BCF9CD5DFC) == 0x000418, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_Root_47B776CE4056398DCBEE93BCF9CD5DFC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_F629FF82487B6B0D538594AF7C4B2D99) == 0x000458, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_F629FF82487B6B0D538594AF7C4B2D99' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_54F3A720414DBF2386F89EADF5D8299A) == 0x0004A0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_54F3A720414DBF2386F89EADF5D8299A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_9BCC75E84F8D520821115F9407EC281D) == 0x0004E8, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_9BCC75E84F8D520821115F9407EC281D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_48A18FB84AC98759C1686BBE1DFA4D94) == 0x000530, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_48A18FB84AC98759C1686BBE1DFA4D94' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_D89CA2C44B788B09633BDBB1F6CDCE9D) == 0x000578, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_D89CA2C44B788B09633BDBB1F6CDCE9D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_55CC43B949F4994A9D2A2F993FDEA270) == 0x0005C0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_55CC43B949F4994A9D2A2F993FDEA270' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_8F18374B44E9605DCB14DF9AD1197FB0) == 0x000608, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_8F18374B44E9605DCB14DF9AD1197FB0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_0CA3BEE142CD285B56DEA88203D791F7) == 0x000650, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_0CA3BEE142CD285B56DEA88203D791F7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_TransitionResult_3DC922DC408272636A04BA84F6D47131) == 0x000698, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_TransitionResult_3DC922DC408272636A04BA84F6D47131' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_90E119A64A3C31CF948D68BEB44FAF67) == 0x0006E0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_90E119A64A3C31CF948D68BEB44FAF67' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_088B2B4243C2AEE84C50BDA848E42D6E) == 0x000780, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_088B2B4243C2AEE84C50BDA848E42D6E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_B677A99F4B555843D606C693F2FFC157) == 0x0007C0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_B677A99F4B555843D606C693F2FFC157' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_01F5967745A6E74224A1D0BF10865CC5) == 0x000860, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_01F5967745A6E74224A1D0BF10865CC5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_285E8EE44AB898E3C307A999549AC386) == 0x0008A0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_285E8EE44AB898E3C307A999549AC386' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_D9206A834A25961394AC9EAFBC5B3548) == 0x000940, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_D9206A834A25961394AC9EAFBC5B3548' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_686AF6704AECFEEA0EFF0BAE1594AAC9) == 0x000980, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_686AF6704AECFEEA0EFF0BAE1594AAC9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_EB5D8BAF49E31A6417C889A02EBAFE52) == 0x000A20, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_EB5D8BAF49E31A6417C889A02EBAFE52' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_E64D26F34D1D6D3D6A02FDAC0153446D) == 0x000A60, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_E64D26F34D1D6D3D6A02FDAC0153446D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_8D8AC1AD40AD002E07E96C969EC2E1A0) == 0x000B00, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_8D8AC1AD40AD002E07E96C969EC2E1A0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_26467A024A027F9D6A9653848AE47553) == 0x000B40, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_26467A024A027F9D6A9653848AE47553' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_3D7426F145BC7B056F3D27A25B3177BF) == 0x000BE0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_3D7426F145BC7B056F3D27A25B3177BF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_8F9D1A5D426378B83EB35888A4B87883) == 0x000C20, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_8F9D1A5D426378B83EB35888A4B87883' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateResult_86944C3942A0A0BBEBD19BAEE747BA2F) == 0x000CC0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateResult_86944C3942A0A0BBEBD19BAEE747BA2F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_StateMachine_D594656F47CC8E597F7B1D967BB5B82D) == 0x000D00, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_StateMachine_D594656F47CC8E597F7B1D967BB5B82D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_LayeredBoneBlend_9C77C93B493F9B5104E1B5B3AEA900D8) == 0x000DE0, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_LayeredBoneBlend_9C77C93B493F9B5104E1B5B3AEA900D8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_BlendListByBool_A385B7A447381C74041F98876EB6D73D) == 0x000EB8, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_BlendListByBool_A385B7A447381C74041F98876EB6D73D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_29920B8041562C7020F77A9DC2CFCD16) == 0x000F88, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_29920B8041562C7020F77A9DC2CFCD16' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_M32_C, AnimGraphNode_SequencePlayer_5530674343990C1FBAE134A241EC6641) == 0x001028, "Member 'UAnimBP_Wpn_M32_C::AnimGraphNode_SequencePlayer_5530674343990C1FBAE134A241EC6641' has a wrong offset!");

}

