#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_HeavyRiot_Shield

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_HeavyRiot_Shield.AnimBP_HeavyRiot_Shield_C
// 0x05D8 (0x0930 - 0x0358)
class UAnimBP_HeavyRiot_Shield_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_6F93EAAE4AE3D4E01DD239A0DE334AD9; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6AE8EF1B435D3C4784EF6EA09FB9AE9D; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9BD933114015007E138E4EB2CAA77806; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BD54F5DF4DBC76D9A0083384F8BF5558; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CD416A3B402EE8F133C7709BD219A987; // 0x0480(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_508526C54900595B1DFE0FB00CF50CB1; // 0x04C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7D64605C4B17E29835DDA489F240E0AF; // 0x0568(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B3E13D0A409AB72216179EB483DC39C2; // 0x05A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E2B896F045B5483973B25ABC66984416; // 0x0648(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C9D093204930C03F880BA7887D0B5F87; // 0x0688(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9E8DF09744407A5D4A17AAAF4A01C1D9; // 0x0728(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7DC9EA4E4DACCABC8A586286046B095A; // 0x0768(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7C79417049DA020EB071019817BDA346; // 0x0808(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B58EAACE40C4F1DFD4ED0382FC2B4F24; // 0x0848(0x00E0)()
	bool                                          IsDefend;                                          // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_HeavyRiot_Shield(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HeavyRiot_Shield_AnimGraphNode_TransitionResult_BD54F5DF4DBC76D9A0083384F8BF5558();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HeavyRiot_Shield_AnimGraphNode_TransitionResult_6AE8EF1B435D3C4784EF6EA09FB9AE9D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_HeavyRiot_Shield_C">();
	}
	static class UAnimBP_HeavyRiot_Shield_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_HeavyRiot_Shield_C>();
	}
};
static_assert(alignof(UAnimBP_HeavyRiot_Shield_C) == 0x000008, "Wrong alignment on UAnimBP_HeavyRiot_Shield_C");
static_assert(sizeof(UAnimBP_HeavyRiot_Shield_C) == 0x000930, "Wrong size on UAnimBP_HeavyRiot_Shield_C");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_HeavyRiot_Shield_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_Root_6F93EAAE4AE3D4E01DD239A0DE334AD9) == 0x000368, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_Root_6F93EAAE4AE3D4E01DD239A0DE334AD9' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_TransitionResult_6AE8EF1B435D3C4784EF6EA09FB9AE9D) == 0x0003A8, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_TransitionResult_6AE8EF1B435D3C4784EF6EA09FB9AE9D' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_TransitionResult_9BD933114015007E138E4EB2CAA77806) == 0x0003F0, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_TransitionResult_9BD933114015007E138E4EB2CAA77806' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_TransitionResult_BD54F5DF4DBC76D9A0083384F8BF5558) == 0x000438, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_TransitionResult_BD54F5DF4DBC76D9A0083384F8BF5558' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_TransitionResult_CD416A3B402EE8F133C7709BD219A987) == 0x000480, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_TransitionResult_CD416A3B402EE8F133C7709BD219A987' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_SequencePlayer_508526C54900595B1DFE0FB00CF50CB1) == 0x0004C8, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_SequencePlayer_508526C54900595B1DFE0FB00CF50CB1' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_StateResult_7D64605C4B17E29835DDA489F240E0AF) == 0x000568, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_StateResult_7D64605C4B17E29835DDA489F240E0AF' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_SequencePlayer_B3E13D0A409AB72216179EB483DC39C2) == 0x0005A8, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_SequencePlayer_B3E13D0A409AB72216179EB483DC39C2' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_StateResult_E2B896F045B5483973B25ABC66984416) == 0x000648, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_StateResult_E2B896F045B5483973B25ABC66984416' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_SequencePlayer_C9D093204930C03F880BA7887D0B5F87) == 0x000688, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_SequencePlayer_C9D093204930C03F880BA7887D0B5F87' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_StateResult_9E8DF09744407A5D4A17AAAF4A01C1D9) == 0x000728, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_StateResult_9E8DF09744407A5D4A17AAAF4A01C1D9' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_SequencePlayer_7DC9EA4E4DACCABC8A586286046B095A) == 0x000768, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_SequencePlayer_7DC9EA4E4DACCABC8A586286046B095A' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_StateResult_7C79417049DA020EB071019817BDA346) == 0x000808, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_StateResult_7C79417049DA020EB071019817BDA346' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, AnimGraphNode_StateMachine_B58EAACE40C4F1DFD4ED0382FC2B4F24) == 0x000848, "Member 'UAnimBP_HeavyRiot_Shield_C::AnimGraphNode_StateMachine_B58EAACE40C4F1DFD4ED0382FC2B4F24' has a wrong offset!");
static_assert(offsetof(UAnimBP_HeavyRiot_Shield_C, IsDefend) == 0x000928, "Member 'UAnimBP_HeavyRiot_Shield_C::IsDefend' has a wrong offset!");

}

