#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_SniperNew

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_Wpn_SniperNew.AnimBP_Wpn_SniperNew_C.ExecuteUbergraph_AnimBP_Wpn_SniperNew
// 0x0038 (0x0038 - 0x0000)
struct AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWpnBase_C*                           K2Node_DynamicCast_AsBPWpn_Base;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWpnBase_C*                           K2Node_DynamicCast_AsBPWpn_Base1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew) == 0x000008, "Wrong alignment on AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew");
static_assert(sizeof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew) == 0x000038, "Wrong size on AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, EntryPoint) == 0x000000, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, K2Node_DynamicCast_AsBPWpn_Base) == 0x000010, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::K2Node_DynamicCast_AsBPWpn_Base' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, CallFunc_Add_FloatFloat_ReturnValue) == 0x00001C, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, CallFunc_GetOwningActor_ReturnValue1) == 0x000020, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::CallFunc_GetOwningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, K2Node_DynamicCast_AsBPWpn_Base1) == 0x000028, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::K2Node_DynamicCast_AsBPWpn_Base1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000031, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000034, "Member 'AnimBP_Wpn_SniperNew_C_ExecuteUbergraph_AnimBP_Wpn_SniperNew::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");

// Function AnimBP_Wpn_SniperNew.AnimBP_Wpn_SniperNew_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_Wpn_SniperNew_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

