#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lv2_Gia

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Lv2_Gia.AnimBP_Lv2_Gia_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_Lv2_Gia_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_Lv2_Gia.AnimBP_Lv2_Gia_C.ExecuteUbergraph_AnimBP_Lv2_Gia
// 0x0138 (0x0138 - 0x0000)
struct AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue5;        // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia1;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue4; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue6;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia2;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue3;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia3;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue4;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia4;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia) == 0x000008, "Wrong alignment on AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia");
static_assert(sizeof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia) == 0x000138, "Wrong size on AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, EntryPoint) == 0x000000, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000009, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1) == 0x00000C, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000010, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000011, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000013, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2) == 0x000014, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000018, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue1) == 0x000019, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x00001C, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue2) == 0x000020, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x000021, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000022, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000023, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3) == 0x000024, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BooleanOR_ReturnValue) == 0x000028, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue5) == 0x000029, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue3) == 0x00002A, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x00002B, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00002C, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_Conv_BoolToFloat_ReturnValue1) == 0x000030, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_Conv_BoolToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_Event_DeltaTimeX) == 0x000034, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000038, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetGameInstance_ReturnValue) == 0x000040, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Gia) == 0x000048, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Gia' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000058, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000064, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000080, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetVelocity_ReturnValue) == 0x00008C, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_FindLookAtRotation_ReturnValue) == 0x000098, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_VSize_ReturnValue) == 0x0000A4, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000A8, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BreakRotator_Roll) == 0x0000B4, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BreakRotator_Pitch) == 0x0000B8, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_BreakRotator_Yaw) == 0x0000BC, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_MakeRotator_ReturnValue) == 0x0000C0, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_TryGetPawnOwner_ReturnValue1) == 0x0000D0, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_TryGetPawnOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Gia1) == 0x0000D8, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Gia1' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess2) == 0x0000E0, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue4) == 0x0000E4, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue6) == 0x0000E8, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x0000F0, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Gia2) == 0x0000F8, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Gia2' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess3) == 0x000100, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_TryGetPawnOwner_ReturnValue3) == 0x000108, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_TryGetPawnOwner_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Gia3) == 0x000110, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Gia3' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess4) == 0x000118, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, CallFunc_TryGetPawnOwner_ReturnValue4) == 0x000120, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::CallFunc_TryGetPawnOwner_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Gia4) == 0x000128, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Gia4' has a wrong offset!");
static_assert(offsetof(AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia, K2Node_DynamicCast_bSuccess5) == 0x000130, "Member 'AnimBP_Lv2_Gia_C_ExecuteUbergraph_AnimBP_Lv2_Gia::K2Node_DynamicCast_bSuccess5' has a wrong offset!");

}

