#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Clip_SniperAAC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Clip_SniperAAC.AnimBP_Clip_SniperAAC_C
// 0x02C8 (0x0638 - 0x0370)
class UAnimBP_Clip_SniperAAC_C final : public UClipAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E55C412D4F00BE92950086A127155A5E; // 0x0378(0x0040)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_FB568EB241F58A7B63CFB48C4650AC57; // 0x03B8(0x01E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CE627FD44588D79457E9A98A9DF43F36; // 0x0598(0x00A0)()

public:
	void ExecuteUbergraph_AnimBP_Clip_SniperAAC(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Clip_SniperAAC_C">();
	}
	static class UAnimBP_Clip_SniperAAC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Clip_SniperAAC_C>();
	}
};
static_assert(alignof(UAnimBP_Clip_SniperAAC_C) == 0x000008, "Wrong alignment on UAnimBP_Clip_SniperAAC_C");
static_assert(sizeof(UAnimBP_Clip_SniperAAC_C) == 0x000638, "Wrong size on UAnimBP_Clip_SniperAAC_C");
static_assert(offsetof(UAnimBP_Clip_SniperAAC_C, UberGraphFrame) == 0x000370, "Member 'UAnimBP_Clip_SniperAAC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_SniperAAC_C, AnimGraphNode_Root_E55C412D4F00BE92950086A127155A5E) == 0x000378, "Member 'UAnimBP_Clip_SniperAAC_C::AnimGraphNode_Root_E55C412D4F00BE92950086A127155A5E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_SniperAAC_C, AnimGraphNode_RotationOffsetBlendSpace_FB568EB241F58A7B63CFB48C4650AC57) == 0x0003B8, "Member 'UAnimBP_Clip_SniperAAC_C::AnimGraphNode_RotationOffsetBlendSpace_FB568EB241F58A7B63CFB48C4650AC57' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_SniperAAC_C, AnimGraphNode_SequencePlayer_CE627FD44588D79457E9A98A9DF43F36) == 0x000598, "Member 'UAnimBP_Clip_SniperAAC_C::AnimGraphNode_SequencePlayer_CE627FD44588D79457E9A98A9DF43F36' has a wrong offset!");

}

