#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_GrenadeLauncher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_GrenadeLauncher.AnimBP_Wpn_GrenadeLauncher_C
// 0x0CB8 (0x10C8 - 0x0410)
class UAnimBP_Wpn_GrenadeLauncher_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0DB399BE4513E079679373BDD30C5D4C; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1006A55435654BE912DCF906F4BD2DC; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7CE968424658511997B9B2A5B3D3F2BB; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DB5BB5F64E84B0E58C6628825B0EC624; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F3EA405F42F0DD197307828F9C665A15; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7262ABE84721D2FD50509EA8FA2F3E65; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B0525AE04CDC9282D92F62A99A8BE5AE; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_685E580E4DE39B112A3EE3BF48F1C48C; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_635485B14A96028103D709A2A087043A; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D4FBC0924AD79E7FC45FEE933642843D; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_86AAA14E4CFA01AC9AA691AA62ECAAE4; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3FB37ADB48B4E1161F6968B065D22C93; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C37C6AC448AB115CB1BDCA9FDFE94F6A; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_05B14CEA481716E84D4A2DBA28422676; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9CE3AB614C59D2382EF852A98F69EAD7; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C96765E1416ECAAF2B5114B13A708420; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33D72EF14C4FF61CA2E2B1BDF4C02BE5; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40277E0B49585E7F5804C385B028F90F; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CD8B28B6483BA92EC95E37B6951A625E; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17CE9F2A479FA0250E0DE69D224529B3; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CF427B184133C364818EF299A72C9FAB; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_783DB1A94858B5C21B5D85A1F0F57BD5; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39DF0F324DEED67A6D79B19C30CD354A; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E46C9F7541381914076105BBF627E706; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FC5272424DEE29BE9578BAB5C4E6A4FB; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_191F16574478112D8802EE980C5B529A; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B5FE0C5D454DBF69600F92BE5688EACF; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2522751D4CE71332D2C953BEB4C30755; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4D4DEE3E411B1BC9313B13900BD85D5F; // 0x1028(0x00A0)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GrenadeLauncher_AnimGraphNode_TransitionResult_B0525AE04CDC9282D92F62A99A8BE5AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GrenadeLauncher_AnimGraphNode_TransitionResult_7CE968424658511997B9B2A5B3D3F2BB();
	void ExecuteUbergraph_AnimBP_Wpn_GrenadeLauncher(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GrenadeLauncher_AnimGraphNode_TransitionResult_DB5BB5F64E84B0E58C6628825B0EC624();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GrenadeLauncher_AnimGraphNode_TransitionResult_B1006A55435654BE912DCF906F4BD2DC();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_GrenadeLauncher_C">();
	}
	static class UAnimBP_Wpn_GrenadeLauncher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_GrenadeLauncher_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_GrenadeLauncher_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_GrenadeLauncher_C");
static_assert(sizeof(UAnimBP_Wpn_GrenadeLauncher_C) == 0x0010C8, "Wrong size on UAnimBP_Wpn_GrenadeLauncher_C");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_Root_0DB399BE4513E079679373BDD30C5D4C) == 0x000418, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_Root_0DB399BE4513E079679373BDD30C5D4C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_B1006A55435654BE912DCF906F4BD2DC) == 0x000458, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_B1006A55435654BE912DCF906F4BD2DC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_7CE968424658511997B9B2A5B3D3F2BB) == 0x0004A0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_7CE968424658511997B9B2A5B3D3F2BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_DB5BB5F64E84B0E58C6628825B0EC624) == 0x0004E8, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_DB5BB5F64E84B0E58C6628825B0EC624' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_F3EA405F42F0DD197307828F9C665A15) == 0x000530, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_F3EA405F42F0DD197307828F9C665A15' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_7262ABE84721D2FD50509EA8FA2F3E65) == 0x000578, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_7262ABE84721D2FD50509EA8FA2F3E65' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_B0525AE04CDC9282D92F62A99A8BE5AE) == 0x0005C0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_B0525AE04CDC9282D92F62A99A8BE5AE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_685E580E4DE39B112A3EE3BF48F1C48C) == 0x000608, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_685E580E4DE39B112A3EE3BF48F1C48C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_635485B14A96028103D709A2A087043A) == 0x000650, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_635485B14A96028103D709A2A087043A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_TransitionResult_D4FBC0924AD79E7FC45FEE933642843D) == 0x000698, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_TransitionResult_D4FBC0924AD79E7FC45FEE933642843D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_86AAA14E4CFA01AC9AA691AA62ECAAE4) == 0x0006E0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_86AAA14E4CFA01AC9AA691AA62ECAAE4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_3FB37ADB48B4E1161F6968B065D22C93) == 0x000780, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_3FB37ADB48B4E1161F6968B065D22C93' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_C37C6AC448AB115CB1BDCA9FDFE94F6A) == 0x0007C0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_C37C6AC448AB115CB1BDCA9FDFE94F6A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_05B14CEA481716E84D4A2DBA28422676) == 0x000860, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_05B14CEA481716E84D4A2DBA28422676' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_9CE3AB614C59D2382EF852A98F69EAD7) == 0x0008A0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_9CE3AB614C59D2382EF852A98F69EAD7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_C96765E1416ECAAF2B5114B13A708420) == 0x000940, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_C96765E1416ECAAF2B5114B13A708420' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_33D72EF14C4FF61CA2E2B1BDF4C02BE5) == 0x000980, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_33D72EF14C4FF61CA2E2B1BDF4C02BE5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_40277E0B49585E7F5804C385B028F90F) == 0x000A20, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_40277E0B49585E7F5804C385B028F90F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_CD8B28B6483BA92EC95E37B6951A625E) == 0x000A60, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_CD8B28B6483BA92EC95E37B6951A625E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_17CE9F2A479FA0250E0DE69D224529B3) == 0x000B00, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_17CE9F2A479FA0250E0DE69D224529B3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_CF427B184133C364818EF299A72C9FAB) == 0x000B40, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_CF427B184133C364818EF299A72C9FAB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_783DB1A94858B5C21B5D85A1F0F57BD5) == 0x000BE0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_783DB1A94858B5C21B5D85A1F0F57BD5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_39DF0F324DEED67A6D79B19C30CD354A) == 0x000C20, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_39DF0F324DEED67A6D79B19C30CD354A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateResult_E46C9F7541381914076105BBF627E706) == 0x000CC0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateResult_E46C9F7541381914076105BBF627E706' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_StateMachine_FC5272424DEE29BE9578BAB5C4E6A4FB) == 0x000D00, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_StateMachine_FC5272424DEE29BE9578BAB5C4E6A4FB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_LayeredBoneBlend_191F16574478112D8802EE980C5B529A) == 0x000DE0, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_LayeredBoneBlend_191F16574478112D8802EE980C5B529A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_BlendListByBool_B5FE0C5D454DBF69600F92BE5688EACF) == 0x000EB8, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_BlendListByBool_B5FE0C5D454DBF69600F92BE5688EACF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_2522751D4CE71332D2C953BEB4C30755) == 0x000F88, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_2522751D4CE71332D2C953BEB4C30755' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GrenadeLauncher_C, AnimGraphNode_SequencePlayer_4D4DEE3E411B1BC9313B13900BD85D5F) == 0x001028, "Member 'UAnimBP_Wpn_GrenadeLauncher_C::AnimGraphNode_SequencePlayer_4D4DEE3E411B1BC9313B13900BD85D5F' has a wrong offset!");

}

