#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_GunAy_New

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Wpn_GunAy_New.AnimBP_Wpn_GunAy_New_C.ExecuteUbergraph_AnimBP_Wpn_GunAy_New
// 0x00A8 (0x00A8 - 0x0000)
struct AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue2;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue1;                         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New) == 0x000008, "Wrong alignment on AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New");
static_assert(sizeof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New) == 0x0000A8, "Wrong size on AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, EntryPoint) == 0x000000, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_AsBPWeapon_Base) == 0x000010, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_AsBPWeapon_Base' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x00001C, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000020, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000021, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanOR_ReturnValue) == 0x000024, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000028, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Less_FloatFloat_ReturnValue) == 0x00002C, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, Temp_bool_Has_Been_Initd_Variable) == 0x00002D, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue1) == 0x00002E, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1) == 0x000030, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000034, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Not_PreBool_ReturnValue1) == 0x000035, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue2) == 0x000036, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Not_PreBool_ReturnValue2) == 0x000037, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue3) == 0x000038, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue4) == 0x000039, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Abs_ReturnValue) == 0x00003C, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_MapRangeClamped_ReturnValue) == 0x000040, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, Temp_bool_IsClosed_Variable) == 0x000044, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_Event_DeltaTimeX) == 0x000054, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2) == 0x000058, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x00005C, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Add_FloatFloat_ReturnValue) == 0x000060, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetOwningActor_ReturnValue1) == 0x000068, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetOwningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_AsBPWeapon_Base1) == 0x000070, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_AsBPWeapon_Base1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GetOwningActor_ReturnValue2) == 0x000080, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GetOwningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_AsBPWeapon_Base2) == 0x000088, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_AsBPWeapon_Base2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, K2Node_DynamicCast_bSuccess2) == 0x000090, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Abs_ReturnValue1) == 0x000094, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Abs_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Not_PreBool_ReturnValue3) == 0x000098, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000099, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Not_PreBool_ReturnValue4) == 0x00009A, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_BooleanAND_ReturnValue5) == 0x00009B, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00009C, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x0000A0, "Member 'AnimBP_Wpn_GunAy_New_C_ExecuteUbergraph_AnimBP_Wpn_GunAy_New::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");

// Function AnimBP_Wpn_GunAy_New.AnimBP_Wpn_GunAy_New_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_Wpn_GunAy_New_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

