#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_CarlHand

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_CarlHand.AnimBP_CarlHand_C.ExecuteUbergraph_AnimBP_CarlHand
// 0x0180 (0x0180 - 0x0000)
struct AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable4;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable5;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable6;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable7;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable8;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable9;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable10;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable11;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable12;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable13;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable14;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable15;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable16;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable17;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable18;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable19;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable20;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable21;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable22;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable23;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable24;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable25;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable26;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable27;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable28;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Temp_object_Variable29;                            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable30;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable31;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable32;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable33;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable34;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable35;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable36;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Temp_object_Variable37;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    Temp_byte_Variable1;                               // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select1_Default;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_LeftHand_Car_C*                 K2Node_DynamicCast_AsBP_Lv_2_Left_Hand__Car;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand) == 0x000008, "Wrong alignment on AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand");
static_assert(sizeof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand) == 0x000180, "Wrong size on AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, EntryPoint) == 0x000000, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable) == 0x000008, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable1) == 0x000010, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable2) == 0x000018, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable3) == 0x000020, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable4) == 0x000028, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable5) == 0x000030, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable6) == 0x000038, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable7) == 0x000040, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable8) == 0x000048, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable9) == 0x000050, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable10) == 0x000058, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable11) == 0x000060, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable12) == 0x000068, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable12' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable13) == 0x000070, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable13' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable14) == 0x000078, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable14' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable15) == 0x000080, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable15' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable16) == 0x000088, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable16' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable17) == 0x000090, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable17' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable18) == 0x000098, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable18' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_byte_Variable) == 0x0000A0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable19) == 0x0000A8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable19' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable20) == 0x0000B0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable20' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable21) == 0x0000B8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable21' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable22) == 0x0000C0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable22' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable23) == 0x0000C8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable23' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable24) == 0x0000D0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable24' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable25) == 0x0000D8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable25' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable26) == 0x0000E0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable26' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable27) == 0x0000E8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable27' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable28) == 0x0000F0, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable28' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, K2Node_Select_Default) == 0x0000F8, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000100, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, CallFunc_Less_FloatFloat_ReturnValue) == 0x000104, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable29) == 0x000108, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable29' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable30) == 0x000110, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable30' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable31) == 0x000118, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable31' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable32) == 0x000120, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable32' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable33) == 0x000128, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable33' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable34) == 0x000130, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable34' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable35) == 0x000138, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable35' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable36) == 0x000140, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable36' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_object_Variable37) == 0x000148, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_object_Variable37' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, Temp_byte_Variable1) == 0x000150, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, K2Node_Select1_Default) == 0x000158, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, K2Node_Event_DeltaTimeX) == 0x000160, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, CallFunc_GetOwningActor_ReturnValue) == 0x000168, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, K2Node_DynamicCast_AsBP_Lv_2_Left_Hand__Car) == 0x000170, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::K2Node_DynamicCast_AsBP_Lv_2_Left_Hand__Car' has a wrong offset!");
static_assert(offsetof(AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand, K2Node_DynamicCast_bSuccess) == 0x000178, "Member 'AnimBP_CarlHand_C_ExecuteUbergraph_AnimBP_CarlHand::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AnimBP_CarlHand.AnimBP_CarlHand_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_CarlHand_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_CarlHand_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_CarlHand_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_CarlHand_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_CarlHand_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_CarlHand_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_CarlHand_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

