#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimIK

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimIK.IKAnimInstance.SetHeadIKEnable
// 0x0001 (0x0001 - 0x0000)
struct IKAnimInstance_SetHeadIKEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IKAnimInstance_SetHeadIKEnable) == 0x000001, "Wrong alignment on IKAnimInstance_SetHeadIKEnable");
static_assert(sizeof(IKAnimInstance_SetHeadIKEnable) == 0x000001, "Wrong size on IKAnimInstance_SetHeadIKEnable");
static_assert(offsetof(IKAnimInstance_SetHeadIKEnable, Enable) == 0x000000, "Member 'IKAnimInstance_SetHeadIKEnable::Enable' has a wrong offset!");

// Function AnimIK.IKAnimInstance.GetCameraHeight
// 0x0004 (0x0004 - 0x0000)
struct IKAnimInstance_GetCameraHeight final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(IKAnimInstance_GetCameraHeight) == 0x000004, "Wrong alignment on IKAnimInstance_GetCameraHeight");
static_assert(sizeof(IKAnimInstance_GetCameraHeight) == 0x000004, "Wrong size on IKAnimInstance_GetCameraHeight");
static_assert(offsetof(IKAnimInstance_GetCameraHeight, ReturnValue) == 0x000000, "Member 'IKAnimInstance_GetCameraHeight::ReturnValue' has a wrong offset!");

}

