#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_AttackDrone

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_AttackDrone.AnimBP_AttackDrone_C.ExecuteUbergraph_AnimBP_AttackDrone
// 0x0048 (0x0048 - 0x0000)
struct AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AttackDrone_C*                      K2Node_DynamicCast_AsBP_Attack_Drone;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone) == 0x000008, "Wrong alignment on AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone");
static_assert(sizeof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone) == 0x000048, "Wrong size on AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, EntryPoint) == 0x000000, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1) == 0x000008, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x00000D, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2) == 0x000010, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000014, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_BooleanAND_ReturnValue) == 0x000016, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_Not_PreBool_ReturnValue1) == 0x000017, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_BooleanAND_ReturnValue1) == 0x000018, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x00001C, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000020, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_Less_FloatFloat_ReturnValue) == 0x000024, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000025, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000028, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_Conv_BoolToFloat_ReturnValue1) == 0x00002C, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_Conv_BoolToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000030, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, K2Node_DynamicCast_AsBP_Attack_Drone) == 0x000038, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::K2Node_DynamicCast_AsBP_Attack_Drone' has a wrong offset!");
static_assert(offsetof(AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AnimBP_AttackDrone_C_ExecuteUbergraph_AnimBP_AttackDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

