#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_Pistol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_Pistol.AnimBP_Wpn_Pistol_C
// 0x09A0 (0x0CF8 - 0x0358)
class UAnimBP_Wpn_Pistol_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_E237E33C4CC7B05C54C287B034776F9E; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45E829794CA0BAE2F83453BFC5388E4F; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4342188648E372BA0BD8BFB847DBC833; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11061B3F4EF4EDD0F84D0EA8460DF6D1; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_788DFE0A42375A65E2F3DC982BF397D3; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138CCB7542E95E3B2C6F32AFCAF7E198; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4919ECE04935FEF113B0ED91134C015F; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97AA60AD464156282D9CFF9A98420FDB; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D096550D470226E738D32D8EB775C6E4; // 0x05A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1654B27E46FFA4E0A1DE61BE4EC601A6; // 0x05E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FBEF33FD47BDAEBA513D30BBAC9B93D0; // 0x0688(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2ED79C604E4CDB8351E9CA875C4B7F91; // 0x06C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21647674486701E19F2C07A8C4C29DC1; // 0x0768(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_340CAE694AA2B4C5F09D18B8E3FEF0A5; // 0x07A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_174FEF7540B45100F7C34A9E5235E87B; // 0x0848(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5FF56AC1458CECBCB890D9AA8F5FBB50; // 0x0888(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3070CA5843257615DFDBDFAF41501A73; // 0x0928(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69628E1B4B3EAD3022F538B9FE413058; // 0x0968(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_979955CC492A2BBA12C12AA85213F097; // 0x0A08(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F453347246A97C91514968BCBBC82B1A; // 0x0A48(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_846F9BF9483366B1921E309964E95F0F; // 0x0AE8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75EFD11A4967489AE93573A6F1994AF2; // 0x0B28(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EA0283E44C660268DB3AE68937ACC7F4; // 0x0BC8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9CFFDA244F8A097B5CEA659AAFB3044E; // 0x0C08(0x00E0)()
	bool                                          TriggerFire;                                       // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TriggerReload;                                     // 0x0CE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TriggerClipEmpty;                                  // 0x0CEA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CEB[0x1];                                      // 0x0CEB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitTimer;                                         // 0x0CEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReloadTime;                                        // 0x0CF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxReloadTime;                                     // 0x0CF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_D096550D470226E738D32D8EB775C6E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_4919ECE04935FEF113B0ED91134C015F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_4342188648E372BA0BD8BFB847DBC833();
	void ExecuteUbergraph_AnimBP_Wpn_Pistol(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void AnimNotify_StartReload();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_138CCB7542E95E3B2C6F32AFCAF7E198();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_11061B3F4EF4EDD0F84D0EA8460DF6D1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_AnimGraphNode_TransitionResult_45E829794CA0BAE2F83453BFC5388E4F();
	void UpdateReloadDelay(float Delta);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_Pistol_C">();
	}
	static class UAnimBP_Wpn_Pistol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_Pistol_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_Pistol_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_Pistol_C");
static_assert(sizeof(UAnimBP_Wpn_Pistol_C) == 0x000CF8, "Wrong size on UAnimBP_Wpn_Pistol_C");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_Wpn_Pistol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_Root_E237E33C4CC7B05C54C287B034776F9E) == 0x000368, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_Root_E237E33C4CC7B05C54C287B034776F9E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_45E829794CA0BAE2F83453BFC5388E4F) == 0x0003A8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_45E829794CA0BAE2F83453BFC5388E4F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_4342188648E372BA0BD8BFB847DBC833) == 0x0003F0, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_4342188648E372BA0BD8BFB847DBC833' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_11061B3F4EF4EDD0F84D0EA8460DF6D1) == 0x000438, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_11061B3F4EF4EDD0F84D0EA8460DF6D1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_788DFE0A42375A65E2F3DC982BF397D3) == 0x000480, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_788DFE0A42375A65E2F3DC982BF397D3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_138CCB7542E95E3B2C6F32AFCAF7E198) == 0x0004C8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_138CCB7542E95E3B2C6F32AFCAF7E198' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_4919ECE04935FEF113B0ED91134C015F) == 0x000510, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_4919ECE04935FEF113B0ED91134C015F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_97AA60AD464156282D9CFF9A98420FDB) == 0x000558, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_97AA60AD464156282D9CFF9A98420FDB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_TransitionResult_D096550D470226E738D32D8EB775C6E4) == 0x0005A0, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_TransitionResult_D096550D470226E738D32D8EB775C6E4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_1654B27E46FFA4E0A1DE61BE4EC601A6) == 0x0005E8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_1654B27E46FFA4E0A1DE61BE4EC601A6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_FBEF33FD47BDAEBA513D30BBAC9B93D0) == 0x000688, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_FBEF33FD47BDAEBA513D30BBAC9B93D0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_2ED79C604E4CDB8351E9CA875C4B7F91) == 0x0006C8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_2ED79C604E4CDB8351E9CA875C4B7F91' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_21647674486701E19F2C07A8C4C29DC1) == 0x000768, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_21647674486701E19F2C07A8C4C29DC1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_340CAE694AA2B4C5F09D18B8E3FEF0A5) == 0x0007A8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_340CAE694AA2B4C5F09D18B8E3FEF0A5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_174FEF7540B45100F7C34A9E5235E87B) == 0x000848, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_174FEF7540B45100F7C34A9E5235E87B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_5FF56AC1458CECBCB890D9AA8F5FBB50) == 0x000888, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_5FF56AC1458CECBCB890D9AA8F5FBB50' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_3070CA5843257615DFDBDFAF41501A73) == 0x000928, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_3070CA5843257615DFDBDFAF41501A73' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_69628E1B4B3EAD3022F538B9FE413058) == 0x000968, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_69628E1B4B3EAD3022F538B9FE413058' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_979955CC492A2BBA12C12AA85213F097) == 0x000A08, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_979955CC492A2BBA12C12AA85213F097' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_F453347246A97C91514968BCBBC82B1A) == 0x000A48, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_F453347246A97C91514968BCBBC82B1A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_846F9BF9483366B1921E309964E95F0F) == 0x000AE8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_846F9BF9483366B1921E309964E95F0F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_SequencePlayer_75EFD11A4967489AE93573A6F1994AF2) == 0x000B28, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_SequencePlayer_75EFD11A4967489AE93573A6F1994AF2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateResult_EA0283E44C660268DB3AE68937ACC7F4) == 0x000BC8, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateResult_EA0283E44C660268DB3AE68937ACC7F4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, AnimGraphNode_StateMachine_9CFFDA244F8A097B5CEA659AAFB3044E) == 0x000C08, "Member 'UAnimBP_Wpn_Pistol_C::AnimGraphNode_StateMachine_9CFFDA244F8A097B5CEA659AAFB3044E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, TriggerFire) == 0x000CE8, "Member 'UAnimBP_Wpn_Pistol_C::TriggerFire' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, TriggerReload) == 0x000CE9, "Member 'UAnimBP_Wpn_Pistol_C::TriggerReload' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, TriggerClipEmpty) == 0x000CEA, "Member 'UAnimBP_Wpn_Pistol_C::TriggerClipEmpty' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, WaitTimer) == 0x000CEC, "Member 'UAnimBP_Wpn_Pistol_C::WaitTimer' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, ReloadTime) == 0x000CF0, "Member 'UAnimBP_Wpn_Pistol_C::ReloadTime' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_C, MaxReloadTime) == 0x000CF4, "Member 'UAnimBP_Wpn_Pistol_C::MaxReloadTime' has a wrong offset!");

}

