#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_newHand_Lv4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_newHand_Lv4.AnimBP_newHand_Lv4_C
// 0x25D8 (0x2958 - 0x0380)
class UAnimBP_newHand_Lv4_C final : public UCharacterHandAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8C8C98C04BFFE2FE16F1CBAA29C52EFD; // 0x0388(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_DEEFF08E4B5D9D657C1A3CB76F768E35; // 0x03C8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA5975FF4F67FB03C3DF878F9640C1DD; // 0x0498(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B74CBDDD4F564F85D2B7039D9DFD2531; // 0x0538(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AF61BBAC411F38113F60F89F479BCA05; // 0x0580(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7DBB7D6A4E631084B8CD78AFBC827A70; // 0x05C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5E2E1D8A4BE54F9E9F11DCADE510B808; // 0x0610(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E7D68D2B4C3A2BE5680A32B4FF0258C8; // 0x0658(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B8A40511412EE9DB9660FA9CA44ADF34; // 0x06A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64CDE32A4293C3A4400F9BBEDA85747F; // 0x06E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1D90510F4FF15EF18B5395AF8B6CA5FD; // 0x0730(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49A226A04E83536FC0C0B09304A90620; // 0x0778(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11A9E7EC498951E008FAC5BBA9F1876A; // 0x07C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4D9C90104D70F2A30D08A7AB280BAC79; // 0x0808(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D09A1987486D18FAE732099295EF64AD; // 0x0850(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_23E0B3B24158A8F9E52506933DAB35E3; // 0x0898(0x0138)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CF11FA144087469AD178A3807E9C9BA6; // 0x09D0(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_20FE73D14C1CF379A85B69AF1560CD98; // 0x0A70(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E5FED4AA4C4D617E2B8728813C52FADC; // 0x0BA8(0x0138)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_605E2BD54D1805F469C39FB4E0411D42; // 0x0CE0(0x0040)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1507F8194F514514E54A968D1E8D9D30; // 0x0D20(0x0040)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6D4A9BD44D49FBAD9327B588507A1EE4; // 0x0D60(0x0138)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_318846B545ED73C12354F681E9880656; // 0x0E98(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B04055674F325B95E31D97A32C839260; // 0x0ED8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4F90592E4AD6A0105C3CD995CB72A3C4; // 0x0F78(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_96B5B0874200FD413FFA898BAA2440B7; // 0x1018(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3189B3A44FB33EAEF44391858B6C5D0D; // 0x10B8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_EDF2383D407DC4414D0E9CA0A0E20A99; // 0x1158(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A1F92E2E4DD1115BC7B106A12405B9EC; // 0x1238(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9C1A8B324E7B164BBBA578B6073ABC8E; // 0x1278(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A0208F8D4E066630D112C4811038E525; // 0x1318(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1C199F43423A62933EAFABB6277C54BF; // 0x1358(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A843B58B417CB15A2BF78A938C31C3E3; // 0x13F8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A7E4331C41901809A520B2A87356DEFC; // 0x1438(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D77E87F4B7C8DA5B9B9BA98FF2357C2; // 0x14D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_593460654D6ED35FD22568993FDABA0B; // 0x1578(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_191E09124811A10684A30A8D69FCC263; // 0x1618(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5FC82E4741965B4C49AED99148F1A67D; // 0x16B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4CD88E214BB1435E2AEB29A7D985D4F8; // 0x1758(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FE5C9CB149888C64602414805CE8EFBE; // 0x17F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4A07EAE049D3184F5D4182947264FEA6; // 0x1898(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7499EA854778B18AC1672A98A90D78BD; // 0x1938(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A37B8343441EBEB48050B28907A2D163; // 0x19D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_534BD7C546DF1AD5A3B99AB08501885E; // 0x1A78(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA7C3ED743C4AD66E2689D947656FF73; // 0x1B18(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D10315B400115663ECBCAB0F38B0419; // 0x1BB8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_44AD594F441DC2577D55059CA8281FF4; // 0x1C58(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F3098F3D47EFFB5384AA6C9836F5FB59; // 0x1D38(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80B80C0640DDD50D80223A8D95B8BD67; // 0x1D78(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8C279402417B887AC9CB21AA136A7154; // 0x1E18(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3852C0ED4DA3D1BDE50912A3A469127C; // 0x1EB8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B240819041944A68B634BF8971306FA3; // 0x1F58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1927F3204D6D120AF3428C97AEC6D86C; // 0x1FF8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0AAECAC344EA09B26784D7B730BB0AD9; // 0x2098(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9456E36647DC6C4E0FC681957CBDC8FD; // 0x2138(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CF219C544E31C7F4CA91F3B13DAB5955; // 0x21D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_954E329648EA3BCDBC5460BEFEE33FF1; // 0x2278(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CAB7A62347934B665D5089A3EC955601; // 0x2318(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A197AD644A07A109CD74028280CCF831; // 0x23B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46E3A6B8441A763FA81679A49D7C4C6D; // 0x2458(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81CB402C4F7170BA997A52A1379D4BF2; // 0x24F8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_8A94FFB5407A7DF725FA89819421EDD4; // 0x2598(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FF65A3C84788254D9BD9F595ACDC6A9C; // 0x2678(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C19E272B43134F7527EDB983251AE393; // 0x26B8(0x00E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9C6833364610598BE69974938B0BCF13; // 0x2798(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_41061E9647DB9007725F7E82A5B4BDE4; // 0x28D0(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C3BD3DA342B8F4A8873DB4AD9D666744; // 0x2910(0x0040)()
	EItemTypes                                    WeaponType;                                        // 0x2950(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDriveHold;                                       // 0x2951(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHold;                                            // 0x2952(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_newHand_Lv4_AnimGraphNode_SequencePlayer_1C199F43423A62933EAFABB6277C54BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_newHand_Lv4_AnimGraphNode_SequencePlayer_9C1A8B324E7B164BBBA578B6073ABC8E();
	void ExecuteUbergraph_AnimBP_newHand_Lv4(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_newHand_Lv4_AnimGraphNode_TransitionResult_B74CBDDD4F564F85D2B7039D9DFD2531();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_newHand_Lv4_C">();
	}
	static class UAnimBP_newHand_Lv4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_newHand_Lv4_C>();
	}
};
static_assert(alignof(UAnimBP_newHand_Lv4_C) == 0x000008, "Wrong alignment on UAnimBP_newHand_Lv4_C");
static_assert(sizeof(UAnimBP_newHand_Lv4_C) == 0x002958, "Wrong size on UAnimBP_newHand_Lv4_C");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, UberGraphFrame) == 0x000380, "Member 'UAnimBP_newHand_Lv4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_Root_8C8C98C04BFFE2FE16F1CBAA29C52EFD) == 0x000388, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_Root_8C8C98C04BFFE2FE16F1CBAA29C52EFD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_BlendListByBool_DEEFF08E4B5D9D657C1A3CB76F768E35) == 0x0003C8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_BlendListByBool_DEEFF08E4B5D9D657C1A3CB76F768E35' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_EA5975FF4F67FB03C3DF878F9640C1DD) == 0x000498, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_EA5975FF4F67FB03C3DF878F9640C1DD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_B74CBDDD4F564F85D2B7039D9DFD2531) == 0x000538, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_B74CBDDD4F564F85D2B7039D9DFD2531' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_AF61BBAC411F38113F60F89F479BCA05) == 0x000580, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_AF61BBAC411F38113F60F89F479BCA05' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_7DBB7D6A4E631084B8CD78AFBC827A70) == 0x0005C8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_7DBB7D6A4E631084B8CD78AFBC827A70' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_5E2E1D8A4BE54F9E9F11DCADE510B808) == 0x000610, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_5E2E1D8A4BE54F9E9F11DCADE510B808' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_E7D68D2B4C3A2BE5680A32B4FF0258C8) == 0x000658, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_E7D68D2B4C3A2BE5680A32B4FF0258C8' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_B8A40511412EE9DB9660FA9CA44ADF34) == 0x0006A0, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_B8A40511412EE9DB9660FA9CA44ADF34' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_64CDE32A4293C3A4400F9BBEDA85747F) == 0x0006E8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_64CDE32A4293C3A4400F9BBEDA85747F' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_1D90510F4FF15EF18B5395AF8B6CA5FD) == 0x000730, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_1D90510F4FF15EF18B5395AF8B6CA5FD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_49A226A04E83536FC0C0B09304A90620) == 0x000778, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_49A226A04E83536FC0C0B09304A90620' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_11A9E7EC498951E008FAC5BBA9F1876A) == 0x0007C0, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_11A9E7EC498951E008FAC5BBA9F1876A' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_4D9C90104D70F2A30D08A7AB280BAC79) == 0x000808, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_4D9C90104D70F2A30D08A7AB280BAC79' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_TransitionResult_D09A1987486D18FAE732099295EF64AD) == 0x000850, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_TransitionResult_D09A1987486D18FAE732099295EF64AD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ModifyBone_23E0B3B24158A8F9E52506933DAB35E3) == 0x000898, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ModifyBone_23E0B3B24158A8F9E52506933DAB35E3' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_CF11FA144087469AD178A3807E9C9BA6) == 0x0009D0, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_CF11FA144087469AD178A3807E9C9BA6' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ModifyBone_20FE73D14C1CF379A85B69AF1560CD98) == 0x000A70, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ModifyBone_20FE73D14C1CF379A85B69AF1560CD98' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ModifyBone_E5FED4AA4C4D617E2B8728813C52FADC) == 0x000BA8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ModifyBone_E5FED4AA4C4D617E2B8728813C52FADC' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ComponentToLocalSpace_605E2BD54D1805F469C39FB4E0411D42) == 0x000CE0, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ComponentToLocalSpace_605E2BD54D1805F469C39FB4E0411D42' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_LocalToComponentSpace_1507F8194F514514E54A968D1E8D9D30) == 0x000D20, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_LocalToComponentSpace_1507F8194F514514E54A968D1E8D9D30' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ModifyBone_6D4A9BD44D49FBAD9327B588507A1EE4) == 0x000D60, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ModifyBone_6D4A9BD44D49FBAD9327B588507A1EE4' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_318846B545ED73C12354F681E9880656) == 0x000E98, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_318846B545ED73C12354F681E9880656' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_B04055674F325B95E31D97A32C839260) == 0x000ED8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_B04055674F325B95E31D97A32C839260' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_4F90592E4AD6A0105C3CD995CB72A3C4) == 0x000F78, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_4F90592E4AD6A0105C3CD995CB72A3C4' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_96B5B0874200FD413FFA898BAA2440B7) == 0x001018, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_96B5B0874200FD413FFA898BAA2440B7' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_3189B3A44FB33EAEF44391858B6C5D0D) == 0x0010B8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_3189B3A44FB33EAEF44391858B6C5D0D' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_BlendListByEnum_EDF2383D407DC4414D0E9CA0A0E20A99) == 0x001158, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_BlendListByEnum_EDF2383D407DC4414D0E9CA0A0E20A99' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_A1F92E2E4DD1115BC7B106A12405B9EC) == 0x001238, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_A1F92E2E4DD1115BC7B106A12405B9EC' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_9C1A8B324E7B164BBBA578B6073ABC8E) == 0x001278, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_9C1A8B324E7B164BBBA578B6073ABC8E' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_A0208F8D4E066630D112C4811038E525) == 0x001318, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_A0208F8D4E066630D112C4811038E525' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_1C199F43423A62933EAFABB6277C54BF) == 0x001358, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_1C199F43423A62933EAFABB6277C54BF' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_A843B58B417CB15A2BF78A938C31C3E3) == 0x0013F8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_A843B58B417CB15A2BF78A938C31C3E3' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_A7E4331C41901809A520B2A87356DEFC) == 0x001438, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_A7E4331C41901809A520B2A87356DEFC' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_8D77E87F4B7C8DA5B9B9BA98FF2357C2) == 0x0014D8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_8D77E87F4B7C8DA5B9B9BA98FF2357C2' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_593460654D6ED35FD22568993FDABA0B) == 0x001578, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_593460654D6ED35FD22568993FDABA0B' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_191E09124811A10684A30A8D69FCC263) == 0x001618, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_191E09124811A10684A30A8D69FCC263' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_5FC82E4741965B4C49AED99148F1A67D) == 0x0016B8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_5FC82E4741965B4C49AED99148F1A67D' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_4CD88E214BB1435E2AEB29A7D985D4F8) == 0x001758, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_4CD88E214BB1435E2AEB29A7D985D4F8' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_FE5C9CB149888C64602414805CE8EFBE) == 0x0017F8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_FE5C9CB149888C64602414805CE8EFBE' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_4A07EAE049D3184F5D4182947264FEA6) == 0x001898, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_4A07EAE049D3184F5D4182947264FEA6' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_7499EA854778B18AC1672A98A90D78BD) == 0x001938, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_7499EA854778B18AC1672A98A90D78BD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_A37B8343441EBEB48050B28907A2D163) == 0x0019D8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_A37B8343441EBEB48050B28907A2D163' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_534BD7C546DF1AD5A3B99AB08501885E) == 0x001A78, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_534BD7C546DF1AD5A3B99AB08501885E' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_EA7C3ED743C4AD66E2689D947656FF73) == 0x001B18, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_EA7C3ED743C4AD66E2689D947656FF73' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_8D10315B400115663ECBCAB0F38B0419) == 0x001BB8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_8D10315B400115663ECBCAB0F38B0419' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_BlendListByEnum_44AD594F441DC2577D55059CA8281FF4) == 0x001C58, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_BlendListByEnum_44AD594F441DC2577D55059CA8281FF4' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_F3098F3D47EFFB5384AA6C9836F5FB59) == 0x001D38, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_F3098F3D47EFFB5384AA6C9836F5FB59' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_80B80C0640DDD50D80223A8D95B8BD67) == 0x001D78, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_80B80C0640DDD50D80223A8D95B8BD67' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_8C279402417B887AC9CB21AA136A7154) == 0x001E18, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_8C279402417B887AC9CB21AA136A7154' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_3852C0ED4DA3D1BDE50912A3A469127C) == 0x001EB8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_3852C0ED4DA3D1BDE50912A3A469127C' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_B240819041944A68B634BF8971306FA3) == 0x001F58, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_B240819041944A68B634BF8971306FA3' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_1927F3204D6D120AF3428C97AEC6D86C) == 0x001FF8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_1927F3204D6D120AF3428C97AEC6D86C' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_0AAECAC344EA09B26784D7B730BB0AD9) == 0x002098, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_0AAECAC344EA09B26784D7B730BB0AD9' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_9456E36647DC6C4E0FC681957CBDC8FD) == 0x002138, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_9456E36647DC6C4E0FC681957CBDC8FD' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_CF219C544E31C7F4CA91F3B13DAB5955) == 0x0021D8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_CF219C544E31C7F4CA91F3B13DAB5955' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_954E329648EA3BCDBC5460BEFEE33FF1) == 0x002278, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_954E329648EA3BCDBC5460BEFEE33FF1' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_CAB7A62347934B665D5089A3EC955601) == 0x002318, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_CAB7A62347934B665D5089A3EC955601' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_A197AD644A07A109CD74028280CCF831) == 0x0023B8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_A197AD644A07A109CD74028280CCF831' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_46E3A6B8441A763FA81679A49D7C4C6D) == 0x002458, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_46E3A6B8441A763FA81679A49D7C4C6D' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_SequencePlayer_81CB402C4F7170BA997A52A1379D4BF2) == 0x0024F8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_SequencePlayer_81CB402C4F7170BA997A52A1379D4BF2' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_BlendListByEnum_8A94FFB5407A7DF725FA89819421EDD4) == 0x002598, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_BlendListByEnum_8A94FFB5407A7DF725FA89819421EDD4' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateResult_FF65A3C84788254D9BD9F595ACDC6A9C) == 0x002678, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateResult_FF65A3C84788254D9BD9F595ACDC6A9C' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_StateMachine_C19E272B43134F7527EDB983251AE393) == 0x0026B8, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_StateMachine_C19E272B43134F7527EDB983251AE393' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ModifyBone_9C6833364610598BE69974938B0BCF13) == 0x002798, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ModifyBone_9C6833364610598BE69974938B0BCF13' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_LocalToComponentSpace_41061E9647DB9007725F7E82A5B4BDE4) == 0x0028D0, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_LocalToComponentSpace_41061E9647DB9007725F7E82A5B4BDE4' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, AnimGraphNode_ComponentToLocalSpace_C3BD3DA342B8F4A8873DB4AD9D666744) == 0x002910, "Member 'UAnimBP_newHand_Lv4_C::AnimGraphNode_ComponentToLocalSpace_C3BD3DA342B8F4A8873DB4AD9D666744' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, WeaponType) == 0x002950, "Member 'UAnimBP_newHand_Lv4_C::WeaponType' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, IsDriveHold) == 0x002951, "Member 'UAnimBP_newHand_Lv4_C::IsDriveHold' has a wrong offset!");
static_assert(offsetof(UAnimBP_newHand_Lv4_C, IsHold) == 0x002952, "Member 'UAnimBP_newHand_Lv4_C::IsHold' has a wrong offset!");

}

