#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Spark_Hand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Spark_Hand.AnimBP_Spark_Hand_C
// 0x11B8 (0x1538 - 0x0380)
class UAnimBP_Spark_Hand_C final : public UCharacterHandAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D63130644BF676CF398F429DA2CD3D29; // 0x0388(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5D5220C54F9F98EB8A74A1A033B98CCF; // 0x03C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_270AC9A643D5B511C6715691430ACBA9; // 0x0410(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_667063DA463B88C537FBC886F3BBED91; // 0x0458(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89AA749C443023C8EFCB1D9DF0953647; // 0x04F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6C2419474A026D9E7275C9B0A33BD064; // 0x0598(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AFE7A53C4CE13AE6979D6380086E4FD9; // 0x0638(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_87C41DF94E23664297A629AB0DFE679D; // 0x06D8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D55C63CA4A0AB9CF2136568AA7D02CD9; // 0x0778(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6004C4674C185386E2F2C6AA7F1827EC; // 0x0818(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EC2744D943E02D09B3B4E8B8E194E29B; // 0x08B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E59B28B74E866EF8918616ABBB451FC9; // 0x0958(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67EDF34D4DBAFB11D3D99C84ECA4B485; // 0x09F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E5226F0341CF2AE202D67D9865D3276B; // 0x0A98(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7B9FEC674747B612CDB328BEE37CDAE8; // 0x0B38(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5A7AC8F04B819AC3FA1CCEB1D4EB5A6C; // 0x0C18(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_858FC07E4B3C48E8E906FDADCFD57613; // 0x0C58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_913591C246A3122B5446268539CEA6E0; // 0x0CF8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B2F5923744BA9B943B360180ECBC494D; // 0x0D98(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A878645F4E3B8E3C0A9E828275DF7B31; // 0x0E38(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_018E9733412FFFD34D2E28BBBD3FC990; // 0x0ED8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47D160CD4CEB9F688EC2318A6E7062C4; // 0x0F78(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5771BE6D4F8BA546F3FB44AB2CF4AC28; // 0x1018(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EAD9F3FC4A20B0304BC71B9500F79919; // 0x10B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9783FE824947CD54B638138912068588; // 0x1158(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2A117526458CACF8847E79B2771A76B3; // 0x11F8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FB169262424B92328CDF5F8B557A24D7; // 0x1298(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_DDE0F8E64727A65F9DA21596D09546A3; // 0x1338(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0824999E455FB2EA193F92B4E584A27E; // 0x1418(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C187B9624A9D9E3BB568F7B0FDB9ECE6; // 0x1458(0x00E0)()

public:
	void ExecuteUbergraph_AnimBP_Spark_Hand(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Spark_Hand_C">();
	}
	static class UAnimBP_Spark_Hand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Spark_Hand_C>();
	}
};
static_assert(alignof(UAnimBP_Spark_Hand_C) == 0x000008, "Wrong alignment on UAnimBP_Spark_Hand_C");
static_assert(sizeof(UAnimBP_Spark_Hand_C) == 0x001538, "Wrong size on UAnimBP_Spark_Hand_C");
static_assert(offsetof(UAnimBP_Spark_Hand_C, UberGraphFrame) == 0x000380, "Member 'UAnimBP_Spark_Hand_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_Root_D63130644BF676CF398F429DA2CD3D29) == 0x000388, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_Root_D63130644BF676CF398F429DA2CD3D29' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_TransitionResult_5D5220C54F9F98EB8A74A1A033B98CCF) == 0x0003C8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_TransitionResult_5D5220C54F9F98EB8A74A1A033B98CCF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_TransitionResult_270AC9A643D5B511C6715691430ACBA9) == 0x000410, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_TransitionResult_270AC9A643D5B511C6715691430ACBA9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_667063DA463B88C537FBC886F3BBED91) == 0x000458, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_667063DA463B88C537FBC886F3BBED91' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_89AA749C443023C8EFCB1D9DF0953647) == 0x0004F8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_89AA749C443023C8EFCB1D9DF0953647' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_6C2419474A026D9E7275C9B0A33BD064) == 0x000598, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_6C2419474A026D9E7275C9B0A33BD064' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_AFE7A53C4CE13AE6979D6380086E4FD9) == 0x000638, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_AFE7A53C4CE13AE6979D6380086E4FD9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_87C41DF94E23664297A629AB0DFE679D) == 0x0006D8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_87C41DF94E23664297A629AB0DFE679D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_D55C63CA4A0AB9CF2136568AA7D02CD9) == 0x000778, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_D55C63CA4A0AB9CF2136568AA7D02CD9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_6004C4674C185386E2F2C6AA7F1827EC) == 0x000818, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_6004C4674C185386E2F2C6AA7F1827EC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_EC2744D943E02D09B3B4E8B8E194E29B) == 0x0008B8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_EC2744D943E02D09B3B4E8B8E194E29B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_E59B28B74E866EF8918616ABBB451FC9) == 0x000958, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_E59B28B74E866EF8918616ABBB451FC9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_67EDF34D4DBAFB11D3D99C84ECA4B485) == 0x0009F8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_67EDF34D4DBAFB11D3D99C84ECA4B485' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_E5226F0341CF2AE202D67D9865D3276B) == 0x000A98, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_E5226F0341CF2AE202D67D9865D3276B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_BlendListByEnum_7B9FEC674747B612CDB328BEE37CDAE8) == 0x000B38, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_BlendListByEnum_7B9FEC674747B612CDB328BEE37CDAE8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_StateResult_5A7AC8F04B819AC3FA1CCEB1D4EB5A6C) == 0x000C18, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_StateResult_5A7AC8F04B819AC3FA1CCEB1D4EB5A6C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_858FC07E4B3C48E8E906FDADCFD57613) == 0x000C58, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_858FC07E4B3C48E8E906FDADCFD57613' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_913591C246A3122B5446268539CEA6E0) == 0x000CF8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_913591C246A3122B5446268539CEA6E0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_B2F5923744BA9B943B360180ECBC494D) == 0x000D98, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_B2F5923744BA9B943B360180ECBC494D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_A878645F4E3B8E3C0A9E828275DF7B31) == 0x000E38, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_A878645F4E3B8E3C0A9E828275DF7B31' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_018E9733412FFFD34D2E28BBBD3FC990) == 0x000ED8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_018E9733412FFFD34D2E28BBBD3FC990' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_47D160CD4CEB9F688EC2318A6E7062C4) == 0x000F78, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_47D160CD4CEB9F688EC2318A6E7062C4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_5771BE6D4F8BA546F3FB44AB2CF4AC28) == 0x001018, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_5771BE6D4F8BA546F3FB44AB2CF4AC28' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_EAD9F3FC4A20B0304BC71B9500F79919) == 0x0010B8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_EAD9F3FC4A20B0304BC71B9500F79919' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_9783FE824947CD54B638138912068588) == 0x001158, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_9783FE824947CD54B638138912068588' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_2A117526458CACF8847E79B2771A76B3) == 0x0011F8, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_2A117526458CACF8847E79B2771A76B3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_SequencePlayer_FB169262424B92328CDF5F8B557A24D7) == 0x001298, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_SequencePlayer_FB169262424B92328CDF5F8B557A24D7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_BlendListByEnum_DDE0F8E64727A65F9DA21596D09546A3) == 0x001338, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_BlendListByEnum_DDE0F8E64727A65F9DA21596D09546A3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_StateResult_0824999E455FB2EA193F92B4E584A27E) == 0x001418, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_StateResult_0824999E455FB2EA193F92B4E584A27E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Spark_Hand_C, AnimGraphNode_StateMachine_C187B9624A9D9E3BB568F7B0FDB9ECE6) == 0x001458, "Member 'UAnimBP_Spark_Hand_C::AnimGraphNode_StateMachine_C187B9624A9D9E3BB568F7B0FDB9ECE6' has a wrong offset!");

}

