#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_SMG02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_SMG02.AnimBP_Wpn_SMG02_C
// 0x0CB8 (0x10C8 - 0x0410)
class UAnimBP_Wpn_SMG02_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2FD6F35B4439F8BCB37D61BF08846707; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65F9C7DE4F5563B09A4D52981CF7F48C; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4A773E94488FF5CF87F91F97F3ADBF6F; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4296DFC04A67C5C9A405DFB6DF25B5AA; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8DA1E9BA40AC0E5130F835B5F29FF270; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1C2364E745BCCD892E28F48099740C02; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DCE3E148484EF8434C761A9A078C5E81; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3BDAC0794766409945E911A087949A30; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_208EB125410B923193F6A49C2B15DB05; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D511EEDA4DA8B009FECA92B661171E07; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4B13D6E545034E240B92AB8C8BDC5CEF; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4E219DA44D7EC624BE7B298042121069; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BC8042FE435A86F78606DC80A23EC9C0; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_826FE9F842B1E054FC67AB8B86588BB5; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C7E4E3FA47D443542244068FEFFC801A; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_024C19464D8357286D7EA780A7C9780E; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AD02282E4AED5F0DCC8ADEA5E0AA726F; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E23FAF67440190E3F36CBEB8C24A6E34; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FAB569C546EB15A8BA7C549B52229215; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86EA70304F4FFAF4E04884B61832612C; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2109F6FB4D461D4041E3A18DC9A759A5; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35386BF04D211911724B32BDB5D209BF; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C3A3BB0A4DA6A70634D56F97683424F8; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DEF00B11452463CD38952492D57598F3; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_34E994324583654309787685819F4313; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27B0BF69492D13AD4E9F79BBD95602B3; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_456C68CC4288795801DDF79CC6ACAF19; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_465AA6C744B798586F195D9C7B71AE25; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A79A781445093863BE0BD396D6E10FDB; // 0x1028(0x00A0)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_SMG02_AnimGraphNode_TransitionResult_DCE3E148484EF8434C761A9A078C5E81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_SMG02_AnimGraphNode_TransitionResult_4A773E94488FF5CF87F91F97F3ADBF6F();
	void ExecuteUbergraph_AnimBP_Wpn_SMG02(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_SMG02_AnimGraphNode_TransitionResult_4296DFC04A67C5C9A405DFB6DF25B5AA();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_SMG02_AnimGraphNode_TransitionResult_65F9C7DE4F5563B09A4D52981CF7F48C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_SMG02_C">();
	}
	static class UAnimBP_Wpn_SMG02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_SMG02_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_SMG02_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_SMG02_C");
static_assert(sizeof(UAnimBP_Wpn_SMG02_C) == 0x0010C8, "Wrong size on UAnimBP_Wpn_SMG02_C");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_SMG02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_Root_2FD6F35B4439F8BCB37D61BF08846707) == 0x000418, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_Root_2FD6F35B4439F8BCB37D61BF08846707' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_65F9C7DE4F5563B09A4D52981CF7F48C) == 0x000458, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_65F9C7DE4F5563B09A4D52981CF7F48C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_4A773E94488FF5CF87F91F97F3ADBF6F) == 0x0004A0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_4A773E94488FF5CF87F91F97F3ADBF6F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_4296DFC04A67C5C9A405DFB6DF25B5AA) == 0x0004E8, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_4296DFC04A67C5C9A405DFB6DF25B5AA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_8DA1E9BA40AC0E5130F835B5F29FF270) == 0x000530, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_8DA1E9BA40AC0E5130F835B5F29FF270' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_1C2364E745BCCD892E28F48099740C02) == 0x000578, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_1C2364E745BCCD892E28F48099740C02' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_DCE3E148484EF8434C761A9A078C5E81) == 0x0005C0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_DCE3E148484EF8434C761A9A078C5E81' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_3BDAC0794766409945E911A087949A30) == 0x000608, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_3BDAC0794766409945E911A087949A30' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_208EB125410B923193F6A49C2B15DB05) == 0x000650, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_208EB125410B923193F6A49C2B15DB05' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_TransitionResult_D511EEDA4DA8B009FECA92B661171E07) == 0x000698, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_TransitionResult_D511EEDA4DA8B009FECA92B661171E07' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_4B13D6E545034E240B92AB8C8BDC5CEF) == 0x0006E0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_4B13D6E545034E240B92AB8C8BDC5CEF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_4E219DA44D7EC624BE7B298042121069) == 0x000780, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_4E219DA44D7EC624BE7B298042121069' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_BC8042FE435A86F78606DC80A23EC9C0) == 0x0007C0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_BC8042FE435A86F78606DC80A23EC9C0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_826FE9F842B1E054FC67AB8B86588BB5) == 0x000860, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_826FE9F842B1E054FC67AB8B86588BB5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_C7E4E3FA47D443542244068FEFFC801A) == 0x0008A0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_C7E4E3FA47D443542244068FEFFC801A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_024C19464D8357286D7EA780A7C9780E) == 0x000940, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_024C19464D8357286D7EA780A7C9780E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_AD02282E4AED5F0DCC8ADEA5E0AA726F) == 0x000980, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_AD02282E4AED5F0DCC8ADEA5E0AA726F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_E23FAF67440190E3F36CBEB8C24A6E34) == 0x000A20, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_E23FAF67440190E3F36CBEB8C24A6E34' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_FAB569C546EB15A8BA7C549B52229215) == 0x000A60, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_FAB569C546EB15A8BA7C549B52229215' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_86EA70304F4FFAF4E04884B61832612C) == 0x000B00, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_86EA70304F4FFAF4E04884B61832612C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_2109F6FB4D461D4041E3A18DC9A759A5) == 0x000B40, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_2109F6FB4D461D4041E3A18DC9A759A5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_35386BF04D211911724B32BDB5D209BF) == 0x000BE0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_35386BF04D211911724B32BDB5D209BF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_C3A3BB0A4DA6A70634D56F97683424F8) == 0x000C20, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_C3A3BB0A4DA6A70634D56F97683424F8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateResult_DEF00B11452463CD38952492D57598F3) == 0x000CC0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateResult_DEF00B11452463CD38952492D57598F3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_StateMachine_34E994324583654309787685819F4313) == 0x000D00, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_StateMachine_34E994324583654309787685819F4313' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_LayeredBoneBlend_27B0BF69492D13AD4E9F79BBD95602B3) == 0x000DE0, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_LayeredBoneBlend_27B0BF69492D13AD4E9F79BBD95602B3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_BlendListByBool_456C68CC4288795801DDF79CC6ACAF19) == 0x000EB8, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_BlendListByBool_456C68CC4288795801DDF79CC6ACAF19' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_465AA6C744B798586F195D9C7B71AE25) == 0x000F88, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_465AA6C744B798586F195D9C7B71AE25' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_SMG02_C, AnimGraphNode_SequencePlayer_A79A781445093863BE0BD396D6E10FDB) == 0x001028, "Member 'UAnimBP_Wpn_SMG02_C::AnimGraphNode_SequencePlayer_A79A781445093863BE0BD396D6E10FDB' has a wrong offset!");

}

