#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_RPG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_RPG.AnimBP_Wpn_RPG_C
// 0x0CB8 (0x10C8 - 0x0410)
class UAnimBP_Wpn_RPG_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_9584E5514EEC47B3B257E1B05112A9EE; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B5835C78443E209593E49B979705D31C; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4C613BD74CEFE3DE3482FF97963A2428; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FD25F0B9428002DDCAD7D9B48E43B756; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B59765A449A4D3A0E306CB92FF80081A; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8DCC573B4A1FEE19E728A696E2B630DB; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B7307F864AC27462A4A501B165F42CAE; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59ABC73748A31B0DC50DCE9CF29DA2C5; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76ADD95341787F92D0A14EBA327D7F65; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52AB54154A13A36A699479B16DBD7804; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0BB51AC44FAFF00716178199711FFDF3; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1CF59F23466E8F2DA37F1EB65C065CA4; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0887489842B26DD9463C6D962A36456A; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47CCCBA54B5A21F8835A98870EEE2BCA; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9641BA8F487C48C517DB5A9F3F11057C; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AEAF312B4E594D28B656BD8D84579A27; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9765F05444C849396883AA61FA6D533; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A37477FE4760E1FE9257D4AB5B79BF7E; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E22121BF4FEB29E91DDE59B9B1C3F455; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4A82FAE14CE82459536927979F3279AA; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D179A7F48D1E9105CEC06BEC86ED878; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_881553EF4A8765D28047C9B2939A17CD; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26A235064067FA8676C8F8A203E92425; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F76CBF8D40459B70299B8EA64B4C234D; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_28A5948946C37A39CD8E1F8A981A4A72; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_923AA32348C54D4A027244A10BE23936; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_96EF661449D255098C2AA68B9ECF9F80; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1B7E3FBA49B9D82EA3FE628974493E31; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4366E90E44F11E9366A8179D78A88CCE; // 0x1028(0x00A0)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_RPG_AnimGraphNode_TransitionResult_B7307F864AC27462A4A501B165F42CAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_RPG_AnimGraphNode_TransitionResult_4C613BD74CEFE3DE3482FF97963A2428();
	void ExecuteUbergraph_AnimBP_Wpn_RPG(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_RPG_AnimGraphNode_TransitionResult_FD25F0B9428002DDCAD7D9B48E43B756();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_RPG_AnimGraphNode_TransitionResult_B5835C78443E209593E49B979705D31C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_RPG_C">();
	}
	static class UAnimBP_Wpn_RPG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_RPG_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_RPG_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_RPG_C");
static_assert(sizeof(UAnimBP_Wpn_RPG_C) == 0x0010C8, "Wrong size on UAnimBP_Wpn_RPG_C");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_RPG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_Root_9584E5514EEC47B3B257E1B05112A9EE) == 0x000418, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_Root_9584E5514EEC47B3B257E1B05112A9EE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_B5835C78443E209593E49B979705D31C) == 0x000458, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_B5835C78443E209593E49B979705D31C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_4C613BD74CEFE3DE3482FF97963A2428) == 0x0004A0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_4C613BD74CEFE3DE3482FF97963A2428' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_FD25F0B9428002DDCAD7D9B48E43B756) == 0x0004E8, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_FD25F0B9428002DDCAD7D9B48E43B756' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_B59765A449A4D3A0E306CB92FF80081A) == 0x000530, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_B59765A449A4D3A0E306CB92FF80081A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_8DCC573B4A1FEE19E728A696E2B630DB) == 0x000578, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_8DCC573B4A1FEE19E728A696E2B630DB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_B7307F864AC27462A4A501B165F42CAE) == 0x0005C0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_B7307F864AC27462A4A501B165F42CAE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_59ABC73748A31B0DC50DCE9CF29DA2C5) == 0x000608, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_59ABC73748A31B0DC50DCE9CF29DA2C5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_76ADD95341787F92D0A14EBA327D7F65) == 0x000650, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_76ADD95341787F92D0A14EBA327D7F65' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_TransitionResult_52AB54154A13A36A699479B16DBD7804) == 0x000698, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_TransitionResult_52AB54154A13A36A699479B16DBD7804' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_0BB51AC44FAFF00716178199711FFDF3) == 0x0006E0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_0BB51AC44FAFF00716178199711FFDF3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_1CF59F23466E8F2DA37F1EB65C065CA4) == 0x000780, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_1CF59F23466E8F2DA37F1EB65C065CA4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_0887489842B26DD9463C6D962A36456A) == 0x0007C0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_0887489842B26DD9463C6D962A36456A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_47CCCBA54B5A21F8835A98870EEE2BCA) == 0x000860, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_47CCCBA54B5A21F8835A98870EEE2BCA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_9641BA8F487C48C517DB5A9F3F11057C) == 0x0008A0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_9641BA8F487C48C517DB5A9F3F11057C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_AEAF312B4E594D28B656BD8D84579A27) == 0x000940, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_AEAF312B4E594D28B656BD8D84579A27' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_F9765F05444C849396883AA61FA6D533) == 0x000980, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_F9765F05444C849396883AA61FA6D533' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_A37477FE4760E1FE9257D4AB5B79BF7E) == 0x000A20, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_A37477FE4760E1FE9257D4AB5B79BF7E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_E22121BF4FEB29E91DDE59B9B1C3F455) == 0x000A60, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_E22121BF4FEB29E91DDE59B9B1C3F455' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_4A82FAE14CE82459536927979F3279AA) == 0x000B00, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_4A82FAE14CE82459536927979F3279AA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_8D179A7F48D1E9105CEC06BEC86ED878) == 0x000B40, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_8D179A7F48D1E9105CEC06BEC86ED878' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_881553EF4A8765D28047C9B2939A17CD) == 0x000BE0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_881553EF4A8765D28047C9B2939A17CD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_26A235064067FA8676C8F8A203E92425) == 0x000C20, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_26A235064067FA8676C8F8A203E92425' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateResult_F76CBF8D40459B70299B8EA64B4C234D) == 0x000CC0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateResult_F76CBF8D40459B70299B8EA64B4C234D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_StateMachine_28A5948946C37A39CD8E1F8A981A4A72) == 0x000D00, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_StateMachine_28A5948946C37A39CD8E1F8A981A4A72' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_LayeredBoneBlend_923AA32348C54D4A027244A10BE23936) == 0x000DE0, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_LayeredBoneBlend_923AA32348C54D4A027244A10BE23936' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_BlendListByBool_96EF661449D255098C2AA68B9ECF9F80) == 0x000EB8, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_BlendListByBool_96EF661449D255098C2AA68B9ECF9F80' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_1B7E3FBA49B9D82EA3FE628974493E31) == 0x000F88, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_1B7E3FBA49B9D82EA3FE628974493E31' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_RPG_C, AnimGraphNode_SequencePlayer_4366E90E44F11E9366A8179D78A88CCE) == 0x001028, "Member 'UAnimBP_Wpn_RPG_C::AnimGraphNode_SequencePlayer_4366E90E44F11E9366A8179D78A88CCE' has a wrong offset!");

}

