#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_AWM02

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_Wpn_AWM02.AnimBP_Wpn_AWM02_C.ExecuteUbergraph_AnimBP_Wpn_AWM02
// 0x0068 (0x0068 - 0x0000)
struct AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWpnBase_C*                           K2Node_DynamicCast_AsBPWpn_Base;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWpnBase_C*                           K2Node_DynamicCast_AsBPWpn_Base1;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02) == 0x000008, "Wrong alignment on AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02");
static_assert(sizeof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02) == 0x000068, "Wrong size on AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, EntryPoint) == 0x000000, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000004, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1) == 0x000008, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000D, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000E, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Not_PreBool_ReturnValue) == 0x00000F, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000011, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Not_PreBool_ReturnValue1) == 0x000012, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2) == 0x000014, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000018, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000019, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_BooleanAND_ReturnValue1) == 0x00001A, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3) == 0x00001C, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000020, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_BooleanAND_ReturnValue2) == 0x000028, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetOwningActor_ReturnValue) == 0x000030, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, K2Node_DynamicCast_AsBPWpn_Base) == 0x000038, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::K2Node_DynamicCast_AsBPWpn_Base' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_BooleanOR_ReturnValue) == 0x000041, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_BooleanAND_ReturnValue3) == 0x000048, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_GetOwningActor_ReturnValue1) == 0x000050, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_GetOwningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, K2Node_DynamicCast_AsBPWpn_Base1) == 0x000058, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::K2Node_DynamicCast_AsBPWpn_Base1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, K2Node_DynamicCast_bSuccess1) == 0x000060, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000061, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000064, "Member 'AnimBP_Wpn_AWM02_C_ExecuteUbergraph_AnimBP_Wpn_AWM02::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");

// Function AnimBP_Wpn_AWM02.AnimBP_Wpn_AWM02_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_Wpn_AWM02_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

