#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_TPP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_TPP.AnimBP_TPP_C
// 0x0380 (0x06D8 - 0x0358)
class UAnimBP_TPP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_99A265354F1D4C15B6303DA3093E4D67; // 0x0368(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_D017769F49DD05779CF62487D5E61A1A; // 0x03A8(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A2888B014E29850A3BD7F89BA4B026D9; // 0x04D0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7DB0FF0A429B5188943A0CB420448715; // 0x05A0(0x0128)()
	float                                         WalkRight;                                         // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkForward;                                       // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouch;                                          // 0x06D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_TPP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_TPP_C">();
	}
	static class UAnimBP_TPP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_TPP_C>();
	}
};
static_assert(alignof(UAnimBP_TPP_C) == 0x000008, "Wrong alignment on UAnimBP_TPP_C");
static_assert(sizeof(UAnimBP_TPP_C) == 0x0006D8, "Wrong size on UAnimBP_TPP_C");
static_assert(offsetof(UAnimBP_TPP_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_TPP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, AnimGraphNode_Root_99A265354F1D4C15B6303DA3093E4D67) == 0x000368, "Member 'UAnimBP_TPP_C::AnimGraphNode_Root_99A265354F1D4C15B6303DA3093E4D67' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, AnimGraphNode_BlendSpacePlayer_D017769F49DD05779CF62487D5E61A1A) == 0x0003A8, "Member 'UAnimBP_TPP_C::AnimGraphNode_BlendSpacePlayer_D017769F49DD05779CF62487D5E61A1A' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, AnimGraphNode_BlendListByBool_A2888B014E29850A3BD7F89BA4B026D9) == 0x0004D0, "Member 'UAnimBP_TPP_C::AnimGraphNode_BlendListByBool_A2888B014E29850A3BD7F89BA4B026D9' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, AnimGraphNode_BlendSpacePlayer_7DB0FF0A429B5188943A0CB420448715) == 0x0005A0, "Member 'UAnimBP_TPP_C::AnimGraphNode_BlendSpacePlayer_7DB0FF0A429B5188943A0CB420448715' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, WalkRight) == 0x0006C8, "Member 'UAnimBP_TPP_C::WalkRight' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, WalkForward) == 0x0006CC, "Member 'UAnimBP_TPP_C::WalkForward' has a wrong offset!");
static_assert(offsetof(UAnimBP_TPP_C, IsCrouch) == 0x0006D0, "Member 'UAnimBP_TPP_C::IsCrouch' has a wrong offset!");

}

