#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lv2SpecialNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Lv2SpecialNPC.AnimBP_Lv2SpecialNPC_C
// 0x0AC8 (0x0E20 - 0x0358)
class UAnimBP_Lv2SpecialNPC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_437E4AB740E689BA3CF094905794BA71; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7BF7EA8D461E787B5337BCAD734E4055; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8D320892492B3FD0FF0B419E0DEC9CAC; // 0x03F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DC2971164C5621D0899ABC9D799A2BC5; // 0x0438(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D17FCAF440BCE60F9516F96DBB4DDF5; // 0x04D8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7E7C1E124550BAEB7E39F6A9B6DD6E71; // 0x0578(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B4F632EB47422E2415C8EA9D1EEA8B46; // 0x0658(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AE004D564E2B25D7A22BC3AE0955C78F; // 0x06F8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34C2ED9C487FBD70E29B78B3F855DDD3; // 0x0738(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2D009FD6485217254977F4BBFE9F421E; // 0x07D8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6F223A594FBDE9E58C75A5BC9520CD9C; // 0x0878(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A6BEA2AD4BD6B01134377E8649EAF6E8; // 0x0958(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FDF44B004DCD4B0EB73DFC99991D82AA; // 0x09F8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1C7F12544B1748955ADE0E96ED3201A0; // 0x0A38(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31F53BF44684F0E49BA7EB9450AF3A9D; // 0x0AD8(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_A40679C34EE8F2CCBC159FB7594815B9; // 0x0B78(0x00E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7AB220BE4FB03878A2B7B1B440D55708; // 0x0C58(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E9468D3A4DB54B7D5EEAF0B8BE5AECD6; // 0x0CF8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_61A1E3754B4841475A43B99EDC719892; // 0x0D38(0x00E0)()
	bool                                          Hostage;                                           // 0x0E18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E19[0x3];                                      // 0x0E19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0E1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv2SpecialNPC_AnimGraphNode_BlendListByEnum_A40679C34EE8F2CCBC159FB7594815B9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv2SpecialNPC_AnimGraphNode_BlendListByEnum_6F223A594FBDE9E58C75A5BC9520CD9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv2SpecialNPC_AnimGraphNode_BlendListByEnum_7E7C1E124550BAEB7E39F6A9B6DD6E71();
	void ExecuteUbergraph_AnimBP_Lv2SpecialNPC(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv2SpecialNPC_AnimGraphNode_TransitionResult_7BF7EA8D461E787B5337BCAD734E4055();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Lv2SpecialNPC_C">();
	}
	static class UAnimBP_Lv2SpecialNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Lv2SpecialNPC_C>();
	}
};
static_assert(alignof(UAnimBP_Lv2SpecialNPC_C) == 0x000008, "Wrong alignment on UAnimBP_Lv2SpecialNPC_C");
static_assert(sizeof(UAnimBP_Lv2SpecialNPC_C) == 0x000E20, "Wrong size on UAnimBP_Lv2SpecialNPC_C");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_Lv2SpecialNPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_Root_437E4AB740E689BA3CF094905794BA71) == 0x000368, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_Root_437E4AB740E689BA3CF094905794BA71' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_TransitionResult_7BF7EA8D461E787B5337BCAD734E4055) == 0x0003A8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_TransitionResult_7BF7EA8D461E787B5337BCAD734E4055' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_TransitionResult_8D320892492B3FD0FF0B419E0DEC9CAC) == 0x0003F0, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_TransitionResult_8D320892492B3FD0FF0B419E0DEC9CAC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_DC2971164C5621D0899ABC9D799A2BC5) == 0x000438, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_DC2971164C5621D0899ABC9D799A2BC5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_1D17FCAF440BCE60F9516F96DBB4DDF5) == 0x0004D8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_1D17FCAF440BCE60F9516F96DBB4DDF5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_BlendListByEnum_7E7C1E124550BAEB7E39F6A9B6DD6E71) == 0x000578, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_BlendListByEnum_7E7C1E124550BAEB7E39F6A9B6DD6E71' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_B4F632EB47422E2415C8EA9D1EEA8B46) == 0x000658, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_B4F632EB47422E2415C8EA9D1EEA8B46' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_StateResult_AE004D564E2B25D7A22BC3AE0955C78F) == 0x0006F8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_StateResult_AE004D564E2B25D7A22BC3AE0955C78F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_34C2ED9C487FBD70E29B78B3F855DDD3) == 0x000738, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_34C2ED9C487FBD70E29B78B3F855DDD3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_2D009FD6485217254977F4BBFE9F421E) == 0x0007D8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_2D009FD6485217254977F4BBFE9F421E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_BlendListByEnum_6F223A594FBDE9E58C75A5BC9520CD9C) == 0x000878, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_BlendListByEnum_6F223A594FBDE9E58C75A5BC9520CD9C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_A6BEA2AD4BD6B01134377E8649EAF6E8) == 0x000958, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_A6BEA2AD4BD6B01134377E8649EAF6E8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_StateResult_FDF44B004DCD4B0EB73DFC99991D82AA) == 0x0009F8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_StateResult_FDF44B004DCD4B0EB73DFC99991D82AA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_1C7F12544B1748955ADE0E96ED3201A0) == 0x000A38, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_1C7F12544B1748955ADE0E96ED3201A0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_31F53BF44684F0E49BA7EB9450AF3A9D) == 0x000AD8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_31F53BF44684F0E49BA7EB9450AF3A9D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_BlendListByEnum_A40679C34EE8F2CCBC159FB7594815B9) == 0x000B78, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_BlendListByEnum_A40679C34EE8F2CCBC159FB7594815B9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_SequencePlayer_7AB220BE4FB03878A2B7B1B440D55708) == 0x000C58, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_SequencePlayer_7AB220BE4FB03878A2B7B1B440D55708' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_StateResult_E9468D3A4DB54B7D5EEAF0B8BE5AECD6) == 0x000CF8, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_StateResult_E9468D3A4DB54B7D5EEAF0B8BE5AECD6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, AnimGraphNode_StateMachine_61A1E3754B4841475A43B99EDC719892) == 0x000D38, "Member 'UAnimBP_Lv2SpecialNPC_C::AnimGraphNode_StateMachine_61A1E3754B4841475A43B99EDC719892' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, Hostage) == 0x000E18, "Member 'UAnimBP_Lv2SpecialNPC_C::Hostage' has a wrong offset!");
static_assert(offsetof(UAnimBP_Lv2SpecialNPC_C, Index_0) == 0x000E1C, "Member 'UAnimBP_Lv2SpecialNPC_C::Index_0' has a wrong offset!");

}

