#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_EnemySentry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_EnemySentry.AnimBP_EnemySentry_C.ExecuteUbergraph_AnimBP_EnemySentry
// 0x0118 (0x0118 - 0x0000)
struct AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BehaviorComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BehaviorComponent_C*>        CallFunc_GetComponentsByClass_ReturnValue;         // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_BehaviorComponent_C*                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_BehaviorType                             CallFunc_GetCurrentBehaviorType_CurrentBehaviorType; // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentAttackTarget_TargetRef;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue1;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_EnemySentry_C*                  K2Node_DynamicCast_AsBP_NPC_Enemy_Sentry;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry) == 0x000008, "Wrong alignment on AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry");
static_assert(sizeof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry) == 0x000118, "Wrong size on AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, EntryPoint) == 0x000000, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_TryGetPawnOwner_ReturnValue1) == 0x000010, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_TryGetPawnOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetVelocity_ReturnValue) == 0x000020, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_VSize_ReturnValue) == 0x00002C, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000031, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000040, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetMovementComponent_ReturnValue) == 0x000050, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_CalculateDirection_ReturnValue) == 0x000058, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsCrouching_ReturnValue) == 0x00005C, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsFalling_ReturnValue) == 0x00005D, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsValid_ReturnValue1) == 0x00005E, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetComponentsByClass_ReturnValue) == 0x000060, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Array_Get_Item) == 0x000070, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Greater_IntInt_ReturnValue) == 0x00007C, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetCurrentBehaviorType_CurrentBehaviorType) == 0x00007D, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetCurrentBehaviorType_CurrentBehaviorType' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetCurrentAttackTarget_TargetRef) == 0x000080, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetCurrentAttackTarget_TargetRef' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000088, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsValid_ReturnValue2) == 0x000094, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000098, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_BreakVector_X) == 0x0000A4, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_BreakVector_Y) == 0x0000A8, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_BreakVector_Z) == 0x0000AC, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsValid_ReturnValue3) == 0x0000B0, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_MakeVector_ReturnValue) == 0x0000B4, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_SelectVector_ReturnValue) == 0x0000C0, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_CalculateDirection_ReturnValue1) == 0x0000CC, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_CalculateDirection_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D0, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, K2Node_Event_DeltaTimeX) == 0x0000D4, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Abs_ReturnValue) == 0x0000D8, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0000DC, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_BooleanAND_ReturnValue) == 0x0000DD, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, Temp_bool_Variable) == 0x0000DE, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000DF, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000E0, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000E4, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000E8, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_Lerp_ReturnValue) == 0x0000EC, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, K2Node_Select_Default) == 0x0000F0, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x0000F8, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, CallFunc_IsValid_ReturnValue4) == 0x000100, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, K2Node_DynamicCast_AsBP_NPC_Enemy_Sentry) == 0x000108, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::K2Node_DynamicCast_AsBP_NPC_Enemy_Sentry' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'AnimBP_EnemySentry_C_ExecuteUbergraph_AnimBP_EnemySentry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AnimBP_EnemySentry.AnimBP_EnemySentry_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_EnemySentry_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_EnemySentry_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_EnemySentry_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_EnemySentry_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_EnemySentry_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_EnemySentry_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_EnemySentry_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

