#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_AKM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_AKM.AnimBP_Wpn_AKM_C
// 0x0CB8 (0x10C8 - 0x0410)
class UAnimBP_Wpn_AKM_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4B26F471444B68B43C2BADAAC68F33DB; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8B1039154583A0738F33DEB5187B6585; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1EF974348124888D35068A4760EF6C5; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40ED1B1945459E80D8B3788CA0EDF015; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DB74CA6141C4DC7A5AD88491842BE445; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0A513AFB4A5BDF263AEE77A1DD8B8604; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F5A41A4D48F5DC507A4B1B86AC25DC50; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_888765EE4BEDC4BE1027DA9EC9153CF4; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6B720D82413FC2D611918FBABDB0C106; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BE72DAB747DAED9242B4AAA5C9D4BD30; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E181C4A148B7F2D6BD730983B1E6ACC8; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E7B5F26D4C9D8BFF425DECA8C90BA722; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E3D7B60E4AE31215482B6EBE12E46291; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_687E3E734041C799261C93916D7CC53C; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1024D8314118EF6DB1FB4FBC6111D7C5; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1DAAB8564B8C61AD24AA26A097988DE0; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F22589574155D3EF654175A6B725A3E7; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3BB3C101479984F50247D19FF31C0FA7; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_987C316D4A051727F13A7C8CF1DAB3AD; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0775BD4E40F56944FEBD8588B83ACFB8; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0ECC706E43B5B9C1DD1B67A30E83682B; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3C1FD797479968915AF6EF8284B5721C; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58E57F734DBDAA78DE4C3D94B31C209D; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88F9DC1D4F224D9A6DBCD884F748F828; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6281DCF8471F0B6AA4EAA69393D3EFD2; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_201360E74AA6447E5829B5AC7E8C919E; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B388D25446E5DC0C9B46609E856BC8A2; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BF08A5294B55D6D4A464D0B82382666C; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_817ACA024644440978021EB010594BA6; // 0x1028(0x00A0)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_AKM_AnimGraphNode_TransitionResult_F5A41A4D48F5DC507A4B1B86AC25DC50();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_AKM_AnimGraphNode_TransitionResult_B1EF974348124888D35068A4760EF6C5();
	void ExecuteUbergraph_AnimBP_Wpn_AKM(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_AKM_AnimGraphNode_TransitionResult_40ED1B1945459E80D8B3788CA0EDF015();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_AKM_AnimGraphNode_TransitionResult_8B1039154583A0738F33DEB5187B6585();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_AKM_C">();
	}
	static class UAnimBP_Wpn_AKM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_AKM_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_AKM_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_AKM_C");
static_assert(sizeof(UAnimBP_Wpn_AKM_C) == 0x0010C8, "Wrong size on UAnimBP_Wpn_AKM_C");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_AKM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_Root_4B26F471444B68B43C2BADAAC68F33DB) == 0x000418, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_Root_4B26F471444B68B43C2BADAAC68F33DB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_8B1039154583A0738F33DEB5187B6585) == 0x000458, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_8B1039154583A0738F33DEB5187B6585' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_B1EF974348124888D35068A4760EF6C5) == 0x0004A0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_B1EF974348124888D35068A4760EF6C5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_40ED1B1945459E80D8B3788CA0EDF015) == 0x0004E8, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_40ED1B1945459E80D8B3788CA0EDF015' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_DB74CA6141C4DC7A5AD88491842BE445) == 0x000530, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_DB74CA6141C4DC7A5AD88491842BE445' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_0A513AFB4A5BDF263AEE77A1DD8B8604) == 0x000578, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_0A513AFB4A5BDF263AEE77A1DD8B8604' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_F5A41A4D48F5DC507A4B1B86AC25DC50) == 0x0005C0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_F5A41A4D48F5DC507A4B1B86AC25DC50' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_888765EE4BEDC4BE1027DA9EC9153CF4) == 0x000608, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_888765EE4BEDC4BE1027DA9EC9153CF4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_6B720D82413FC2D611918FBABDB0C106) == 0x000650, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_6B720D82413FC2D611918FBABDB0C106' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_TransitionResult_BE72DAB747DAED9242B4AAA5C9D4BD30) == 0x000698, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_TransitionResult_BE72DAB747DAED9242B4AAA5C9D4BD30' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_E181C4A148B7F2D6BD730983B1E6ACC8) == 0x0006E0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_E181C4A148B7F2D6BD730983B1E6ACC8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_E7B5F26D4C9D8BFF425DECA8C90BA722) == 0x000780, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_E7B5F26D4C9D8BFF425DECA8C90BA722' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_E3D7B60E4AE31215482B6EBE12E46291) == 0x0007C0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_E3D7B60E4AE31215482B6EBE12E46291' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_687E3E734041C799261C93916D7CC53C) == 0x000860, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_687E3E734041C799261C93916D7CC53C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_1024D8314118EF6DB1FB4FBC6111D7C5) == 0x0008A0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_1024D8314118EF6DB1FB4FBC6111D7C5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_1DAAB8564B8C61AD24AA26A097988DE0) == 0x000940, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_1DAAB8564B8C61AD24AA26A097988DE0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_F22589574155D3EF654175A6B725A3E7) == 0x000980, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_F22589574155D3EF654175A6B725A3E7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_3BB3C101479984F50247D19FF31C0FA7) == 0x000A20, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_3BB3C101479984F50247D19FF31C0FA7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_987C316D4A051727F13A7C8CF1DAB3AD) == 0x000A60, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_987C316D4A051727F13A7C8CF1DAB3AD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_0775BD4E40F56944FEBD8588B83ACFB8) == 0x000B00, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_0775BD4E40F56944FEBD8588B83ACFB8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_0ECC706E43B5B9C1DD1B67A30E83682B) == 0x000B40, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_0ECC706E43B5B9C1DD1B67A30E83682B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_3C1FD797479968915AF6EF8284B5721C) == 0x000BE0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_3C1FD797479968915AF6EF8284B5721C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_58E57F734DBDAA78DE4C3D94B31C209D) == 0x000C20, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_58E57F734DBDAA78DE4C3D94B31C209D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateResult_88F9DC1D4F224D9A6DBCD884F748F828) == 0x000CC0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateResult_88F9DC1D4F224D9A6DBCD884F748F828' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_StateMachine_6281DCF8471F0B6AA4EAA69393D3EFD2) == 0x000D00, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_StateMachine_6281DCF8471F0B6AA4EAA69393D3EFD2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_LayeredBoneBlend_201360E74AA6447E5829B5AC7E8C919E) == 0x000DE0, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_LayeredBoneBlend_201360E74AA6447E5829B5AC7E8C919E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_BlendListByBool_B388D25446E5DC0C9B46609E856BC8A2) == 0x000EB8, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_BlendListByBool_B388D25446E5DC0C9B46609E856BC8A2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_BF08A5294B55D6D4A464D0B82382666C) == 0x000F88, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_BF08A5294B55D6D4A464D0B82382666C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_AKM_C, AnimGraphNode_SequencePlayer_817ACA024644440978021EB010594BA6) == 0x001028, "Member 'UAnimBP_Wpn_AKM_C::AnimGraphNode_SequencePlayer_817ACA024644440978021EB010594BA6' has a wrong offset!");

}

