#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_Revolver_lv4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_Revolver_lv4.AnimBP_Wpn_Revolver_lv4_C
// 0x1540 (0x1950 - 0x0410)
class UAnimBP_Wpn_Revolver_lv4_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9C8DB15F492514322A085B89AE61DF1B; // 0x0418(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22E1DE714D29FEBA1B610782CB71B5AC; // 0x0460(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_359D2DE745D91B8288A4B2939FDA370D; // 0x04A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9D356E1E4B18C33638183291497CF0C7; // 0x04F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_00C5E0114EABCEDFE65017947626C422; // 0x0538(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A3E7776641F662C40E0F68BD39A46071; // 0x0580(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87F393044C6463208EC7E29AC7004C7B; // 0x05C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FC581F9440F21260A3D03A8122839D37; // 0x0610(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1C97E548470130181B8860920D81E111; // 0x0658(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7A65C9AC4AFE5528E737918FB5045293; // 0x06A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FD0BACF643B5DA211E983C895EF68CEF; // 0x0740(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_94D6F29E46E10C2822703FBE0FB5CABA; // 0x0780(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0E246B2243BAC18C221AAE87D5B2F822; // 0x0820(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CD55079340BDB9AE418E1F95A6D0781F; // 0x0860(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3B98CFCF402AA3D4432F50969BEDC697; // 0x0900(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EDA833DA46354CD206807EBC8EDA72AB; // 0x0940(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B313C8D14E6C7036E818ACBE75ED6648; // 0x09E0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6C450BD3437C5644CEF9D4AC0F997FC6; // 0x0A20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_933F027B4DCC3366F6AC3EBD9ED594C3; // 0x0AC0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FC691DB1431E6A914551D4923883C272; // 0x0B00(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0E1804BF4F0F6F117605F5923BC0E068; // 0x0BA0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B1862B74439BCDBAF7A49E808B07122A; // 0x0BE0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AC6E965D477179C933D31FB302F7F31D; // 0x0C80(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_37E96B664F3A4C78D6C01DBB9BDAD4C2; // 0x0CC0(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_634AF3D84954B1DE63885E91B97AB02D; // 0x0DA0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_CE950E1F41BB4E48E675488C1924624A; // 0x0E78(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9CCA2EA24FACD8F685443B94978D73D2; // 0x0F48(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4A36A1FE43968DADB65CFCB6F350CBA2; // 0x0FE8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A70A7B294EF0C9549479BBBEFC0F6A2E; // 0x1088(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F98BFF254349E94D679F22BBC332FA53; // 0x1158(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_946C06C440D2B305FEDD57AADBA1625D; // 0x1230(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E8841E98478EDA8BD2A3198FB5C32852; // 0x1278(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7FF07F2D4E6996732DD748AFC598A082; // 0x12C0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EAC8773E41116DD48A1752B0CDFD7BD9; // 0x1390(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F5EDDD3E46EAF912564F0E8E6D857507; // 0x1430(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_578791554F6B607BA5129E9DEACEB521; // 0x1508(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_748AC71047BA0C5B1E44858322F1F49A; // 0x1550(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_FB83627444202771256DABAFC28994B7; // 0x1598(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2A2D543844D0424492936C983E9B71CF; // 0x1778(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D74ABDAD4708D4CD777D27BF011C6D9F; // 0x1848(0x0040)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F171B14F476BB01839AEF7A35840F55D; // 0x1888(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F97EABD64B616DC2429C55B6EA9F1CD6; // 0x18C8(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7A38874440EF53BA1B6C729689712BEE; // 0x1908(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_TransitionResult_A3E7776641F662C40E0F68BD39A46071();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_RotationOffsetBlendSpace_FB83627444202771256DABAFC28994B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_BlendListByBool_A70A7B294EF0C9549479BBBEFC0F6A2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_TransitionResult_9D356E1E4B18C33638183291497CF0C7();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_TransitionResult_359D2DE745D91B8288A4B2939FDA370D();
	void ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Revolver_lv4_AnimGraphNode_TransitionResult_9C8DB15F492514322A085B89AE61DF1B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_Revolver_lv4_C">();
	}
	static class UAnimBP_Wpn_Revolver_lv4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_Revolver_lv4_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_Revolver_lv4_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_Revolver_lv4_C");
static_assert(sizeof(UAnimBP_Wpn_Revolver_lv4_C) == 0x001950, "Wrong size on UAnimBP_Wpn_Revolver_lv4_C");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_Revolver_lv4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_9C8DB15F492514322A085B89AE61DF1B) == 0x000418, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_9C8DB15F492514322A085B89AE61DF1B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_22E1DE714D29FEBA1B610782CB71B5AC) == 0x000460, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_22E1DE714D29FEBA1B610782CB71B5AC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_359D2DE745D91B8288A4B2939FDA370D) == 0x0004A8, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_359D2DE745D91B8288A4B2939FDA370D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_9D356E1E4B18C33638183291497CF0C7) == 0x0004F0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_9D356E1E4B18C33638183291497CF0C7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_00C5E0114EABCEDFE65017947626C422) == 0x000538, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_00C5E0114EABCEDFE65017947626C422' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_A3E7776641F662C40E0F68BD39A46071) == 0x000580, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_A3E7776641F662C40E0F68BD39A46071' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_87F393044C6463208EC7E29AC7004C7B) == 0x0005C8, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_87F393044C6463208EC7E29AC7004C7B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_FC581F9440F21260A3D03A8122839D37) == 0x000610, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_FC581F9440F21260A3D03A8122839D37' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_TransitionResult_1C97E548470130181B8860920D81E111) == 0x000658, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_TransitionResult_1C97E548470130181B8860920D81E111' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_7A65C9AC4AFE5528E737918FB5045293) == 0x0006A0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_7A65C9AC4AFE5528E737918FB5045293' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_FD0BACF643B5DA211E983C895EF68CEF) == 0x000740, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_FD0BACF643B5DA211E983C895EF68CEF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_94D6F29E46E10C2822703FBE0FB5CABA) == 0x000780, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_94D6F29E46E10C2822703FBE0FB5CABA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_0E246B2243BAC18C221AAE87D5B2F822) == 0x000820, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_0E246B2243BAC18C221AAE87D5B2F822' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_CD55079340BDB9AE418E1F95A6D0781F) == 0x000860, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_CD55079340BDB9AE418E1F95A6D0781F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_3B98CFCF402AA3D4432F50969BEDC697) == 0x000900, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_3B98CFCF402AA3D4432F50969BEDC697' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_EDA833DA46354CD206807EBC8EDA72AB) == 0x000940, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_EDA833DA46354CD206807EBC8EDA72AB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_B313C8D14E6C7036E818ACBE75ED6648) == 0x0009E0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_B313C8D14E6C7036E818ACBE75ED6648' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_6C450BD3437C5644CEF9D4AC0F997FC6) == 0x000A20, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_6C450BD3437C5644CEF9D4AC0F997FC6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_933F027B4DCC3366F6AC3EBD9ED594C3) == 0x000AC0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_933F027B4DCC3366F6AC3EBD9ED594C3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_FC691DB1431E6A914551D4923883C272) == 0x000B00, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_FC691DB1431E6A914551D4923883C272' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_0E1804BF4F0F6F117605F5923BC0E068) == 0x000BA0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_0E1804BF4F0F6F117605F5923BC0E068' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_B1862B74439BCDBAF7A49E808B07122A) == 0x000BE0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_B1862B74439BCDBAF7A49E808B07122A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateResult_AC6E965D477179C933D31FB302F7F31D) == 0x000C80, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateResult_AC6E965D477179C933D31FB302F7F31D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_StateMachine_37E96B664F3A4C78D6C01DBB9BDAD4C2) == 0x000CC0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_StateMachine_37E96B664F3A4C78D6C01DBB9BDAD4C2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_LayeredBoneBlend_634AF3D84954B1DE63885E91B97AB02D) == 0x000DA0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_LayeredBoneBlend_634AF3D84954B1DE63885E91B97AB02D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_BlendListByBool_CE950E1F41BB4E48E675488C1924624A) == 0x000E78, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_BlendListByBool_CE950E1F41BB4E48E675488C1924624A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_9CCA2EA24FACD8F685443B94978D73D2) == 0x000F48, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_9CCA2EA24FACD8F685443B94978D73D2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_4A36A1FE43968DADB65CFCB6F350CBA2) == 0x000FE8, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_4A36A1FE43968DADB65CFCB6F350CBA2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_BlendListByBool_A70A7B294EF0C9549479BBBEFC0F6A2E) == 0x001088, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_BlendListByBool_A70A7B294EF0C9549479BBBEFC0F6A2E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SaveCachedPose_F98BFF254349E94D679F22BBC332FA53) == 0x001158, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SaveCachedPose_F98BFF254349E94D679F22BBC332FA53' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_UseCachedPose_946C06C440D2B305FEDD57AADBA1625D) == 0x001230, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_UseCachedPose_946C06C440D2B305FEDD57AADBA1625D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_UseCachedPose_E8841E98478EDA8BD2A3198FB5C32852) == 0x001278, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_UseCachedPose_E8841E98478EDA8BD2A3198FB5C32852' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_BlendListByBool_7FF07F2D4E6996732DD748AFC598A082) == 0x0012C0, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_BlendListByBool_7FF07F2D4E6996732DD748AFC598A082' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SequencePlayer_EAC8773E41116DD48A1752B0CDFD7BD9) == 0x001390, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SequencePlayer_EAC8773E41116DD48A1752B0CDFD7BD9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_SaveCachedPose_F5EDDD3E46EAF912564F0E8E6D857507) == 0x001430, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_SaveCachedPose_F5EDDD3E46EAF912564F0E8E6D857507' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_UseCachedPose_578791554F6B607BA5129E9DEACEB521) == 0x001508, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_UseCachedPose_578791554F6B607BA5129E9DEACEB521' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_UseCachedPose_748AC71047BA0C5B1E44858322F1F49A) == 0x001550, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_UseCachedPose_748AC71047BA0C5B1E44858322F1F49A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_RotationOffsetBlendSpace_FB83627444202771256DABAFC28994B7) == 0x001598, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_RotationOffsetBlendSpace_FB83627444202771256DABAFC28994B7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_BlendListByBool_2A2D543844D0424492936C983E9B71CF) == 0x001778, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_BlendListByBool_2A2D543844D0424492936C983E9B71CF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_Root_D74ABDAD4708D4CD777D27BF011C6D9F) == 0x001848, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_Root_D74ABDAD4708D4CD777D27BF011C6D9F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_LocalToComponentSpace_F171B14F476BB01839AEF7A35840F55D) == 0x001888, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_LocalToComponentSpace_F171B14F476BB01839AEF7A35840F55D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_ComponentToLocalSpace_F97EABD64B616DC2429C55B6EA9F1CD6) == 0x0018C8, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_ComponentToLocalSpace_F97EABD64B616DC2429C55B6EA9F1CD6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Revolver_lv4_C, AnimGraphNode_UseCachedPose_7A38874440EF53BA1B6C729689712BEE) == 0x001908, "Member 'UAnimBP_Wpn_Revolver_lv4_C::AnimGraphNode_UseCachedPose_7A38874440EF53BA1B6C729689712BEE' has a wrong offset!");

}

