#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_RPG

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_Wpn_RPG.AnimBP_Wpn_RPG_C.ExecuteUbergraph_AnimBP_Wpn_RPG
// 0x0020 (0x0020 - 0x0000)
struct AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG) == 0x000004, "Wrong alignment on AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG");
static_assert(sizeof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG) == 0x000020, "Wrong size on AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, EntryPoint) == 0x000000, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000004, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000009, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1) == 0x00000C, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000010, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000011, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000013, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_BooleanAND_ReturnValue1) == 0x000014, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000018, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_Less_FloatFloat_ReturnValue) == 0x00001C, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_BooleanOR_ReturnValue) == 0x00001E, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG, CallFunc_BooleanAND_ReturnValue2) == 0x00001F, "Member 'AnimBP_Wpn_RPG_C_ExecuteUbergraph_AnimBP_Wpn_RPG::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

}

