#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANIM_SERCET

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ANIM_SERCET.ANIM_SERCET_C
// 0x1120 (0x1478 - 0x0358)
class UANIM_SERCET_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8A8586164C291A61A367EBA0612AB197; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A6640D7B4264A405BEEC3085F4F47B50; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84B31F8844FF0BAB776491A562A60800; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6550C1404B60E8156487F88C7F54621E; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63C04A464D78EBF308357DB30C716CC5; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4FA66C284F178BC8509A899377083B93; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1FB81A349F0B86BE629318122EE6F1B; // 0x0510(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4C7512974F10AF0C44CF90B15E64EAC5; // 0x0558(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9A3F5A2048C5106B4399B8B0E841C747; // 0x05F8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15FB4B7B47AD0EDD579184B4B7BA4127; // 0x0638(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0280CEAB4FABF7314A4C2B8C535F68AA; // 0x06D8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5DA213824662400E7019CFA94378B162; // 0x0718(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_492F552D4DC11325EB07328FD7079511; // 0x07B8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9805DC7440A74E411DCB7183557C9BC9; // 0x07F8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F6B14F314C3695922E8FB58631FAC395; // 0x0898(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FA117694406FDD46DF1CE09063C75D92; // 0x08D8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9DFA75A541395D64A4F3DA88B58A495B; // 0x0978(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9B7852A941D96D592CCEC99994EA7DC5; // 0x09B8(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6F8A8B194B8AE6DB3DB2EBBDCDE3E998; // 0x0AE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9687083C4D1C4CB29D7FFC95FFB42FE5; // 0x0B20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A815660F47B927436EEA20B2E12F128C; // 0x0BC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_066E7BAA4A0DBDAD93AF13B023446FE5; // 0x0C00(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_239FC2C74723C9C3C6AE359B2CA7E906; // 0x0CE0(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F0104F714CC5E1D6AD1BABB1FB1EAB87; // 0x0DB0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CDC212BE4CF0149FFA9862AE3B28405F; // 0x0DF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EA708D15404F948AC2D3358C6874F95C; // 0x0E40(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2085CC7E46F461030973AD8E2586880C; // 0x0E88(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E20C28D04FDF86B32D27B3A2DC59A663; // 0x0ED0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A5B3673044F8CBD0932AF6B4BDAFBDEC; // 0x0F18(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D609AB6D427A78052AE9CDB960BCA31A; // 0x0FB8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_805B17A34E3A58F542595288A52920C6; // 0x0FF8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_235C36B0437B5005B417E8AF00873A2E; // 0x1098(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5F899CC6435F8CF91DF96494885F519F; // 0x10D8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A2FACB1C40F89CC3418FB495493050C8; // 0x1178(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9D11D7124E1DB87D73A617AD1C3F6E8E; // 0x11B8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0F5A184E46FA9B1C7782DCBF79F1CB60; // 0x1258(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3C23128545CE308EE1B76A9C78B81F4B; // 0x1298(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DDDC36FA45D6E4AD356635970B4BAA84; // 0x1338(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_734EE94B495A380518D4BE95040B80FF; // 0x1378(0x00E0)()
	bool                                          crouchToWalkBeginOver;                             // 0x1458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          walkTocrouchOver;                                  // 0x1459(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          toWalk;                                            // 0x145A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          crouchLoopOver;                                    // 0x145B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145C[0x4];                                     // 0x145C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_Secret_C*                       owerNpc;                                           // 0x1460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x1468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OrgHeight;                                         // 0x146C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          grapCrouchOver;                                    // 0x1470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          lsInP2;                                            // 0x1471(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          lsPlayComputer_;                                   // 0x1472(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          crouchToRunBeginOver;                              // 0x1473(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIM_SERCET_AnimGraphNode_TransitionResult_2085CC7E46F461030973AD8E2586880C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIM_SERCET_AnimGraphNode_TransitionResult_F0104F714CC5E1D6AD1BABB1FB1EAB87();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIM_SERCET_AnimGraphNode_TransitionResult_4FA66C284F178BC8509A899377083B93();
	void ExecuteUbergraph_ANIM_SERCET(int32 EntryPoint);
	void AnimNotify_ShootTime();
	void AnimNotify_PlayComputerOver();
	void AnimNotify_CrouchToRunOver();
	void AnimNotify_CrouchToRunBegin();
	void AnimNotify_grapCrouchOver();
	void AnimNotify_grapCrouchBegin();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIM_SERCET_AnimGraphNode_TransitionResult_A1FB81A349F0B86BE629318122EE6F1B();
	void BlueprintBeginPlay();
	void AnimNotify_crouchLoopOver();
	void AnimNotify_crouchLoopBegin();
	void AnimNotify_crouchToWalkOver();
	void AnimNotify_crouchToWalkBegin();
	void AnimNotify_walktoCrouchOver();
	void AnimNotify_walktoCrouchBegin();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ANIM_SERCET_AnimGraphNode_TransitionResult_6550C1404B60E8156487F88C7F54621E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANIM_SERCET_C">();
	}
	static class UANIM_SERCET_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANIM_SERCET_C>();
	}
};
static_assert(alignof(UANIM_SERCET_C) == 0x000008, "Wrong alignment on UANIM_SERCET_C");
static_assert(sizeof(UANIM_SERCET_C) == 0x001478, "Wrong size on UANIM_SERCET_C");
static_assert(offsetof(UANIM_SERCET_C, UberGraphFrame) == 0x000360, "Member 'UANIM_SERCET_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_Root_8A8586164C291A61A367EBA0612AB197) == 0x000368, "Member 'UANIM_SERCET_C::AnimGraphNode_Root_8A8586164C291A61A367EBA0612AB197' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_A6640D7B4264A405BEEC3085F4F47B50) == 0x0003A8, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_A6640D7B4264A405BEEC3085F4F47B50' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_84B31F8844FF0BAB776491A562A60800) == 0x0003F0, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_84B31F8844FF0BAB776491A562A60800' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_6550C1404B60E8156487F88C7F54621E) == 0x000438, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_6550C1404B60E8156487F88C7F54621E' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_63C04A464D78EBF308357DB30C716CC5) == 0x000480, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_63C04A464D78EBF308357DB30C716CC5' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_4FA66C284F178BC8509A899377083B93) == 0x0004C8, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_4FA66C284F178BC8509A899377083B93' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_A1FB81A349F0B86BE629318122EE6F1B) == 0x000510, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_A1FB81A349F0B86BE629318122EE6F1B' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_4C7512974F10AF0C44CF90B15E64EAC5) == 0x000558, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_4C7512974F10AF0C44CF90B15E64EAC5' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_9A3F5A2048C5106B4399B8B0E841C747) == 0x0005F8, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_9A3F5A2048C5106B4399B8B0E841C747' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_15FB4B7B47AD0EDD579184B4B7BA4127) == 0x000638, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_15FB4B7B47AD0EDD579184B4B7BA4127' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_0280CEAB4FABF7314A4C2B8C535F68AA) == 0x0006D8, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_0280CEAB4FABF7314A4C2B8C535F68AA' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_5DA213824662400E7019CFA94378B162) == 0x000718, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_5DA213824662400E7019CFA94378B162' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_492F552D4DC11325EB07328FD7079511) == 0x0007B8, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_492F552D4DC11325EB07328FD7079511' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_9805DC7440A74E411DCB7183557C9BC9) == 0x0007F8, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_9805DC7440A74E411DCB7183557C9BC9' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_F6B14F314C3695922E8FB58631FAC395) == 0x000898, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_F6B14F314C3695922E8FB58631FAC395' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_FA117694406FDD46DF1CE09063C75D92) == 0x0008D8, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_FA117694406FDD46DF1CE09063C75D92' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_9DFA75A541395D64A4F3DA88B58A495B) == 0x000978, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_9DFA75A541395D64A4F3DA88B58A495B' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_BlendSpacePlayer_9B7852A941D96D592CCEC99994EA7DC5) == 0x0009B8, "Member 'UANIM_SERCET_C::AnimGraphNode_BlendSpacePlayer_9B7852A941D96D592CCEC99994EA7DC5' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_6F8A8B194B8AE6DB3DB2EBBDCDE3E998) == 0x000AE0, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_6F8A8B194B8AE6DB3DB2EBBDCDE3E998' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_9687083C4D1C4CB29D7FFC95FFB42FE5) == 0x000B20, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_9687083C4D1C4CB29D7FFC95FFB42FE5' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_A815660F47B927436EEA20B2E12F128C) == 0x000BC0, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_A815660F47B927436EEA20B2E12F128C' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateMachine_066E7BAA4A0DBDAD93AF13B023446FE5) == 0x000C00, "Member 'UANIM_SERCET_C::AnimGraphNode_StateMachine_066E7BAA4A0DBDAD93AF13B023446FE5' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_BlendListByBool_239FC2C74723C9C3C6AE359B2CA7E906) == 0x000CE0, "Member 'UANIM_SERCET_C::AnimGraphNode_BlendListByBool_239FC2C74723C9C3C6AE359B2CA7E906' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_F0104F714CC5E1D6AD1BABB1FB1EAB87) == 0x000DB0, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_F0104F714CC5E1D6AD1BABB1FB1EAB87' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_CDC212BE4CF0149FFA9862AE3B28405F) == 0x000DF8, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_CDC212BE4CF0149FFA9862AE3B28405F' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_EA708D15404F948AC2D3358C6874F95C) == 0x000E40, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_EA708D15404F948AC2D3358C6874F95C' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_2085CC7E46F461030973AD8E2586880C) == 0x000E88, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_2085CC7E46F461030973AD8E2586880C' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_TransitionResult_E20C28D04FDF86B32D27B3A2DC59A663) == 0x000ED0, "Member 'UANIM_SERCET_C::AnimGraphNode_TransitionResult_E20C28D04FDF86B32D27B3A2DC59A663' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_A5B3673044F8CBD0932AF6B4BDAFBDEC) == 0x000F18, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_A5B3673044F8CBD0932AF6B4BDAFBDEC' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_D609AB6D427A78052AE9CDB960BCA31A) == 0x000FB8, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_D609AB6D427A78052AE9CDB960BCA31A' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_805B17A34E3A58F542595288A52920C6) == 0x000FF8, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_805B17A34E3A58F542595288A52920C6' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_235C36B0437B5005B417E8AF00873A2E) == 0x001098, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_235C36B0437B5005B417E8AF00873A2E' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_5F899CC6435F8CF91DF96494885F519F) == 0x0010D8, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_5F899CC6435F8CF91DF96494885F519F' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_A2FACB1C40F89CC3418FB495493050C8) == 0x001178, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_A2FACB1C40F89CC3418FB495493050C8' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_9D11D7124E1DB87D73A617AD1C3F6E8E) == 0x0011B8, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_9D11D7124E1DB87D73A617AD1C3F6E8E' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_0F5A184E46FA9B1C7782DCBF79F1CB60) == 0x001258, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_0F5A184E46FA9B1C7782DCBF79F1CB60' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_SequencePlayer_3C23128545CE308EE1B76A9C78B81F4B) == 0x001298, "Member 'UANIM_SERCET_C::AnimGraphNode_SequencePlayer_3C23128545CE308EE1B76A9C78B81F4B' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateResult_DDDC36FA45D6E4AD356635970B4BAA84) == 0x001338, "Member 'UANIM_SERCET_C::AnimGraphNode_StateResult_DDDC36FA45D6E4AD356635970B4BAA84' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, AnimGraphNode_StateMachine_734EE94B495A380518D4BE95040B80FF) == 0x001378, "Member 'UANIM_SERCET_C::AnimGraphNode_StateMachine_734EE94B495A380518D4BE95040B80FF' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, crouchToWalkBeginOver) == 0x001458, "Member 'UANIM_SERCET_C::crouchToWalkBeginOver' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, walkTocrouchOver) == 0x001459, "Member 'UANIM_SERCET_C::walkTocrouchOver' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, toWalk) == 0x00145A, "Member 'UANIM_SERCET_C::toWalk' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, crouchLoopOver) == 0x00145B, "Member 'UANIM_SERCET_C::crouchLoopOver' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, owerNpc) == 0x001460, "Member 'UANIM_SERCET_C::owerNpc' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, Speed) == 0x001468, "Member 'UANIM_SERCET_C::Speed' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, OrgHeight) == 0x00146C, "Member 'UANIM_SERCET_C::OrgHeight' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, grapCrouchOver) == 0x001470, "Member 'UANIM_SERCET_C::grapCrouchOver' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, lsInP2) == 0x001471, "Member 'UANIM_SERCET_C::lsInP2' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, lsPlayComputer_) == 0x001472, "Member 'UANIM_SERCET_C::lsPlayComputer_' has a wrong offset!");
static_assert(offsetof(UANIM_SERCET_C, crouchToRunBeginOver) == 0x001473, "Member 'UANIM_SERCET_C::crouchToRunBeginOver' has a wrong offset!");

}

