#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_HeavyRiotGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_HeavyRiotGun.AnimBP_Wpn_HeavyRiotGun_C
// 0x0388 (0x06E0 - 0x0358)
class UAnimBP_Wpn_HeavyRiotGun_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_41A69C974582DFC1E38F8CABE736A2FA; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2C850DEA44661E19CD1297B2BF82746E; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1B4A88504C293DB988BAD88AEA19A905; // 0x03F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9D3DF4D48FC928C72A125A12CAB0CE3; // 0x0438(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FDD367EC4223ED94FB8F68902C47636A; // 0x04D8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C42F0BCE4469DA90EAFC46B7EB61459E; // 0x0518(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8EE7098442C401891456FBA1D30F9DC1; // 0x05B8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8582F4ED49A1C3765DEFD1AD81317651; // 0x05F8(0x00E0)()
	bool                                          IsFire;                                            // 0x06D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AnimBP_Wpn_HeavyRiotGun(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_HeavyRiotGun_C">();
	}
	static class UAnimBP_Wpn_HeavyRiotGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_HeavyRiotGun_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_HeavyRiotGun_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_HeavyRiotGun_C");
static_assert(sizeof(UAnimBP_Wpn_HeavyRiotGun_C) == 0x0006E0, "Wrong size on UAnimBP_Wpn_HeavyRiotGun_C");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_Root_41A69C974582DFC1E38F8CABE736A2FA) == 0x000368, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_Root_41A69C974582DFC1E38F8CABE736A2FA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_TransitionResult_2C850DEA44661E19CD1297B2BF82746E) == 0x0003A8, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_TransitionResult_2C850DEA44661E19CD1297B2BF82746E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_TransitionResult_1B4A88504C293DB988BAD88AEA19A905) == 0x0003F0, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_TransitionResult_1B4A88504C293DB988BAD88AEA19A905' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_SequencePlayer_F9D3DF4D48FC928C72A125A12CAB0CE3) == 0x000438, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_SequencePlayer_F9D3DF4D48FC928C72A125A12CAB0CE3' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_StateResult_FDD367EC4223ED94FB8F68902C47636A) == 0x0004D8, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_StateResult_FDD367EC4223ED94FB8F68902C47636A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_SequencePlayer_C42F0BCE4469DA90EAFC46B7EB61459E) == 0x000518, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_SequencePlayer_C42F0BCE4469DA90EAFC46B7EB61459E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_StateResult_8EE7098442C401891456FBA1D30F9DC1) == 0x0005B8, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_StateResult_8EE7098442C401891456FBA1D30F9DC1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, AnimGraphNode_StateMachine_8582F4ED49A1C3765DEFD1AD81317651) == 0x0005F8, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::AnimGraphNode_StateMachine_8582F4ED49A1C3765DEFD1AD81317651' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_HeavyRiotGun_C, IsFire) == 0x0006D8, "Member 'UAnimBP_Wpn_HeavyRiotGun_C::IsFire' has a wrong offset!");

}

