#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_Pistol_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_Pistol_New.AnimBP_Wpn_Pistol_New_C
// 0x1380 (0x1790 - 0x0410)
class UAnimBP_Wpn_Pistol_New_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_112939A442EAD0F28CC53F9482B685AC; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F01BBBE440B211B0487A128FBAFF48A0; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB39A967405AEC3C27043C9235EC5EAB; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E93A83224CBB3210F0FA6CB637D6A84B; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0C2E5ABD4E99E95069E7FABE267541A2; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AC54CCE8442162D69F90C09579C34EFF; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E2FCDB454BCCC274553B5BA494230DA6; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8374BEEA41D71B0AD9F3F39312B5A60D; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6D6CA5AF40CB78EA844F39A6A4F17831; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_971A455D4500F77E8AF886AB1118AF54; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FAAEFA884618DF424FB66E825584A6D4; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A20A46CF49F6B3253EA73A8D4D907497; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22C9A077437066285D0BE79696A53BCF; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8BCFE5FE4037F48B3F3771831A01E84C; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FFD4269D4085F12FA9026BB42C82088B; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BECE0BA746DB8A90681A2CABB01F99FA; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67A97F71476132EEFD87F889794FC9F5; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38AA339F46B8F9A537822691ADE05724; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E6FBB23F433169E8366611A2648BC1AC; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1DA568AC41F73991051746A9D1021913; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_228F78BB46F07A58D6FEA7AD84C72F58; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BCCB85CE488C9D34BEC9778687D56B56; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B85AEB3B45D83FE94DCAB897D1FD37D4; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DAD27C24450ECBBA345099991A50F289; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_188ADAAF434967C2FDE93790695C6852; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_F351B1754D26ED976EE1998B6D1B9C88; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6E2DE8574E3F4CBF2C7D3E8CC35FD6FE; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FC98597F4D25AF603F9356A47D984BAD; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6D802913430471F7E9FBF3B40ED54812; // 0x1028(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_A06C8DBB4B3F6EA8B6C54CAA8DB05C3E; // 0x10C8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3404873A42FF89DAC35B2586293A59D1; // 0x1198(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9443376343193FEEEE2D03A9DC54843F; // 0x1270(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3C8760B94F66ADC36C0A519D3C8B577A; // 0x12B8(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F01AB0424371CAB20CF720AC94C30122; // 0x13F0(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9D9E03F0495E170B557A73A70A3FF08A; // 0x1430(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48835AEE49D8850FD9A17FBF44B71993; // 0x1470(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5E07B84745EDB02893FD1C8B0C7F6E2F; // 0x14B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C2B52952452428E16646488D9C016090; // 0x1588(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18C1208D42AE5780376960A0FB784CEE; // 0x1628(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_DF0CB6D443E2B676AA04BFB3685E54C9; // 0x1700(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FB59E86C49B6E630F1BB588D96677D83; // 0x1748(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_TransitionResult_E93A83224CBB3210F0FA6CB637D6A84B();
	void ExecuteUbergraph_AnimBP_Wpn_Pistol_New(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_TransitionResult_0C2E5ABD4E99E95069E7FABE267541A2();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_TransitionResult_E2FCDB454BCCC274553B5BA494230DA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_ModifyBone_3C8760B94F66ADC36C0A519D3C8B577A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_BlendListByBool_A06C8DBB4B3F6EA8B6C54CAA8DB05C3E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_Pistol_New_AnimGraphNode_TransitionResult_F01BBBE440B211B0487A128FBAFF48A0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_Pistol_New_C">();
	}
	static class UAnimBP_Wpn_Pistol_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_Pistol_New_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_Pistol_New_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_Pistol_New_C");
static_assert(sizeof(UAnimBP_Wpn_Pistol_New_C) == 0x001790, "Wrong size on UAnimBP_Wpn_Pistol_New_C");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_Pistol_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_Root_112939A442EAD0F28CC53F9482B685AC) == 0x000418, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_Root_112939A442EAD0F28CC53F9482B685AC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_F01BBBE440B211B0487A128FBAFF48A0) == 0x000458, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_F01BBBE440B211B0487A128FBAFF48A0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_BB39A967405AEC3C27043C9235EC5EAB) == 0x0004A0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_BB39A967405AEC3C27043C9235EC5EAB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_E93A83224CBB3210F0FA6CB637D6A84B) == 0x0004E8, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_E93A83224CBB3210F0FA6CB637D6A84B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_0C2E5ABD4E99E95069E7FABE267541A2) == 0x000530, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_0C2E5ABD4E99E95069E7FABE267541A2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_AC54CCE8442162D69F90C09579C34EFF) == 0x000578, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_AC54CCE8442162D69F90C09579C34EFF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_E2FCDB454BCCC274553B5BA494230DA6) == 0x0005C0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_E2FCDB454BCCC274553B5BA494230DA6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_8374BEEA41D71B0AD9F3F39312B5A60D) == 0x000608, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_8374BEEA41D71B0AD9F3F39312B5A60D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_6D6CA5AF40CB78EA844F39A6A4F17831) == 0x000650, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_6D6CA5AF40CB78EA844F39A6A4F17831' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_TransitionResult_971A455D4500F77E8AF886AB1118AF54) == 0x000698, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_TransitionResult_971A455D4500F77E8AF886AB1118AF54' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_FAAEFA884618DF424FB66E825584A6D4) == 0x0006E0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_FAAEFA884618DF424FB66E825584A6D4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_A20A46CF49F6B3253EA73A8D4D907497) == 0x000780, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_A20A46CF49F6B3253EA73A8D4D907497' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_22C9A077437066285D0BE79696A53BCF) == 0x0007C0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_22C9A077437066285D0BE79696A53BCF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_8BCFE5FE4037F48B3F3771831A01E84C) == 0x000860, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_8BCFE5FE4037F48B3F3771831A01E84C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_FFD4269D4085F12FA9026BB42C82088B) == 0x0008A0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_FFD4269D4085F12FA9026BB42C82088B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_BECE0BA746DB8A90681A2CABB01F99FA) == 0x000940, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_BECE0BA746DB8A90681A2CABB01F99FA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_67A97F71476132EEFD87F889794FC9F5) == 0x000980, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_67A97F71476132EEFD87F889794FC9F5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_38AA339F46B8F9A537822691ADE05724) == 0x000A20, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_38AA339F46B8F9A537822691ADE05724' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_E6FBB23F433169E8366611A2648BC1AC) == 0x000A60, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_E6FBB23F433169E8366611A2648BC1AC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_1DA568AC41F73991051746A9D1021913) == 0x000B00, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_1DA568AC41F73991051746A9D1021913' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_228F78BB46F07A58D6FEA7AD84C72F58) == 0x000B40, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_228F78BB46F07A58D6FEA7AD84C72F58' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_BCCB85CE488C9D34BEC9778687D56B56) == 0x000BE0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_BCCB85CE488C9D34BEC9778687D56B56' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_B85AEB3B45D83FE94DCAB897D1FD37D4) == 0x000C20, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_B85AEB3B45D83FE94DCAB897D1FD37D4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateResult_DAD27C24450ECBBA345099991A50F289) == 0x000CC0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateResult_DAD27C24450ECBBA345099991A50F289' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_StateMachine_188ADAAF434967C2FDE93790695C6852) == 0x000D00, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_StateMachine_188ADAAF434967C2FDE93790695C6852' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_LayeredBoneBlend_F351B1754D26ED976EE1998B6D1B9C88) == 0x000DE0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_LayeredBoneBlend_F351B1754D26ED976EE1998B6D1B9C88' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_BlendListByBool_6E2DE8574E3F4CBF2C7D3E8CC35FD6FE) == 0x000EB8, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_BlendListByBool_6E2DE8574E3F4CBF2C7D3E8CC35FD6FE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_FC98597F4D25AF603F9356A47D984BAD) == 0x000F88, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_FC98597F4D25AF603F9356A47D984BAD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_6D802913430471F7E9FBF3B40ED54812) == 0x001028, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_6D802913430471F7E9FBF3B40ED54812' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_BlendListByBool_A06C8DBB4B3F6EA8B6C54CAA8DB05C3E) == 0x0010C8, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_BlendListByBool_A06C8DBB4B3F6EA8B6C54CAA8DB05C3E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SaveCachedPose_3404873A42FF89DAC35B2586293A59D1) == 0x001198, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SaveCachedPose_3404873A42FF89DAC35B2586293A59D1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_UseCachedPose_9443376343193FEEEE2D03A9DC54843F) == 0x001270, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_UseCachedPose_9443376343193FEEEE2D03A9DC54843F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_ModifyBone_3C8760B94F66ADC36C0A519D3C8B577A) == 0x0012B8, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_ModifyBone_3C8760B94F66ADC36C0A519D3C8B577A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_LocalToComponentSpace_F01AB0424371CAB20CF720AC94C30122) == 0x0013F0, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_LocalToComponentSpace_F01AB0424371CAB20CF720AC94C30122' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_ComponentToLocalSpace_9D9E03F0495E170B557A73A70A3FF08A) == 0x001430, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_ComponentToLocalSpace_9D9E03F0495E170B557A73A70A3FF08A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_UseCachedPose_48835AEE49D8850FD9A17FBF44B71993) == 0x001470, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_UseCachedPose_48835AEE49D8850FD9A17FBF44B71993' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_BlendListByBool_5E07B84745EDB02893FD1C8B0C7F6E2F) == 0x0014B8, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_BlendListByBool_5E07B84745EDB02893FD1C8B0C7F6E2F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SequencePlayer_C2B52952452428E16646488D9C016090) == 0x001588, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SequencePlayer_C2B52952452428E16646488D9C016090' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_SaveCachedPose_18C1208D42AE5780376960A0FB784CEE) == 0x001628, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_SaveCachedPose_18C1208D42AE5780376960A0FB784CEE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_UseCachedPose_DF0CB6D443E2B676AA04BFB3685E54C9) == 0x001700, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_UseCachedPose_DF0CB6D443E2B676AA04BFB3685E54C9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_Pistol_New_C, AnimGraphNode_UseCachedPose_FB59E86C49B6E630F1BB588D96677D83) == 0x001748, "Member 'UAnimBP_Wpn_Pistol_New_C::AnimGraphNode_UseCachedPose_FB59E86C49B6E630F1BB588D96677D83' has a wrong offset!");

}

