#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Weapon_AAC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Weapon_AAC.AnimBP_Weapon_AAC_C.ExecuteUbergraph_AnimBP_Weapon_AAC
// 0x0138 (0x0138 - 0x0000)
struct AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue1;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select1_Default;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue1;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base1;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable4;                // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue2;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue2;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base2;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue3;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoltLength_Value;                      // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base3;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue4;              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base4;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue3;                         // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable4;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue5;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue4;                         // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base5;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue5;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC) == 0x000008, "Wrong alignment on AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC");
static_assert(sizeof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC) == 0x000138, "Wrong size on AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, EntryPoint) == 0x000000, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1) == 0x00000C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000010, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000011, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_IsClosed_Variable) == 0x000012, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2) == 0x000014, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanOR_ReturnValue) == 0x000018, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Less_FloatFloat_ReturnValue) == 0x000019, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Less_FloatFloat_ReturnValue1) == 0x00001A, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue1) == 0x00001B, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue2) == 0x00001C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Not_PreBool_ReturnValue1) == 0x00001D, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue3) == 0x00001E, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanOR_ReturnValue1) == 0x00001F, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_IsClosed_Variable1) == 0x000021, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3) == 0x000024, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000028, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Has_Been_Initd_Variable1) == 0x000029, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue4) == 0x00002A, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Variable) == 0x00002B, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Has_Been_Initd_Variable2) == 0x00002C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_IsClosed_Variable2) == 0x00002D, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Abs_ReturnValue) == 0x000030, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_MapRangeClamped_ReturnValue) == 0x000034, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue5) == 0x000044, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanOR_ReturnValue2) == 0x000045, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_IsClosed_Variable3) == 0x000046, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_IsClosed_Variable3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Not_PreBool_ReturnValue2) == 0x000047, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue6) == 0x000048, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Variable1) == 0x000049, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_Select_Default) == 0x000050, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_BooleanAND_ReturnValue7) == 0x000058, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Abs_ReturnValue1) == 0x00005C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Abs_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_MapRangeClamped_ReturnValue1) == 0x000060, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_MapRangeClamped_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_Event_DeltaTimeX) == 0x000064, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_Select1_Default) == 0x000068, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000070, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Has_Been_Initd_Variable3) == 0x000074, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Has_Been_Initd_Variable3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue) == 0x000080, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base) == 0x000088, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue1) == 0x000098, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base1) == 0x0000A0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess1) == 0x0000A8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_Has_Been_Initd_Variable4) == 0x0000A9, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_Has_Been_Initd_Variable4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Abs_ReturnValue2) == 0x0000AC, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Abs_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0000B0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000B4, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x0000B8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Less_FloatFloat_ReturnValue2) == 0x0000B9, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x0000BA, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000BB, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue4) == 0x0000BC, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue2) == 0x0000C0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base2) == 0x0000C8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess2) == 0x0000D0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue3) == 0x0000D8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetBoltLength_Value) == 0x0000E0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetBoltLength_Value' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base3) == 0x0000E8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess3) == 0x0000F0, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue4) == 0x0000F8, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base4) == 0x000100, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess4) == 0x000108, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_IsValid_ReturnValue) == 0x000109, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Abs_ReturnValue3) == 0x00010C, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Abs_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, Temp_bool_IsClosed_Variable4) == 0x000110, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::Temp_bool_IsClosed_Variable4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_GetOwningActor_ReturnValue5) == 0x000118, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_GetOwningActor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Abs_ReturnValue4) == 0x000120, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Abs_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_AsBPWeapon_Base5) == 0x000128, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_AsBPWeapon_Base5' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, K2Node_DynamicCast_bSuccess5) == 0x000130, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC, CallFunc_Greater_FloatFloat_ReturnValue5) == 0x000131, "Member 'AnimBP_Weapon_AAC_C_ExecuteUbergraph_AnimBP_Weapon_AAC::CallFunc_Greater_FloatFloat_ReturnValue5' has a wrong offset!");

// Function AnimBP_Weapon_AAC.AnimBP_Weapon_AAC_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_Weapon_AAC_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

