#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MotoBNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BE_Lv3_AttackState_structs.hpp"
#include "BE_Lv3_BehaviorState_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_MotoBNPC.AnimBP_MotoBNPC_C
// 0x0D60 (0x10B8 - 0x0358)
class UAnimBP_MotoBNPC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_398008C747C65A003EBC8A8CAE5FE146; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32C302194173721CE7B4A2BF0C31E7F2; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4394C4A448373D0F01BE6F942F1EF04A; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D30B16084A128C99C20EF39BFE36C168; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D078B87F4161154512AA998B62B174EB; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7E09E6964785DE839D074EBFD214AAC6; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77C898A34665911944F29A9A5B256371; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABC78D2F4DFC09F6C4E76983C8A4853F; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F4C926104EBB30B577BC20B3E99DFCA4; // 0x05A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A7E3505F4F75DBE144376AB96B6C8940; // 0x05E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19DC86244761E3185A98A1B7DA43E810; // 0x0688(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ED25914D42A1D4B6012CF692313BDC08; // 0x06C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19B0704F43DCF4E32154FB8BC32E415C; // 0x0768(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E66A64DB46CD5B1E13F87CB0AA5DDA93; // 0x07A8(0x00A0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_AFF2CD6148B2C56E4569AD975EECB2B1; // 0x0848(0x01E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_361A32A24E660E3F3046E097716BA330; // 0x0A28(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_731508EC4608B96C252F9494544E8AA6; // 0x0A68(0x00A0)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_479FD9CB4790F646A9E30DB2C059BBF5; // 0x0B08(0x01E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6D4A843C4E935462FC3604B2CD249039; // 0x0CE8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D182B8A4202D57A4EA316833B929481; // 0x0D28(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3A6D2F124B022B915A15B0AEE58DABAD; // 0x0DC8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9A0B067B419B05F141D5529FB75C8286; // 0x0E08(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7D6653DB4F590CB3D8FF019652DA0A76; // 0x0EA8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_622CB8C64DB9C88B6913B6A41A44DAA8; // 0x0EE8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6F6CB0DB40BD9FF089F8C29031273E41; // 0x0F88(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4E076E684C3BE7857C72238866E4DCA0; // 0x0FC8(0x00E0)()
	float                                         Y;                                                 // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z;                                                 // 0x10AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv3_AttackState                           AttackState;                                       // 0x10B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv3_BehaviorState                         BehaviorStates;                                    // 0x10B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_D078B87F4161154512AA998B62B174EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_F4C926104EBB30B577BC20B3E99DFCA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_ABC78D2F4DFC09F6C4E76983C8A4853F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_77C898A34665911944F29A9A5B256371();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_7E09E6964785DE839D074EBFD214AAC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_D30B16084A128C99C20EF39BFE36C168();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_RotationOffsetBlendSpace_AFF2CD6148B2C56E4569AD975EECB2B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_4394C4A448373D0F01BE6F942F1EF04A();
	void ExecuteUbergraph_AnimBP_MotoBNPC(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_RotationOffsetBlendSpace_479FD9CB4790F646A9E30DB2C059BBF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_MotoBNPC_AnimGraphNode_TransitionResult_32C302194173721CE7B4A2BF0C31E7F2();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_MotoBNPC_C">();
	}
	static class UAnimBP_MotoBNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_MotoBNPC_C>();
	}
};
static_assert(alignof(UAnimBP_MotoBNPC_C) == 0x000008, "Wrong alignment on UAnimBP_MotoBNPC_C");
static_assert(sizeof(UAnimBP_MotoBNPC_C) == 0x0010B8, "Wrong size on UAnimBP_MotoBNPC_C");
static_assert(offsetof(UAnimBP_MotoBNPC_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_MotoBNPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_Root_398008C747C65A003EBC8A8CAE5FE146) == 0x000368, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_Root_398008C747C65A003EBC8A8CAE5FE146' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_32C302194173721CE7B4A2BF0C31E7F2) == 0x0003A8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_32C302194173721CE7B4A2BF0C31E7F2' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_4394C4A448373D0F01BE6F942F1EF04A) == 0x0003F0, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_4394C4A448373D0F01BE6F942F1EF04A' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_D30B16084A128C99C20EF39BFE36C168) == 0x000438, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_D30B16084A128C99C20EF39BFE36C168' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_D078B87F4161154512AA998B62B174EB) == 0x000480, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_D078B87F4161154512AA998B62B174EB' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_7E09E6964785DE839D074EBFD214AAC6) == 0x0004C8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_7E09E6964785DE839D074EBFD214AAC6' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_77C898A34665911944F29A9A5B256371) == 0x000510, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_77C898A34665911944F29A9A5B256371' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_ABC78D2F4DFC09F6C4E76983C8A4853F) == 0x000558, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_ABC78D2F4DFC09F6C4E76983C8A4853F' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_TransitionResult_F4C926104EBB30B577BC20B3E99DFCA4) == 0x0005A0, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_TransitionResult_F4C926104EBB30B577BC20B3E99DFCA4' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_A7E3505F4F75DBE144376AB96B6C8940) == 0x0005E8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_A7E3505F4F75DBE144376AB96B6C8940' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_19DC86244761E3185A98A1B7DA43E810) == 0x000688, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_19DC86244761E3185A98A1B7DA43E810' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_ED25914D42A1D4B6012CF692313BDC08) == 0x0006C8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_ED25914D42A1D4B6012CF692313BDC08' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_19B0704F43DCF4E32154FB8BC32E415C) == 0x000768, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_19B0704F43DCF4E32154FB8BC32E415C' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_E66A64DB46CD5B1E13F87CB0AA5DDA93) == 0x0007A8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_E66A64DB46CD5B1E13F87CB0AA5DDA93' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_RotationOffsetBlendSpace_AFF2CD6148B2C56E4569AD975EECB2B1) == 0x000848, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_RotationOffsetBlendSpace_AFF2CD6148B2C56E4569AD975EECB2B1' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_361A32A24E660E3F3046E097716BA330) == 0x000A28, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_361A32A24E660E3F3046E097716BA330' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_731508EC4608B96C252F9494544E8AA6) == 0x000A68, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_731508EC4608B96C252F9494544E8AA6' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_RotationOffsetBlendSpace_479FD9CB4790F646A9E30DB2C059BBF5) == 0x000B08, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_RotationOffsetBlendSpace_479FD9CB4790F646A9E30DB2C059BBF5' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_6D4A843C4E935462FC3604B2CD249039) == 0x000CE8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_6D4A843C4E935462FC3604B2CD249039' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_1D182B8A4202D57A4EA316833B929481) == 0x000D28, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_1D182B8A4202D57A4EA316833B929481' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_3A6D2F124B022B915A15B0AEE58DABAD) == 0x000DC8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_3A6D2F124B022B915A15B0AEE58DABAD' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_9A0B067B419B05F141D5529FB75C8286) == 0x000E08, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_9A0B067B419B05F141D5529FB75C8286' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_7D6653DB4F590CB3D8FF019652DA0A76) == 0x000EA8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_7D6653DB4F590CB3D8FF019652DA0A76' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_SequencePlayer_622CB8C64DB9C88B6913B6A41A44DAA8) == 0x000EE8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_SequencePlayer_622CB8C64DB9C88B6913B6A41A44DAA8' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateResult_6F6CB0DB40BD9FF089F8C29031273E41) == 0x000F88, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateResult_6F6CB0DB40BD9FF089F8C29031273E41' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AnimGraphNode_StateMachine_4E076E684C3BE7857C72238866E4DCA0) == 0x000FC8, "Member 'UAnimBP_MotoBNPC_C::AnimGraphNode_StateMachine_4E076E684C3BE7857C72238866E4DCA0' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, Y) == 0x0010A8, "Member 'UAnimBP_MotoBNPC_C::Y' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, Z) == 0x0010AC, "Member 'UAnimBP_MotoBNPC_C::Z' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, AttackState) == 0x0010B0, "Member 'UAnimBP_MotoBNPC_C::AttackState' has a wrong offset!");
static_assert(offsetof(UAnimBP_MotoBNPC_C, BehaviorStates) == 0x0010B1, "Member 'UAnimBP_MotoBNPC_C::BehaviorStates' has a wrong offset!");

}

