#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Clip_WA2000

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Clip_WA2000.AnimBP_Clip_WA2000_C
// 0x02C8 (0x0638 - 0x0370)
class UAnimBP_Clip_WA2000_C final : public UClipAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_14D4B9D74F4D3648497948868ED3C68B; // 0x0378(0x0040)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5DA38D0A4D9DCCDB66CC658AEDE75E0C; // 0x03B8(0x01E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_039F8FE14D784A314324329230EF56C5; // 0x0598(0x00A0)()

public:
	void ExecuteUbergraph_AnimBP_Clip_WA2000(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Clip_WA2000_C">();
	}
	static class UAnimBP_Clip_WA2000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Clip_WA2000_C>();
	}
};
static_assert(alignof(UAnimBP_Clip_WA2000_C) == 0x000008, "Wrong alignment on UAnimBP_Clip_WA2000_C");
static_assert(sizeof(UAnimBP_Clip_WA2000_C) == 0x000638, "Wrong size on UAnimBP_Clip_WA2000_C");
static_assert(offsetof(UAnimBP_Clip_WA2000_C, UberGraphFrame) == 0x000370, "Member 'UAnimBP_Clip_WA2000_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_WA2000_C, AnimGraphNode_Root_14D4B9D74F4D3648497948868ED3C68B) == 0x000378, "Member 'UAnimBP_Clip_WA2000_C::AnimGraphNode_Root_14D4B9D74F4D3648497948868ED3C68B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_WA2000_C, AnimGraphNode_RotationOffsetBlendSpace_5DA38D0A4D9DCCDB66CC658AEDE75E0C) == 0x0003B8, "Member 'UAnimBP_Clip_WA2000_C::AnimGraphNode_RotationOffsetBlendSpace_5DA38D0A4D9DCCDB66CC658AEDE75E0C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Clip_WA2000_C, AnimGraphNode_SequencePlayer_039F8FE14D784A314324329230EF56C5) == 0x000598, "Member 'UAnimBP_Clip_WA2000_C::AnimGraphNode_SequencePlayer_039F8FE14D784A314324329230EF56C5' has a wrong offset!");

}

