#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_lv3_Car01_Enemy_Sniper02_Driver

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_lv3_Car01_Enemy_Sniper02_Driver.AnimBP_lv3_Car01_Enemy_Sniper02_Driver_C
// 0x02D8 (0x0630 - 0x0358)
class UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4EB6B8FB472706D43218F4866ACB4623; // 0x0368(0x0040)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_E5F4E1344ACBAD01FB8CAAB96B2FBD6D; // 0x03A8(0x01E0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A2CB9DCF4EAE0822969435A62207E5A4; // 0x0588(0x00A0)()
	float                                         Z;                                                 // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AnimBP_lv3_Car01_Enemy_Sniper02_Driver(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_lv3_Car01_Enemy_Sniper02_Driver_C">();
	}
	static class UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C>();
	}
};
static_assert(alignof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C) == 0x000008, "Wrong alignment on UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C");
static_assert(sizeof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C) == 0x000630, "Wrong size on UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C");
static_assert(offsetof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C, UberGraphFrame) == 0x000360, "Member 'UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C, AnimGraphNode_Root_4EB6B8FB472706D43218F4866ACB4623) == 0x000368, "Member 'UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C::AnimGraphNode_Root_4EB6B8FB472706D43218F4866ACB4623' has a wrong offset!");
static_assert(offsetof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C, AnimGraphNode_RotationOffsetBlendSpace_E5F4E1344ACBAD01FB8CAAB96B2FBD6D) == 0x0003A8, "Member 'UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C::AnimGraphNode_RotationOffsetBlendSpace_E5F4E1344ACBAD01FB8CAAB96B2FBD6D' has a wrong offset!");
static_assert(offsetof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C, AnimGraphNode_SequencePlayer_A2CB9DCF4EAE0822969435A62207E5A4) == 0x000588, "Member 'UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C::AnimGraphNode_SequencePlayer_A2CB9DCF4EAE0822969435A62207E5A4' has a wrong offset!");
static_assert(offsetof(UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C, Z) == 0x000628, "Member 'UAnimBP_lv3_Car01_Enemy_Sniper02_Driver_C::Z' has a wrong offset!");

}

