#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_HeavyRiot_Shield

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_HeavyRiot_Shield.AnimBP_HeavyRiot_Shield_C.ExecuteUbergraph_AnimBP_HeavyRiot_Shield
// 0x0014 (0x0014 - 0x0000)
struct AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield) == 0x000004, "Wrong alignment on AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield");
static_assert(sizeof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield) == 0x000014, "Wrong size on AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield");
static_assert(offsetof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield, EntryPoint) == 0x000000, "Member 'AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue) == 0x000004, "Member 'AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield, CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1) == 0x00000C, "Member 'AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield::CallFunc_GetInstanceAssetPlayerTimeFromEnd_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000010, "Member 'AnimBP_HeavyRiot_Shield_C_ExecuteUbergraph_AnimBP_HeavyRiot_Shield::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");

}

