#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Weapon_AAC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Weapon_AAC.AnimBP_Weapon_AAC_C
// 0x1820 (0x1C30 - 0x0410)
class UAnimBP_Weapon_AAC_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_02C5F5304D61B53907524CB2BE2836B6; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86F681114DB0571711D865B420533227; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0997150145060DA3F01728A8526BEBC0; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_092B2A2E4B33B922976CAEB21B7EEEE2; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D01AA31E4877CBE0B75395A0064580A7; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79E80603487CBD2306BCE1B0C2653542; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2F2417664154487F37D897BDB52474D1; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A171B93B4056DED217E0698C06AE7488; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FEBF56A9410A20F05308829E308BB8ED; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30BA4CF2409C5AA218A3928794F24803; // 0x0698(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3666E90545C5DBA66D11AEA635720078; // 0x06E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56E35F8945D8D05AD4955394F56F4E0D; // 0x0728(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_844752824F3E13D6A505CFA4C98F8BBE; // 0x07C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AB52B160421AB4AEA80CC6BCE52FD01A; // 0x0808(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2DCF8DDE4857B11361213EAD41E1FCC9; // 0x08A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DB7E3C6642C04AD3AB4DD0B755F5802F; // 0x08E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DAFF748F4698E2DB62DF75B7044F5E29; // 0x0988(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6CD1B218418A832D6F1B36B4AEE76C6C; // 0x09C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_880D2A864AE4CAC40E01AE83B70973B0; // 0x0A68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4E49FBFB447BE47D4974D8BB87B7ADD7; // 0x0AA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_613A0A454CE3E3F1A653E2991BA9A6B9; // 0x0B48(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DA4B792C4883DB257B90AFA8BAA18812; // 0x0B88(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4AEC46414E672299E3C176997A22139A; // 0x0C28(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2E6354A74B79840C11BC44A7DDC65D1A; // 0x0C68(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6C1C52DD49AD9BDCF960239E4696E5E9; // 0x0D08(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4D97F46F4853466690A70087B453B3F9; // 0x0D48(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2DAFA1724ACCEE491A2CC5A8E853059B; // 0x0E28(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5FD55BA64A6B540B8F409EB8C2695966; // 0x0F00(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FEE534EB489A7D4C136CED8BEC4E6819; // 0x0FD0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A93A29A34ADC0EE67FCFC0950CCFCE6E; // 0x1070(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5573163043F959F10C64EB9C54BE4BF7; // 0x1110(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_620639AB4EB43E6BBA4B74883BAE8FFD; // 0x11E0(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_DDE29D5D486CE0CC8E94DBACF226A144; // 0x12B8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4C149B0041BE26A850D56BB37B536388; // 0x1300(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_037E41F941CE805D775BD89003CBC2FF; // 0x1348(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_FFD1E89F4E6F7F7B8D759FBDF3ED6DF7; // 0x1420(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_BCDA4BC04BEBDD7CDA5ED5BC3DD98340; // 0x1468(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BB43C7E440089A726B075F8DCE03A1FA; // 0x1648(0x00D0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4EBDC3044795E629C227799FF24CFD35; // 0x1718(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_180276374F2AFBD0DA08778A9F209A6E; // 0x1850(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4B4F18D34235A1F9668A3EB3279C0FA7; // 0x1890(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_747E481E4AA64BE3A6B8A8B4D399F365; // 0x18D0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D42EE4CF48B79B115C8E5089FB7D3541; // 0x1918(0x0138)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BC8D362D4F1D7E71BC1BBBB712B62143; // 0x1A50(0x0040)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_B4A4911D450731F01B8FD6AD6B87EAA9; // 0x1A90(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69086D8F4CA55743F099CCA70011F128; // 0x1AD0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A93523EA43706053120507949E0B5864; // 0x1BA0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_065D5AE148549FFADAA8F4BD8013FB65; // 0x1BE8(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_TransitionResult_A171B93B4056DED217E0698C06AE7488();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_TransitionResult_D01AA31E4877CBE0B75395A0064580A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_TransitionResult_092B2A2E4B33B922976CAEB21B7EEEE2();
	void ExecuteUbergraph_AnimBP_Weapon_AAC(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_BlendListByBool_69086D8F4CA55743F099CCA70011F128();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_ModifyBone_4EBDC3044795E629C227799FF24CFD35();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_RotationOffsetBlendSpace_BCDA4BC04BEBDD7CDA5ED5BC3DD98340();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_BlendListByBool_5573163043F959F10C64EB9C54BE4BF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_SequencePlayer_4E49FBFB447BE47D4974D8BB87B7ADD7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Weapon_AAC_AnimGraphNode_TransitionResult_86F681114DB0571711D865B420533227();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Weapon_AAC_C">();
	}
	static class UAnimBP_Weapon_AAC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Weapon_AAC_C>();
	}
};
static_assert(alignof(UAnimBP_Weapon_AAC_C) == 0x000008, "Wrong alignment on UAnimBP_Weapon_AAC_C");
static_assert(sizeof(UAnimBP_Weapon_AAC_C) == 0x001C30, "Wrong size on UAnimBP_Weapon_AAC_C");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Weapon_AAC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_Root_02C5F5304D61B53907524CB2BE2836B6) == 0x000418, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_Root_02C5F5304D61B53907524CB2BE2836B6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_86F681114DB0571711D865B420533227) == 0x000458, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_86F681114DB0571711D865B420533227' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_0997150145060DA3F01728A8526BEBC0) == 0x0004A0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_0997150145060DA3F01728A8526BEBC0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_092B2A2E4B33B922976CAEB21B7EEEE2) == 0x0004E8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_092B2A2E4B33B922976CAEB21B7EEEE2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_D01AA31E4877CBE0B75395A0064580A7) == 0x000530, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_D01AA31E4877CBE0B75395A0064580A7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_79E80603487CBD2306BCE1B0C2653542) == 0x000578, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_79E80603487CBD2306BCE1B0C2653542' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_2F2417664154487F37D897BDB52474D1) == 0x0005C0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_2F2417664154487F37D897BDB52474D1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_A171B93B4056DED217E0698C06AE7488) == 0x000608, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_A171B93B4056DED217E0698C06AE7488' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_FEBF56A9410A20F05308829E308BB8ED) == 0x000650, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_FEBF56A9410A20F05308829E308BB8ED' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_30BA4CF2409C5AA218A3928794F24803) == 0x000698, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_30BA4CF2409C5AA218A3928794F24803' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_TransitionResult_3666E90545C5DBA66D11AEA635720078) == 0x0006E0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_TransitionResult_3666E90545C5DBA66D11AEA635720078' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_56E35F8945D8D05AD4955394F56F4E0D) == 0x000728, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_56E35F8945D8D05AD4955394F56F4E0D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_844752824F3E13D6A505CFA4C98F8BBE) == 0x0007C8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_844752824F3E13D6A505CFA4C98F8BBE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_AB52B160421AB4AEA80CC6BCE52FD01A) == 0x000808, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_AB52B160421AB4AEA80CC6BCE52FD01A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_2DCF8DDE4857B11361213EAD41E1FCC9) == 0x0008A8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_2DCF8DDE4857B11361213EAD41E1FCC9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_DB7E3C6642C04AD3AB4DD0B755F5802F) == 0x0008E8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_DB7E3C6642C04AD3AB4DD0B755F5802F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_DAFF748F4698E2DB62DF75B7044F5E29) == 0x000988, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_DAFF748F4698E2DB62DF75B7044F5E29' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_6CD1B218418A832D6F1B36B4AEE76C6C) == 0x0009C8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_6CD1B218418A832D6F1B36B4AEE76C6C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_880D2A864AE4CAC40E01AE83B70973B0) == 0x000A68, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_880D2A864AE4CAC40E01AE83B70973B0' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_4E49FBFB447BE47D4974D8BB87B7ADD7) == 0x000AA8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_4E49FBFB447BE47D4974D8BB87B7ADD7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_613A0A454CE3E3F1A653E2991BA9A6B9) == 0x000B48, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_613A0A454CE3E3F1A653E2991BA9A6B9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_DA4B792C4883DB257B90AFA8BAA18812) == 0x000B88, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_DA4B792C4883DB257B90AFA8BAA18812' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_4AEC46414E672299E3C176997A22139A) == 0x000C28, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_4AEC46414E672299E3C176997A22139A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_2E6354A74B79840C11BC44A7DDC65D1A) == 0x000C68, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_2E6354A74B79840C11BC44A7DDC65D1A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateResult_6C1C52DD49AD9BDCF960239E4696E5E9) == 0x000D08, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateResult_6C1C52DD49AD9BDCF960239E4696E5E9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_StateMachine_4D97F46F4853466690A70087B453B3F9) == 0x000D48, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_StateMachine_4D97F46F4853466690A70087B453B3F9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_LayeredBoneBlend_2DAFA1724ACCEE491A2CC5A8E853059B) == 0x000E28, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_LayeredBoneBlend_2DAFA1724ACCEE491A2CC5A8E853059B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_BlendListByBool_5FD55BA64A6B540B8F409EB8C2695966) == 0x000F00, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_BlendListByBool_5FD55BA64A6B540B8F409EB8C2695966' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_FEE534EB489A7D4C136CED8BEC4E6819) == 0x000FD0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_FEE534EB489A7D4C136CED8BEC4E6819' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SequencePlayer_A93A29A34ADC0EE67FCFC0950CCFCE6E) == 0x001070, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SequencePlayer_A93A29A34ADC0EE67FCFC0950CCFCE6E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_BlendListByBool_5573163043F959F10C64EB9C54BE4BF7) == 0x001110, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_BlendListByBool_5573163043F959F10C64EB9C54BE4BF7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SaveCachedPose_620639AB4EB43E6BBA4B74883BAE8FFD) == 0x0011E0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SaveCachedPose_620639AB4EB43E6BBA4B74883BAE8FFD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_DDE29D5D486CE0CC8E94DBACF226A144) == 0x0012B8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_DDE29D5D486CE0CC8E94DBACF226A144' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_4C149B0041BE26A850D56BB37B536388) == 0x001300, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_4C149B0041BE26A850D56BB37B536388' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_SaveCachedPose_037E41F941CE805D775BD89003CBC2FF) == 0x001348, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_SaveCachedPose_037E41F941CE805D775BD89003CBC2FF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_FFD1E89F4E6F7F7B8D759FBDF3ED6DF7) == 0x001420, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_FFD1E89F4E6F7F7B8D759FBDF3ED6DF7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_RotationOffsetBlendSpace_BCDA4BC04BEBDD7CDA5ED5BC3DD98340) == 0x001468, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_RotationOffsetBlendSpace_BCDA4BC04BEBDD7CDA5ED5BC3DD98340' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_BlendListByBool_BB43C7E440089A726B075F8DCE03A1FA) == 0x001648, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_BlendListByBool_BB43C7E440089A726B075F8DCE03A1FA' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_ModifyBone_4EBDC3044795E629C227799FF24CFD35) == 0x001718, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_ModifyBone_4EBDC3044795E629C227799FF24CFD35' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_LocalToComponentSpace_180276374F2AFBD0DA08778A9F209A6E) == 0x001850, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_LocalToComponentSpace_180276374F2AFBD0DA08778A9F209A6E' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_ComponentToLocalSpace_4B4F18D34235A1F9668A3EB3279C0FA7) == 0x001890, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_ComponentToLocalSpace_4B4F18D34235A1F9668A3EB3279C0FA7' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_747E481E4AA64BE3A6B8A8B4D399F365) == 0x0018D0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_747E481E4AA64BE3A6B8A8B4D399F365' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_ModifyBone_D42EE4CF48B79B115C8E5089FB7D3541) == 0x001918, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_ModifyBone_D42EE4CF48B79B115C8E5089FB7D3541' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_ComponentToLocalSpace_BC8D362D4F1D7E71BC1BBBB712B62143) == 0x001A50, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_ComponentToLocalSpace_BC8D362D4F1D7E71BC1BBBB712B62143' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_LocalToComponentSpace_B4A4911D450731F01B8FD6AD6B87EAA9) == 0x001A90, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_LocalToComponentSpace_B4A4911D450731F01B8FD6AD6B87EAA9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_BlendListByBool_69086D8F4CA55743F099CCA70011F128) == 0x001AD0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_BlendListByBool_69086D8F4CA55743F099CCA70011F128' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_A93523EA43706053120507949E0B5864) == 0x001BA0, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_A93523EA43706053120507949E0B5864' has a wrong offset!");
static_assert(offsetof(UAnimBP_Weapon_AAC_C, AnimGraphNode_UseCachedPose_065D5AE148549FFADAA8F4BD8013FB65) == 0x001BE8, "Member 'UAnimBP_Weapon_AAC_C::AnimGraphNode_UseCachedPose_065D5AE148549FFADAA8F4BD8013FB65' has a wrong offset!");

}

