#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_TPP

#include "Basic.hpp"


namespace SDK::Params
{

// Function AnimBP_TPP.AnimBP_TPP_C.ExecuteUbergraph_AnimBP_TPP
// 0x0008 (0x0008 - 0x0000)
struct AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP) == 0x000004, "Wrong alignment on AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP");
static_assert(sizeof(AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP) == 0x000008, "Wrong size on AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP");
static_assert(offsetof(AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP, EntryPoint) == 0x000000, "Member 'AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'AnimBP_TPP_C_ExecuteUbergraph_AnimBP_TPP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function AnimBP_TPP.AnimBP_TPP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_TPP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_TPP_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_TPP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_TPP_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_TPP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_TPP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

