#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_GunAy_New

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_GunAy_New.AnimBP_Wpn_GunAy_New_C
// 0x1380 (0x1790 - 0x0410)
class UAnimBP_Wpn_GunAy_New_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_179F09534A81B880637B9E8C5370F87D; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E26514044EC13659E7B03F890C51858C; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63EFBB8B4758906506B4B2A24647F6ED; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9F5A177F4CA24CC1A3541C904239D27F; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_226FEC15464BEC51CFD38B9CFED41A6C; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7CD924ED4BE8AC060D61E4957778828D; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A11536454343BA0DC3414789E64CFE41; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FF82E0A7488BEDB427120DA6852FAE43; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8346D3764103022E8AB06DAAD23DD19B; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C8D1CE554A98BD4487B6B097AF16C059; // 0x0698(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C75ACF8C48F37D2D7490B4AE01B95421; // 0x06E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_628DD13E4A13B2F3DB870B9EC431F368; // 0x0780(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_084DBB4B46915B5867A1C78B431485D4; // 0x07C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9AF442EB4FE6C50B6000B9A8254CF883; // 0x0860(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_84F14A07406BF1153E92B0BF6C2E0C21; // 0x08A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2ED7FEC14F88353B0CE0D28869CB30A2; // 0x0940(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A7A5D36D4C212C0DD3C6458840C658A1; // 0x0980(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_753985964B83529D7E22CEA14B1A2D0D; // 0x0A20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8088744D4FE7E09F1D3EEE9EEFC7AD17; // 0x0A60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70A8869B4D705EE42D9B2AAC37C24151; // 0x0B00(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_561B66F243B80F52E4E3429B8A74AD87; // 0x0B40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71B3108B4A16EE40BFDA3783426ABEAB; // 0x0BE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9530CED24A3CB360F69357BFCA98F18F; // 0x0C20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D1C2B91E453EF9E75CD345A56B5197C6; // 0x0CC0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_0698242B4DD10E7EECC1B1927A4FAF99; // 0x0D00(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A3C8F670418C46763374F7993BADFCCD; // 0x0DE0(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_FE306273492B0F84C4D95A93E499727A; // 0x0EB8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2DB5DF464256A19D19B10D9ACE40604A; // 0x0F88(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_940ACA344F13D4FCDC0CD08E57BB3A2F; // 0x1028(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D564A15E49013574531FE5B2DEBFDAA9; // 0x10C8(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6F4DE8364E0AC5F8ED663DA6EB3A98B4; // 0x1198(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E226FC6F4C5E6E4D3BBE00B05D98A2F2; // 0x1270(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3882977C4D808AE8F8C22EB44DDA6E5D; // 0x12B8(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7ED0598C46C70044E7C0F7BDD800FCE9; // 0x13F0(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D92640A34CC37B485789338B155CE8A2; // 0x1430(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7CD426874EE0B8135A44C2A3621B5B89; // 0x1470(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_C55D121A4E1CD55D3FA9BBA719B04EEF; // 0x14B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_940C11A14CBC0ECE030D6DB8878A0C5F; // 0x1588(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B4E44D9041599A141AF5AE9650AE9007; // 0x1628(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69124DBD45A3DBB6AAC29C9B5371A6AD; // 0x1700(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13B6F43240352EE0B6C96281FE885F92; // 0x1748(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_TransitionResult_9F5A177F4CA24CC1A3541C904239D27F();
	void ExecuteUbergraph_AnimBP_Wpn_GunAy_New(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_TransitionResult_226FEC15464BEC51CFD38B9CFED41A6C();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_TransitionResult_A11536454343BA0DC3414789E64CFE41();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_ModifyBone_3882977C4D808AE8F8C22EB44DDA6E5D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_BlendListByBool_D564A15E49013574531FE5B2DEBFDAA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_GunAy_New_AnimGraphNode_TransitionResult_E26514044EC13659E7B03F890C51858C();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_GunAy_New_C">();
	}
	static class UAnimBP_Wpn_GunAy_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_GunAy_New_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_GunAy_New_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_GunAy_New_C");
static_assert(sizeof(UAnimBP_Wpn_GunAy_New_C) == 0x001790, "Wrong size on UAnimBP_Wpn_GunAy_New_C");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_GunAy_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_Root_179F09534A81B880637B9E8C5370F87D) == 0x000418, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_Root_179F09534A81B880637B9E8C5370F87D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_E26514044EC13659E7B03F890C51858C) == 0x000458, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_E26514044EC13659E7B03F890C51858C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_63EFBB8B4758906506B4B2A24647F6ED) == 0x0004A0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_63EFBB8B4758906506B4B2A24647F6ED' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_9F5A177F4CA24CC1A3541C904239D27F) == 0x0004E8, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_9F5A177F4CA24CC1A3541C904239D27F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_226FEC15464BEC51CFD38B9CFED41A6C) == 0x000530, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_226FEC15464BEC51CFD38B9CFED41A6C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_7CD924ED4BE8AC060D61E4957778828D) == 0x000578, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_7CD924ED4BE8AC060D61E4957778828D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_A11536454343BA0DC3414789E64CFE41) == 0x0005C0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_A11536454343BA0DC3414789E64CFE41' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_FF82E0A7488BEDB427120DA6852FAE43) == 0x000608, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_FF82E0A7488BEDB427120DA6852FAE43' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_8346D3764103022E8AB06DAAD23DD19B) == 0x000650, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_8346D3764103022E8AB06DAAD23DD19B' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_TransitionResult_C8D1CE554A98BD4487B6B097AF16C059) == 0x000698, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_TransitionResult_C8D1CE554A98BD4487B6B097AF16C059' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_C75ACF8C48F37D2D7490B4AE01B95421) == 0x0006E0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_C75ACF8C48F37D2D7490B4AE01B95421' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_628DD13E4A13B2F3DB870B9EC431F368) == 0x000780, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_628DD13E4A13B2F3DB870B9EC431F368' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_084DBB4B46915B5867A1C78B431485D4) == 0x0007C0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_084DBB4B46915B5867A1C78B431485D4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_9AF442EB4FE6C50B6000B9A8254CF883) == 0x000860, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_9AF442EB4FE6C50B6000B9A8254CF883' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_84F14A07406BF1153E92B0BF6C2E0C21) == 0x0008A0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_84F14A07406BF1153E92B0BF6C2E0C21' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_2ED7FEC14F88353B0CE0D28869CB30A2) == 0x000940, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_2ED7FEC14F88353B0CE0D28869CB30A2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_A7A5D36D4C212C0DD3C6458840C658A1) == 0x000980, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_A7A5D36D4C212C0DD3C6458840C658A1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_753985964B83529D7E22CEA14B1A2D0D) == 0x000A20, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_753985964B83529D7E22CEA14B1A2D0D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_8088744D4FE7E09F1D3EEE9EEFC7AD17) == 0x000A60, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_8088744D4FE7E09F1D3EEE9EEFC7AD17' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_70A8869B4D705EE42D9B2AAC37C24151) == 0x000B00, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_70A8869B4D705EE42D9B2AAC37C24151' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_561B66F243B80F52E4E3429B8A74AD87) == 0x000B40, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_561B66F243B80F52E4E3429B8A74AD87' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_71B3108B4A16EE40BFDA3783426ABEAB) == 0x000BE0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_71B3108B4A16EE40BFDA3783426ABEAB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_9530CED24A3CB360F69357BFCA98F18F) == 0x000C20, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_9530CED24A3CB360F69357BFCA98F18F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateResult_D1C2B91E453EF9E75CD345A56B5197C6) == 0x000CC0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateResult_D1C2B91E453EF9E75CD345A56B5197C6' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_StateMachine_0698242B4DD10E7EECC1B1927A4FAF99) == 0x000D00, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_StateMachine_0698242B4DD10E7EECC1B1927A4FAF99' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_LayeredBoneBlend_A3C8F670418C46763374F7993BADFCCD) == 0x000DE0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_LayeredBoneBlend_A3C8F670418C46763374F7993BADFCCD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_BlendListByBool_FE306273492B0F84C4D95A93E499727A) == 0x000EB8, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_BlendListByBool_FE306273492B0F84C4D95A93E499727A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_2DB5DF464256A19D19B10D9ACE40604A) == 0x000F88, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_2DB5DF464256A19D19B10D9ACE40604A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_940ACA344F13D4FCDC0CD08E57BB3A2F) == 0x001028, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_940ACA344F13D4FCDC0CD08E57BB3A2F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_BlendListByBool_D564A15E49013574531FE5B2DEBFDAA9) == 0x0010C8, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_BlendListByBool_D564A15E49013574531FE5B2DEBFDAA9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SaveCachedPose_6F4DE8364E0AC5F8ED663DA6EB3A98B4) == 0x001198, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SaveCachedPose_6F4DE8364E0AC5F8ED663DA6EB3A98B4' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_UseCachedPose_E226FC6F4C5E6E4D3BBE00B05D98A2F2) == 0x001270, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_UseCachedPose_E226FC6F4C5E6E4D3BBE00B05D98A2F2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_ModifyBone_3882977C4D808AE8F8C22EB44DDA6E5D) == 0x0012B8, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_ModifyBone_3882977C4D808AE8F8C22EB44DDA6E5D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_LocalToComponentSpace_7ED0598C46C70044E7C0F7BDD800FCE9) == 0x0013F0, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_LocalToComponentSpace_7ED0598C46C70044E7C0F7BDD800FCE9' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_ComponentToLocalSpace_D92640A34CC37B485789338B155CE8A2) == 0x001430, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_ComponentToLocalSpace_D92640A34CC37B485789338B155CE8A2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_UseCachedPose_7CD426874EE0B8135A44C2A3621B5B89) == 0x001470, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_UseCachedPose_7CD426874EE0B8135A44C2A3621B5B89' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_BlendListByBool_C55D121A4E1CD55D3FA9BBA719B04EEF) == 0x0014B8, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_BlendListByBool_C55D121A4E1CD55D3FA9BBA719B04EEF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SequencePlayer_940C11A14CBC0ECE030D6DB8878A0C5F) == 0x001588, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SequencePlayer_940C11A14CBC0ECE030D6DB8878A0C5F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_SaveCachedPose_B4E44D9041599A141AF5AE9650AE9007) == 0x001628, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_SaveCachedPose_B4E44D9041599A141AF5AE9650AE9007' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_UseCachedPose_69124DBD45A3DBB6AAC29C9B5371A6AD) == 0x001700, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_UseCachedPose_69124DBD45A3DBB6AAC29C9B5371A6AD' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_GunAy_New_C, AnimGraphNode_UseCachedPose_13B6F43240352EE0B6C96281FE885F92) == 0x001748, "Member 'UAnimBP_Wpn_GunAy_New_C::AnimGraphNode_UseCachedPose_13B6F43240352EE0B6C96281FE885F92' has a wrong offset!");

}

