#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Wpn_wa2000_lv2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Wpn_wa2000_lv2.AnimBP_Wpn_wa2000_lv2_C
// 0x1820 (0x1C30 - 0x0410)
class UAnimBP_Wpn_wa2000_lv2_C final : public UWeaponAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_808ECC2541FBCE85857F96835EB5F359; // 0x0418(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CA2280284632AE147FDEC788D0930998; // 0x0458(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_974868D74CA9B6A8E9676BA4702057AF; // 0x04A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B5D884C14176D91AC168559562FEEF35; // 0x04E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F11BC1794CDD695E7F6147B326DD2973; // 0x0530(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D0024683475CEE88510294A1D6C0647A; // 0x0578(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3C89896E4C3870A44FA4D7983C7AB575; // 0x05C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F908E7054B19293D06AD0DB7EBC105BB; // 0x0608(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2E3DF13A47DF52F08B73FDA0213E749D; // 0x0650(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_296CCF984339A6E41FA44D8B8460EA98; // 0x0698(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_972272664C31402415AB3292615246D1; // 0x06E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3A7086B545E00324036FCB943812C526; // 0x0728(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_94C1E9FB41905ECB6B44B1815A301DCF; // 0x07C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_801CB84643B825208806E6808F08C38D; // 0x0808(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_06E16E924B984399DE8AB4BB6B56CF00; // 0x08A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1CEE3A2B4792C582EE3D5DB8083905A2; // 0x08E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A91E63324C2053665028C1B1F51B470C; // 0x0988(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_09D658044B1106CDF22CCF9C526BB9FC; // 0x09C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7F1880E94622559FC2E30DBED23F82D2; // 0x0A68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46DEB9EC4FE9870698D7B29DA37C3713; // 0x0AA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F5BC16094ACF076CE1D4CAB1D1B4746F; // 0x0B48(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6272843540E6CED9F075DBB026C1B466; // 0x0B88(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2380A89E485DF429FB57808DADCB68E1; // 0x0C28(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BD994E674638CC7B600902BEB3B98B89; // 0x0C68(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_951B4D2A4B6FD13565EAB1BBB75419CF; // 0x0D08(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5C4B11B54D73A9242D5065810B21A3A5; // 0x0D48(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_544C53F24083266F382E32A3C083485C; // 0x0E28(0x00D8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_BAEA096A4145D62BFC0F7B93812FF9DE; // 0x0F00(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3C7026B0403B877EAA790BB4872FEA30; // 0x0FD0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_437045BF43BE6C9B2D4991956FAA73E8; // 0x1070(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5270E3524210F62E718B0F8486F2706D; // 0x1110(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2F8C8A474AB468C723D87D90F17D7150; // 0x11E0(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B13700444CE6FD61A1C4BFB87FB892AF; // 0x12B8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3B42F69149E9E6AA36BD06BF640A31E8; // 0x1300(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12A1052B40D5E456E492A7BEDCCB5002; // 0x1348(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37E6C1DC44C5AAF5BFF06CB506B4901A; // 0x1420(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_0461841A4FCA33C94A42A19E1BFBD207; // 0x1468(0x01E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_F2CFC912448960C2692E47B6742C591F; // 0x1648(0x00D0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6D992AFE48F99C64372AA98A94BA4141; // 0x1718(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_BC888A0D42BE06FB84E8EFB7868F6A51; // 0x1850(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F7584E9F42ED955320F7D7BCAF83D749; // 0x1890(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EB1ED405436749EF03FC9EB70D346DC2; // 0x18D0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15476CCD41AB7FB86D695B8C4461E7A1; // 0x1918(0x0138)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_49E772CE40CFFE071DA6C6AEDE76AC67; // 0x1A50(0x0040)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_241BD59B44316A50BE3D14AF03B7C338; // 0x1A90(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_FFD8A2274D237E04AA9AF7840B47EED1; // 0x1AD0(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6FD06B2F44062EEEF8F914BE2F7D9990; // 0x1BA0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63F8DCD8435DEBC5152067B4626EB186; // 0x1BE8(0x0048)()

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_TransitionResult_F908E7054B19293D06AD0DB7EBC105BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_TransitionResult_F11BC1794CDD695E7F6147B326DD2973();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_BlendListByBool_FFD8A2274D237E04AA9AF7840B47EED1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_ModifyBone_6D992AFE48F99C64372AA98A94BA4141();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_RotationOffsetBlendSpace_0461841A4FCA33C94A42A19E1BFBD207();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_BlendListByBool_5270E3524210F62E718B0F8486F2706D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_SequencePlayer_46DEB9EC4FE9870698D7B29DA37C3713();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_TransitionResult_B5D884C14176D91AC168559562FEEF35();
	void ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_SetDelay();
	void AnimNotify_StartReload();
	void AnimNotify_ReloadFinished();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Wpn_wa2000_lv2_AnimGraphNode_TransitionResult_CA2280284632AE147FDEC788D0930998();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Wpn_wa2000_lv2_C">();
	}
	static class UAnimBP_Wpn_wa2000_lv2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Wpn_wa2000_lv2_C>();
	}
};
static_assert(alignof(UAnimBP_Wpn_wa2000_lv2_C) == 0x000008, "Wrong alignment on UAnimBP_Wpn_wa2000_lv2_C");
static_assert(sizeof(UAnimBP_Wpn_wa2000_lv2_C) == 0x001C30, "Wrong size on UAnimBP_Wpn_wa2000_lv2_C");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, UberGraphFrame) == 0x000410, "Member 'UAnimBP_Wpn_wa2000_lv2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_Root_808ECC2541FBCE85857F96835EB5F359) == 0x000418, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_Root_808ECC2541FBCE85857F96835EB5F359' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_CA2280284632AE147FDEC788D0930998) == 0x000458, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_CA2280284632AE147FDEC788D0930998' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_974868D74CA9B6A8E9676BA4702057AF) == 0x0004A0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_974868D74CA9B6A8E9676BA4702057AF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_B5D884C14176D91AC168559562FEEF35) == 0x0004E8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_B5D884C14176D91AC168559562FEEF35' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_F11BC1794CDD695E7F6147B326DD2973) == 0x000530, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_F11BC1794CDD695E7F6147B326DD2973' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_D0024683475CEE88510294A1D6C0647A) == 0x000578, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_D0024683475CEE88510294A1D6C0647A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_3C89896E4C3870A44FA4D7983C7AB575) == 0x0005C0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_3C89896E4C3870A44FA4D7983C7AB575' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_F908E7054B19293D06AD0DB7EBC105BB) == 0x000608, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_F908E7054B19293D06AD0DB7EBC105BB' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_2E3DF13A47DF52F08B73FDA0213E749D) == 0x000650, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_2E3DF13A47DF52F08B73FDA0213E749D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_296CCF984339A6E41FA44D8B8460EA98) == 0x000698, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_296CCF984339A6E41FA44D8B8460EA98' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_TransitionResult_972272664C31402415AB3292615246D1) == 0x0006E0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_TransitionResult_972272664C31402415AB3292615246D1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_3A7086B545E00324036FCB943812C526) == 0x000728, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_3A7086B545E00324036FCB943812C526' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_94C1E9FB41905ECB6B44B1815A301DCF) == 0x0007C8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_94C1E9FB41905ECB6B44B1815A301DCF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_801CB84643B825208806E6808F08C38D) == 0x000808, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_801CB84643B825208806E6808F08C38D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_06E16E924B984399DE8AB4BB6B56CF00) == 0x0008A8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_06E16E924B984399DE8AB4BB6B56CF00' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_1CEE3A2B4792C582EE3D5DB8083905A2) == 0x0008E8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_1CEE3A2B4792C582EE3D5DB8083905A2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_A91E63324C2053665028C1B1F51B470C) == 0x000988, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_A91E63324C2053665028C1B1F51B470C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_09D658044B1106CDF22CCF9C526BB9FC) == 0x0009C8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_09D658044B1106CDF22CCF9C526BB9FC' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_7F1880E94622559FC2E30DBED23F82D2) == 0x000A68, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_7F1880E94622559FC2E30DBED23F82D2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_46DEB9EC4FE9870698D7B29DA37C3713) == 0x000AA8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_46DEB9EC4FE9870698D7B29DA37C3713' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_F5BC16094ACF076CE1D4CAB1D1B4746F) == 0x000B48, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_F5BC16094ACF076CE1D4CAB1D1B4746F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_6272843540E6CED9F075DBB026C1B466) == 0x000B88, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_6272843540E6CED9F075DBB026C1B466' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_2380A89E485DF429FB57808DADCB68E1) == 0x000C28, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_2380A89E485DF429FB57808DADCB68E1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_BD994E674638CC7B600902BEB3B98B89) == 0x000C68, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_BD994E674638CC7B600902BEB3B98B89' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateResult_951B4D2A4B6FD13565EAB1BBB75419CF) == 0x000D08, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateResult_951B4D2A4B6FD13565EAB1BBB75419CF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_StateMachine_5C4B11B54D73A9242D5065810B21A3A5) == 0x000D48, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_StateMachine_5C4B11B54D73A9242D5065810B21A3A5' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_LayeredBoneBlend_544C53F24083266F382E32A3C083485C) == 0x000E28, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_LayeredBoneBlend_544C53F24083266F382E32A3C083485C' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_BlendListByBool_BAEA096A4145D62BFC0F7B93812FF9DE) == 0x000F00, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_BlendListByBool_BAEA096A4145D62BFC0F7B93812FF9DE' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_3C7026B0403B877EAA790BB4872FEA30) == 0x000FD0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_3C7026B0403B877EAA790BB4872FEA30' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SequencePlayer_437045BF43BE6C9B2D4991956FAA73E8) == 0x001070, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SequencePlayer_437045BF43BE6C9B2D4991956FAA73E8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_BlendListByBool_5270E3524210F62E718B0F8486F2706D) == 0x001110, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_BlendListByBool_5270E3524210F62E718B0F8486F2706D' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SaveCachedPose_2F8C8A474AB468C723D87D90F17D7150) == 0x0011E0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SaveCachedPose_2F8C8A474AB468C723D87D90F17D7150' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_B13700444CE6FD61A1C4BFB87FB892AF) == 0x0012B8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_B13700444CE6FD61A1C4BFB87FB892AF' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_3B42F69149E9E6AA36BD06BF640A31E8) == 0x001300, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_3B42F69149E9E6AA36BD06BF640A31E8' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_SaveCachedPose_12A1052B40D5E456E492A7BEDCCB5002) == 0x001348, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_SaveCachedPose_12A1052B40D5E456E492A7BEDCCB5002' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_37E6C1DC44C5AAF5BFF06CB506B4901A) == 0x001420, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_37E6C1DC44C5AAF5BFF06CB506B4901A' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_RotationOffsetBlendSpace_0461841A4FCA33C94A42A19E1BFBD207) == 0x001468, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_RotationOffsetBlendSpace_0461841A4FCA33C94A42A19E1BFBD207' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_BlendListByBool_F2CFC912448960C2692E47B6742C591F) == 0x001648, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_BlendListByBool_F2CFC912448960C2692E47B6742C591F' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_ModifyBone_6D992AFE48F99C64372AA98A94BA4141) == 0x001718, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_ModifyBone_6D992AFE48F99C64372AA98A94BA4141' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_LocalToComponentSpace_BC888A0D42BE06FB84E8EFB7868F6A51) == 0x001850, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_LocalToComponentSpace_BC888A0D42BE06FB84E8EFB7868F6A51' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_ComponentToLocalSpace_F7584E9F42ED955320F7D7BCAF83D749) == 0x001890, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_ComponentToLocalSpace_F7584E9F42ED955320F7D7BCAF83D749' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_EB1ED405436749EF03FC9EB70D346DC2) == 0x0018D0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_EB1ED405436749EF03FC9EB70D346DC2' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_ModifyBone_15476CCD41AB7FB86D695B8C4461E7A1) == 0x001918, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_ModifyBone_15476CCD41AB7FB86D695B8C4461E7A1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_ComponentToLocalSpace_49E772CE40CFFE071DA6C6AEDE76AC67) == 0x001A50, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_ComponentToLocalSpace_49E772CE40CFFE071DA6C6AEDE76AC67' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_LocalToComponentSpace_241BD59B44316A50BE3D14AF03B7C338) == 0x001A90, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_LocalToComponentSpace_241BD59B44316A50BE3D14AF03B7C338' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_BlendListByBool_FFD8A2274D237E04AA9AF7840B47EED1) == 0x001AD0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_BlendListByBool_FFD8A2274D237E04AA9AF7840B47EED1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_6FD06B2F44062EEEF8F914BE2F7D9990) == 0x001BA0, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_6FD06B2F44062EEEF8F914BE2F7D9990' has a wrong offset!");
static_assert(offsetof(UAnimBP_Wpn_wa2000_lv2_C, AnimGraphNode_UseCachedPose_63F8DCD8435DEBC5152067B4626EB186) == 0x001BE8, "Member 'UAnimBP_Wpn_wa2000_lv2_C::AnimGraphNode_UseCachedPose_63F8DCD8435DEBC5152067B4626EB186' has a wrong offset!");

}

