#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lv3_Jumper

#include "Basic.hpp"

#include "BE_Lv3_ClimberJumpDir_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Lv3_Jumper.AnimBP_Lv3_Jumper_C
// 0x2408 (0x2760 - 0x0358)
class UAnimBP_Lv3_Jumper_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_840BDEFF4B3878D4CBA32282E785A398; // 0x0370(0x0240)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_009BBA81438E1F477401738E0D9F2D25; // 0x05B0(0x0040)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_0D674327406B5473719668B4449C8887; // 0x05F0(0x0240)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_722CC87347A4A7BD8C2B3B91456F470B; // 0x0830(0x0040)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8D6F60714D327A8FEADFC4AB81724083; // 0x0870(0x0138)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15433F3B43A93E6C1E7F06810BC5A75B; // 0x09A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ACFC057C46E8DD50D03DE69A89C882FD; // 0x09F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D4C1A48C4E800D37935832B68071A35E; // 0x0A38(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2D36C9B9405CBB7367728DA5E5EDE435; // 0x0A80(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7F035227408A08E0D0A474823C9CC6EB; // 0x0AC8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_496D9B344DD3AD60527364AE6D392115; // 0x0B10(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ED8562E7454E4743DAA8F7ACE433B7C5; // 0x0B58(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_096BBC6E4D404DFB0CAD73A7F1A617D0; // 0x0BA0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E9614F564E81A5A6FC2F5A8AEF694042; // 0x0BE8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AF5E5319412797A9084D8B9E76C8C48A; // 0x0C30(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6B65DD814AB3699BECF37890B9E429AE; // 0x0C78(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6736AF7B49D80CDF5B220E8FCF310321; // 0x0CC0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AC71FAC04C3D0E44FE9C878B651D688F; // 0x0D08(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16BE7F014B1644BB7842F892CB791911; // 0x0D50(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_367EBBDD4BF06E6890B5668B8C4BB3A9; // 0x0D98(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_408130FF4EEF2D942C0394BF24FCFDFF; // 0x0DE0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CE24018645BD003C3D5A90A0FDAF0C48; // 0x0E28(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C8F189D249C365030C065A8E8BE3F0F9; // 0x0E70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F41515174EA9A336FB46559593741708; // 0x0EB8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5B79BE064194BC0BFF83A28325B5A84B; // 0x0F00(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6C70CB3246CCCAF2008DC493A66C38A0; // 0x0F48(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FED618C74148DB0C233EFB9D0B030299; // 0x0F90(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_414A2FEE4F3185A25B4071B7989615D7; // 0x0FD8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20D859034A4C34766438CFB018E3E465; // 0x1020(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AB5A41D40A670F21ADC3ABDD46039AB; // 0x1068(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68FE26B34E03AF6F08DA57883ADC5ADB; // 0x1108(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4BFEBDEE4D6F050D4745C995801B8D27; // 0x1148(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7F44F1704DE4397B281F82B9E2280B5B; // 0x11E8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15FA63BA402B9174787C3D9B3B295161; // 0x1228(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2B8CD84A426C099038E52286BF5657E3; // 0x12C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1551ED064A23E586E609839BB1001D5B; // 0x1308(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E39B84834FDC7BD1D9D7E09337B45553; // 0x13A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7019F16643C2AB2A26541391FCE60C55; // 0x13E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B3AA5DFE416A1ABA81ADECBB61CA817C; // 0x1488(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1180702542A18526E540C086850EA801; // 0x14C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8A6722234D63D8115ADC1FB5FD8A434C; // 0x1568(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B886C76A4AB24F76F44AC8883E2375F7; // 0x15A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47C6FFB74CBAB6397A243E84D8C621FD; // 0x1648(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1894496142E1705B189D66A7CBA97B25; // 0x1688(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96BD8E894B77A90228AD7A940CC076FB; // 0x1728(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DCE2DFD54942643AF2654FB6F9D9D4A1; // 0x1768(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B99D67C146C374B08EC5BCAEC9AEF3F8; // 0x1808(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_854D3BEB4AE31335854A2FB33C86DF92; // 0x1848(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_583366B149D6C9E174FCAD8B8A9C9F4B; // 0x18E8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_302E85C94C022E774C6EEBA0A2355F25; // 0x1928(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2969DD2942838AA4AE2D3A80E1F58BB4; // 0x19C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BF9E45834DC5711165EC87950B31D9DB; // 0x1A08(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CFD468F04DB96E939BFD0284187D3DC6; // 0x1AA8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A28727524E82BFC4774A7E8B2EE4BB20; // 0x1AE8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0A94F0EC4E6602C9C4F198997D3972C5; // 0x1B88(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_09938F204BA15CD0C1AF48BA49A2D9BC; // 0x1BC8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C7F696B84A9176AD9C531F91EE663F44; // 0x1C68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3277B29642A20EB078C05DAAAE356EFF; // 0x1CA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FAD0B96A4240ECA7E6AA599F3D085482; // 0x1D48(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D20862B746F2797C3571E981B361181B; // 0x1D88(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9D7E82844C2F2A5A40B51AB86568BCE3; // 0x1E28(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_656133D1418F1BA7D6B2C3A912FB0F20; // 0x1E68(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F11A560A4A3FA0DB52A892860D2377D7; // 0x1F08(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58B65F334C785FC3C2CBB29EC4E917FA; // 0x1F48(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FA279F8F47912BD2AD276E99D77E25A3; // 0x1FE8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33DC1D444FD518EEA05887A0D1825753; // 0x2028(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BCEFDA3B41D5040FCEDBABAECB055E58; // 0x20C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_741C0F754C13E594D97E2D9DF221E226; // 0x2108(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53BB94244A1B1559F7DE1ABA15284C2E; // 0x21A8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_229CE3B44A2D204BD114E5BEEF738502; // 0x21E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AEA6AD854A2CA44375ADBF8845E63395; // 0x2288(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CDBA61CC4F84D6A7E4D24BBEAAD254E2; // 0x22C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D1D777F340EC69879AE2F28AA60E1058; // 0x2368(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B07A27146613AAA1F6FB181B6D4296A; // 0x23A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A7A003EE4F852BB99A5FAA8B53FA5ADC; // 0x2448(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4C80FB0341902A9DC7C25AA1749BDACD; // 0x2488(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4C816FEA4BCB0E48CAA734B3D3E05C22; // 0x25B0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_96605F5646CF94EC90C52E9050FF70D7; // 0x25F0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_D40243A24B462BB83A170FA10AD25717; // 0x26D0(0x0040)()
	bool                                          Jump;                                              // 0x2710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Attack;                                            // 0x2711(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Arrived;                                           // 0x2712(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2713[0x1];                                     // 0x2713(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimZ;                                             // 0x2714(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv3_ClimberJumpDir                        Direction;                                         // 0x2718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2719[0x3];                                     // 0x2719(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HandRLocation;                                     // 0x271C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandRWidget;                                       // 0x2728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HandLWidget;                                       // 0x272C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HandLLocation;                                     // 0x2730(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BackJoint;                                         // 0x273C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxWidget;                                         // 0x2748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274C[0x4];                                     // 0x274C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDoAttack;                                        // 0x2750(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_C8F189D249C365030C065A8E8BE3F0F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_414A2FEE4F3185A25B4071B7989615D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_FED618C74148DB0C233EFB9D0B030299();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_6C70CB3246CCCAF2008DC493A66C38A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_5B79BE064194BC0BFF83A28325B5A84B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lv3_Jumper_AnimGraphNode_TransitionResult_E9614F564E81A5A6FC2F5A8AEF694042();
