#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_EnemyRiot_RootMotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C
// 0x1488 (0x17E0 - 0x0358)
class UAnimBP_EnemyRiot_RootMotion_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4F2A574142F6891C79F6D3BCB8E42A97; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_531E470543B693658F4E2EBA946A42FA; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_560FEB754DFED09B25E449B01532E28C; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB604A624D60D13E562DD780666A8268; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26413C3B477FD684B5A94BAB74EC03B1; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D40AAA304A1E65512502F7A90B1A27F3; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F4AC50C8456F2F412CF16E8069F188E9; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E56EE06246261EE5453E3F99EB40A141; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C59CE6EA4920A19D14CCE19E328BFF0E; // 0x05A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3D428FFD44EAA54E32E788A377AAECD9; // 0x05E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DB4E520A455932CE1A760CBE3C06358D; // 0x0630(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8B99960D479FA7333E01AFB3279A21DF; // 0x0678(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0DDDDBDC4C35743FBD9CD8BDBD7A3628; // 0x06C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C974421342B701F9DBC91A8A8AD745AA; // 0x0708(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5CE3DA1344C0962747F09DA02FCB50D6; // 0x07A8(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A25B71EE4F8E905C7D238DA1D68E3AEC; // 0x07E8(0x0128)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_835BB1B84A6EFA17218662A9F51D80FA; // 0x0910(0x0128)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_74AC065F43EDF68245F0F9AC31DC4753; // 0x0A38(0x00D8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7D853E9741329B0B7C93DE9322BEF3D5; // 0x0B10(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7DBD45354DAF1DA08CC01189A893AE9D; // 0x0B50(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2803CB3B4159C20B4AA6C980FDB829F5; // 0x0C78(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_D9EF8AED4B4626AE1434AB9F2CB4DAAC; // 0x0CB8(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77ECA1B54D7D184B9C9D5D9AD7B54A81; // 0x0DE0(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B7959AEC4EEC86E9BAA63EB3F3B45A03; // 0x0E20(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D5FE84A0404953FEE1D55B8ACA1E3E19; // 0x0F48(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_76F1566B4E187DC0B2D4C795A1841C09; // 0x0F88(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_05D17A7442287853AECC6B8B8ADA4996; // 0x10B0(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4F72A6DC40D1F1F73AE93AB4DE779A14; // 0x10F0(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5F267D3440D9949D297779A9E1BE6E52; // 0x1218(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10721A3B4E93D1864CA3E2A43EBA15F3; // 0x1258(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A792A3F84BB12B876C9DA8978F14E35B; // 0x1380(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C78AD3FE42F856AF5D252094C56BA958; // 0x13C0(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6EF2A35843D1DBD8730CE2A67E299C1C; // 0x14A0(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1D97C1784C51A224025275BE0A594B85; // 0x1578(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_C5D955364209CCC3FAC8B28244C654F3; // 0x15C0(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2715E4724597376EC502C0A9FDB0BB38; // 0x1698(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_76528F3E447AA848EB5BAC9EE0C8B106; // 0x16E0(0x0068)()
	bool                                          isShoot;                                           // 0x1748(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMoving;                                          // 0x1749(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isLockTarget;                                      // 0x174A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_174B[0x1];                                     // 0x174B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         moveStartDirection;                                // 0x174C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         currentDirection;                                  // 0x1750(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         currentSpeed;                                      // 0x1754(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isRightLegUp;                                      // 0x1758(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimPitch;                                          // 0x175C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         aimDirection;                                      // 0x1760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         strafeDirection;                                   // 0x1764(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AimRoll;                                           // 0x1768(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightEffectorLoc;                                  // 0x176C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftEffectorLoc;                                   // 0x1770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightJointLoc;                                     // 0x1774(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LeftJointLoc;                                      // 0x1780(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LeftFootRotation;                                  // 0x178C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RightFootRotation;                                 // 0x1798(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         HipsOffset;                                        // 0x17A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             OwnerChar;                                         // 0x17A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      OwnerCapsule;                                      // 0x17B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x17B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IKAdjustOffset;                                    // 0x17BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IKCapsuleHalfHeight;                               // 0x17C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IKTraceDistance;                                   // 0x17C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IKBlendSpeed;                                      // 0x17C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUseBoxTrace;                                     // 0x17CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStrafeStop;                                      // 0x17CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isChargeingEnd;                                    // 0x17CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          isFireEnd;                                         // 0x17CF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UBlendSpaceBase*                        NewVar_0;                                          // 0x17D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInIdle;                                          // 0x17D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_F4AC50C8456F2F412CF16E8069F188E9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_DB4E520A455932CE1A760CBE3C06358D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_3D428FFD44EAA54E32E788A377AAECD9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_C59CE6EA4920A19D14CCE19E328BFF0E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_E56EE06246261EE5453E3F99EB40A141();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion_AnimGraphNode_TransitionResult_D40AAA304A1E65512502F7A90B1A27F3();
