#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_EnemyRiot_RootMotion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C.ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion
// 0x0068 (0x0068 - 0x0000)
struct AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue2;       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue3;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue4;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue5;       // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue6;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue3;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue4;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue7;       // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion) == 0x000008, "Wrong alignment on AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion");
static_assert(sizeof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion) == 0x000068, "Wrong size on AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, EntryPoint) == 0x000000, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000004, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00000A, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue1) == 0x00000B, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1) == 0x000010, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Less_FloatFloat_ReturnValue1) == 0x000015, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2) == 0x000018, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Less_FloatFloat_ReturnValue2) == 0x00001C, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue1) == 0x00001D, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue1) == 0x00001E, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue2) == 0x00001F, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue3) == 0x000020, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanOR_ReturnValue1) == 0x000021, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue2) == 0x000022, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue2) == 0x000023, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue3) == 0x000024, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue4) == 0x000025, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue4) == 0x000026, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue5) == 0x000027, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue6) == 0x000028, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue3) == 0x000029, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanOR_ReturnValue2) == 0x00002A, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue5) == 0x00002B, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x00002C, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3) == 0x000030, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Less_FloatFloat_ReturnValue3) == 0x000034, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Less_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4) == 0x000038, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Less_FloatFloat_ReturnValue4) == 0x00003C, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Less_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanOR_ReturnValue3) == 0x00003D, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_EqualEqual_FloatFloat_ReturnValue7) == 0x00003E, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_EqualEqual_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanOR_ReturnValue4) == 0x00003F, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue4) == 0x000041, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue6) == 0x000042, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000043, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, K2Node_Event_DeltaTimeX) == 0x000044, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000048, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, K2Node_DynamicCast_AsCharacter) == 0x000058, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue5) == 0x000061, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_Not_PreBool_ReturnValue6) == 0x000062, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_Not_PreBool_ReturnValue6' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_BooleanAND_ReturnValue7) == 0x000063, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_BooleanAND_ReturnValue7' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000064, "Member 'AnimBP_EnemyRiot_RootMotion_C_ExecuteUbergraph_AnimBP_EnemyRiot_RootMotion::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");

// Function AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_EnemyRiot_RootMotion_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C.IKFootTrace
// 0x0318 (0x0318 - 0x0000)
struct AnimBP_EnemyRiot_RootMotion_C_IKFootTrace final
{
public:
	float                                         TraceDistance;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SocketName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidHit;                                          // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Socket;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0038(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable1;                             // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_BoxTraceSingleForObjects_OutHit;          // 0x0158(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingleForObjects_ReturnValue;     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E3[0x1];                                      // 0x01E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_272[0x2];                                      // 0x0272(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue1;       // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue1;                       // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue4;         // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue1;                 // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace) == 0x000008, "Wrong alignment on AnimBP_EnemyRiot_RootMotion_C_IKFootTrace");
static_assert(sizeof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace) == 0x000318, "Wrong size on AnimBP_EnemyRiot_RootMotion_C_IKFootTrace");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, TraceDistance) == 0x000000, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::TraceDistance' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, SocketName) == 0x000008, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::SocketName' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, Offset) == 0x000010, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::Offset' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, ImpactNormal) == 0x000014, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::ImpactNormal' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, ValidHit) == 0x000020, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::ValidHit' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, Socket) == 0x000028, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::Socket' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, Distance) == 0x000030, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::Distance' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, Temp_object_Variable) == 0x000038, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_GetSocketLocation_ReturnValue) == 0x00004C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_X) == 0x000058, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_Y) == 0x00005C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_Z) == 0x000060, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_X1) == 0x000070, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_Y1) == 0x000074, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakVector_Z1) == 0x000078, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, K2Node_MakeArray_Array) == 0x000080, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, Temp_object_Variable1) == 0x000090, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000A0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x0000A8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0000AC, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_MakeVector_ReturnValue) == 0x0000B0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_MakeVector_ReturnValue1) == 0x0000BC, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_LineTraceSingle_OutHit) == 0x0000C8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_LineTraceSingle_ReturnValue) == 0x000150, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BoxTraceSingleForObjects_OutHit) == 0x000158, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BoxTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BoxTraceSingleForObjects_ReturnValue) == 0x0001E0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BoxTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_bBlockingHit) == 0x0001E1, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001E2, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Time) == 0x0001E4, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Distance) == 0x0001E8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Location) == 0x0001EC, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_ImpactPoint) == 0x0001F8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Normal) == 0x000204, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_ImpactNormal) == 0x000210, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_PhysMat) == 0x000220, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitActor) == 0x000228, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitComponent) == 0x000230, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitBoneName) == 0x000238, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitItem) == 0x000240, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_FaceIndex) == 0x000244, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_TraceStart) == 0x000248, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_TraceEnd) == 0x000254, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000260, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_VSize_ReturnValue) == 0x00026C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_bBlockingHit1) == 0x000270, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_bInitialOverlap1) == 0x000271, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Time1) == 0x000274, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Distance1) == 0x000278, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Location1) == 0x00027C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_ImpactPoint1) == 0x000288, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_Normal1) == 0x000294, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_ImpactNormal1) == 0x0002A0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_PhysMat1) == 0x0002B0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitActor1) == 0x0002B8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitComponent1) == 0x0002C0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitBoneName1) == 0x0002C8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_HitItem1) == 0x0002D0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_FaceIndex1) == 0x0002D4, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_TraceStart1) == 0x0002D8, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_BreakHitResult_TraceEnd1) == 0x0002E4, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x0002F0, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_VectorVector_ReturnValue1) == 0x0002F4, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_VectorVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Add_FloatFloat_ReturnValue) == 0x000300, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_VSize_ReturnValue1) == 0x000304, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_VSize_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_SelectFloat_ReturnValue) == 0x000308, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Subtract_FloatFloat_ReturnValue4) == 0x00030C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Subtract_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000310, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKFootTrace, CallFunc_SelectFloat_ReturnValue1) == 0x000314, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKFootTrace::CallFunc_SelectFloat_ReturnValue1' has a wrong offset!");

// Function AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C.IKReset
// 0x0024 (0x0024 - 0x0000)
struct AnimBP_EnemyRiot_RootMotion_C_IKReset final
{
public:
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue1;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue2;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_EnemyRiot_RootMotion_C_IKReset) == 0x000004, "Wrong alignment on AnimBP_EnemyRiot_RootMotion_C_IKReset");
static_assert(sizeof(AnimBP_EnemyRiot_RootMotion_C_IKReset) == 0x000024, "Wrong size on AnimBP_EnemyRiot_RootMotion_C_IKReset");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKReset, CallFunc_FInterpTo_ReturnValue) == 0x000000, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKReset::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKReset, CallFunc_RInterpTo_ReturnValue) == 0x000004, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKReset::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKReset, CallFunc_RInterpTo_ReturnValue1) == 0x000010, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKReset::CallFunc_RInterpTo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKReset, CallFunc_FInterpTo_ReturnValue1) == 0x00001C, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKReset::CallFunc_FInterpTo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_EnemyRiot_RootMotion_C_IKReset, CallFunc_FInterpTo_ReturnValue2) == 0x000020, "Member 'AnimBP_EnemyRiot_RootMotion_C_IKReset::CallFunc_FInterpTo_ReturnValue2' has a wrong offset!");

// Function AnimBP_EnemyRiot_RootMotion.AnimBP_EnemyRiot_RootMotion_C.IKUpdate
// 0x008C (0x008C - 0x0000)
struct AnimBP_EnemyRiot_RootMotion_C_IKUpdate final
{
public:
	float                                         RightFootOffSet;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftFootOffSet;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalHipsOffset;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue1;      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
