#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_new_EnemyPlunger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_new_EnemyPlunger.AnimBP_new_EnemyPlunger_C.ExecuteUbergraph_AnimBP_new_EnemyPlunger
// 0x0118 (0x0118 - 0x0000)
struct AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BehaviorComponent_C*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BehaviorComponent_C*>        CallFunc_GetComponentsByClass_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_BehaviorComponent_C*                CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_BehaviorType                             CallFunc_GetCurrentBehaviorType_CurrentBehaviorType; // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentAttackTarget_TargetRef;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateDirection_ReturnValue1;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger) == 0x000008, "Wrong alignment on AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger");
static_assert(sizeof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger) == 0x000118, "Wrong size on AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, EntryPoint) == 0x000000, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_TryGetPawnOwner_ReturnValue1) == 0x000020, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_TryGetPawnOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetVelocity_ReturnValue) == 0x000028, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_VSize_ReturnValue) == 0x000040, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000044, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_CalculateDirection_ReturnValue) == 0x000054, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetMovementComponent_ReturnValue) == 0x000058, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsCrouching_ReturnValue) == 0x000060, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsFalling_ReturnValue) == 0x000061, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsValid_ReturnValue) == 0x000062, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetComponentsByClass_ReturnValue) == 0x000068, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Array_Get_Item) == 0x000078, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Greater_IntInt_ReturnValue) == 0x000084, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetCurrentBehaviorType_CurrentBehaviorType) == 0x000085, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetCurrentBehaviorType_CurrentBehaviorType' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetCurrentAttackTarget_TargetRef) == 0x000088, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetCurrentAttackTarget_TargetRef' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000090, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsValid_ReturnValue1) == 0x00009C, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A0, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_BreakVector_X) == 0x0000AC, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_BreakVector_Z) == 0x0000B4, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsValid_ReturnValue2) == 0x0000B8, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_SelectVector_ReturnValue) == 0x0000C8, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_IsValid_ReturnValue3) == 0x0000D4, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_CalculateDirection_ReturnValue1) == 0x0000D8, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_CalculateDirection_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, K2Node_Event_DeltaTimeX) == 0x0000DC, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Abs_ReturnValue) == 0x0000E0, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, Temp_bool_Variable) == 0x0000E4, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0000E5, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_BooleanAND_ReturnValue) == 0x0000E6, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000E7, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000E8, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000EC, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F0, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_Lerp_ReturnValue) == 0x0000F4, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, K2Node_Select_Default) == 0x0000F8, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_GetGameInstance_ReturnValue) == 0x000100, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000108, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000111, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger, CallFunc_BooleanAND_ReturnValue1) == 0x000112, "Member 'AnimBP_new_EnemyPlunger_C_ExecuteUbergraph_AnimBP_new_EnemyPlunger::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function AnimBP_new_EnemyPlunger.AnimBP_new_EnemyPlunger_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_new_EnemyPlunger_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

