#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AICover

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AICover.BP_AICover_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AICover_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(BP_AICover_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_AICover_C_UserConstructionScript");
static_assert(sizeof(BP_AICover_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_AICover_C_UserConstructionScript");
static_assert(offsetof(BP_AICover_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000000, "Member 'BP_AICover_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_AICover_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'BP_AICover_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AICover_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'BP_AICover_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

