#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIC

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function BP_AIC.BP_AIC_C.ExecuteUbergraph_BP_AIC
// 0x00F0 (0x00F0 - 0x0000)
struct BP_AIC_C_ExecuteUbergraph_BP_AIC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x0010(0x0048)(NoDestructor)
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BehaviorComponent_C*>        CallFunc_GetComponentsByClass_ReturnValue;         // 0x0060(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_BehaviorComponent_C*                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_UnpossessedPawn;                      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAIStimulus                            CallFunc_Array_Get_Item1;                          // 0x0098(0x0048)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_C_ExecuteUbergraph_BP_AIC) == 0x000008, "Wrong alignment on BP_AIC_C_ExecuteUbergraph_BP_AIC");
static_assert(sizeof(BP_AIC_C_ExecuteUbergraph_BP_AIC) == 0x0000F0, "Wrong size on BP_AIC_C_ExecuteUbergraph_BP_AIC");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, EntryPoint) == 0x000000, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, K2Node_ComponentBoundEvent_Actor) == 0x000008, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::K2Node_ComponentBoundEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, K2Node_ComponentBoundEvent_Stimulus) == 0x000010, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::K2Node_ComponentBoundEvent_Stimulus' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, K2Node_Event_PossessedPawn) == 0x000058, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::K2Node_Event_PossessedPawn' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_GetComponentsByClass_ReturnValue) == 0x000060, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Get_Item) == 0x000070, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, K2Node_Event_UnpossessedPawn) == 0x000080, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::K2Node_Event_UnpossessedPawn' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, K2Node_Event_DeltaSeconds) == 0x000088, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Add_ReturnValue) == 0x00008C, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Get_Item1) == 0x000098, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_IsValid_ReturnValue1) == 0x0000E1, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Add_ReturnValue1) == 0x0000E4, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_ExecuteUbergraph_BP_AIC, CallFunc_Array_Get_Item2) == 0x0000E8, "Member 'BP_AIC_C_ExecuteUbergraph_BP_AIC::CallFunc_Array_Get_Item2' has a wrong offset!");

// Function BP_AIC.BP_AIC_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AIC_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AIC_C_ReceiveTick");
static_assert(sizeof(BP_AIC_C_ReceiveTick) == 0x000004, "Wrong size on BP_AIC_C_ReceiveTick");
static_assert(offsetof(BP_AIC_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AIC_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AIC.BP_AIC_C.BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(sizeof(BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000050, "Wrong size on BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(offsetof(BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature, Actor) == 0x000000, "Member 'BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature, Stimulus) == 0x000008, "Member 'BP_AIC_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature::Stimulus' has a wrong offset!");

// Function BP_AIC.BP_AIC_C.OnPossess
// 0x0008 (0x0008 - 0x0000)
struct BP_AIC_C_OnPossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_C_OnPossess) == 0x000008, "Wrong alignment on BP_AIC_C_OnPossess");
static_assert(sizeof(BP_AIC_C_OnPossess) == 0x000008, "Wrong size on BP_AIC_C_OnPossess");
static_assert(offsetof(BP_AIC_C_OnPossess, PossessedPawn) == 0x000000, "Member 'BP_AIC_C_OnPossess::PossessedPawn' has a wrong offset!");

// Function BP_AIC.BP_AIC_C.OnUnpossess
// 0x0008 (0x0008 - 0x0000)
struct BP_AIC_C_OnUnpossess final
{
public:
	class APawn*                                  UnpossessedPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_C_OnUnpossess) == 0x000008, "Wrong alignment on BP_AIC_C_OnUnpossess");
static_assert(sizeof(BP_AIC_C_OnUnpossess) == 0x000008, "Wrong size on BP_AIC_C_OnUnpossess");
static_assert(offsetof(BP_AIC_C_OnUnpossess, UnpossessedPawn) == 0x000000, "Member 'BP_AIC_C_OnUnpossess::UnpossessedPawn' has a wrong offset!");

}

