#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIC.BP_AIC_C
// 0x0040 (0x0478 - 0x0438)
class ABP_AIC_C : public ADetourCrowdAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPawnSensingComponent*                  PawnSensing;                                       // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIPerceptionComponent*                 AIPerception;                                      // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_BehaviorComponent_C*                Personality;                                       // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAIStimulus>                    ResentStimulus;                                    // 0x0458(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class AActor*>                         ActorRefs;                                         // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_AIC(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void OnPossess(class APawn* PossessedPawn);
	void OnUnpossess(class APawn* UnpossessedPawn);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIC_C">();
	}
	static class ABP_AIC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AIC_C>();
	}
};
static_assert(alignof(ABP_AIC_C) == 0x000008, "Wrong alignment on ABP_AIC_C");
static_assert(sizeof(ABP_AIC_C) == 0x000478, "Wrong size on ABP_AIC_C");
static_assert(offsetof(ABP_AIC_C, UberGraphFrame) == 0x000438, "Member 'ABP_AIC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AIC_C, PawnSensing) == 0x000440, "Member 'ABP_AIC_C::PawnSensing' has a wrong offset!");
static_assert(offsetof(ABP_AIC_C, AIPerception) == 0x000448, "Member 'ABP_AIC_C::AIPerception' has a wrong offset!");
static_assert(offsetof(ABP_AIC_C, Personality) == 0x000450, "Member 'ABP_AIC_C::Personality' has a wrong offset!");
static_assert(offsetof(ABP_AIC_C, ResentStimulus) == 0x000458, "Member 'ABP_AIC_C::ResentStimulus' has a wrong offset!");
static_assert(offsetof(ABP_AIC_C, ActorRefs) == 0x000468, "Member 'ABP_AIC_C::ActorRefs' has a wrong offset!");

}

