#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIC_Plunger

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.ExecuteUbergraph_BP_AIC_Plunger
// 0x0150 (0x0150 - 0x0000)
struct BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x0010(0x0048)(NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Plunger_C*                      K2Node_DynamicCast_AsBP_NPC_Plunger;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue1;                 // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_UnpossessedPawn;                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BehaviorType                             CallFunc_GetCurrentBehaviorType_CurrentBehaviorType; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_lsGameINP1__flag;                         // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_lsGameINP1__flag1;                        // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Base_C*                         K2Node_DynamicCast_AsBP_NPC_Base;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Base_C*                         K2Node_DynamicCast_AsBP_NPC_Base1;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger) == 0x000008, "Wrong alignment on BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger");
static_assert(sizeof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger) == 0x000150, "Wrong size on BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, EntryPoint) == 0x000000, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_ComponentBoundEvent_Actor) == 0x000008, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_ComponentBoundEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_ComponentBoundEvent_Stimulus) == 0x000010, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_ComponentBoundEvent_Stimulus' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_ActorHasTag_ReturnValue) == 0x000058, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_Event_PossessedPawn) == 0x000060, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_Event_PossessedPawn' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, Temp_bool_Has_Been_Initd_Variable1) == 0x000069, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_Array_Add_ReturnValue1) == 0x000070, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_ComponentBoundEvent_Pawn) == 0x000078, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_AsBP_NPC_Plunger) == 0x000080, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_AsBP_NPC_Plunger' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00008C, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_IsVisible_ReturnValue) == 0x000098, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00009C, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_IsValid_ReturnValue1) == 0x0000A8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_ActorHasTag_ReturnValue1) == 0x0000A9, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_ActorHasTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_MakeLiteralName_ReturnValue) == 0x0000B0, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_Event_UnpossessedPawn) == 0x0000B8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_Event_UnpossessedPawn' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_Event_DeltaSeconds) == 0x0000C0, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, Temp_bool_IsClosed_Variable) == 0x0000C4, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, Temp_bool_IsClosed_Variable1) == 0x0000C5, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetOwningCharacter_RetCharacter) == 0x0000C8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetMovementComponent_ReturnValue) == 0x0000D0, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetCurrentBehaviorType_CurrentBehaviorType) == 0x0000D8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetCurrentBehaviorType_CurrentBehaviorType' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetGameInstance_ReturnValue) == 0x0000E0, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000E8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x0000F0, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_bSuccess1) == 0x0000F8, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_BooleanAND_ReturnValue) == 0x0000F9, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_lsGameINP1__flag) == 0x0000FA, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_lsGameINP1__flag' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetGameInstance_ReturnValue1) == 0x000100, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_IsValid_ReturnValue2) == 0x000108, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000110, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_bSuccess2) == 0x000118, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_BooleanAND_ReturnValue1) == 0x000119, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_lsGameINP1__flag1) == 0x00011A, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_lsGameINP1__flag1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetOwner_ReturnValue) == 0x000120, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_AsBP_NPC_Base) == 0x000128, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_AsBP_NPC_Base' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_bSuccess3) == 0x000130, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_IsValid_ReturnValue3) == 0x000131, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_BooleanAND_ReturnValue2) == 0x000132, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, CallFunc_GetOwner_ReturnValue1) == 0x000138, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_AsBP_NPC_Base1) == 0x000140, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_AsBP_NPC_Base1' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger, K2Node_DynamicCast_bSuccess4) == 0x000148, "Member 'BP_AIC_Plunger_C_ExecuteUbergraph_BP_AIC_Plunger::K2Node_DynamicCast_bSuccess4' has a wrong offset!");

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AIC_Plunger_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_Plunger_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AIC_Plunger_C_ReceiveTick");
static_assert(sizeof(BP_AIC_Plunger_C_ReceiveTick) == 0x000004, "Wrong size on BP_AIC_Plunger_C_ReceiveTick");
static_assert(offsetof(BP_AIC_Plunger_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AIC_Plunger_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature
// 0x0050 (0x0050 - 0x0000)
struct BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(sizeof(BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000050, "Wrong size on BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(offsetof(BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature, Actor) == 0x000000, "Member 'BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature, Stimulus) == 0x000008, "Member 'BP_AIC_Plunger_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_0_ActorPerceptionUpdatedDelegate__DelegateSignature::Stimulus' has a wrong offset!");

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature final
{
public:
	class APawn*                                  Pawn_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature");
static_assert(sizeof(BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature");
static_assert(offsetof(BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature, Pawn_0) == 0x000000, "Member 'BP_AIC_Plunger_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_3_SeePawnDelegate__DelegateSignature::Pawn_0' has a wrong offset!");

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.OnPossess
// 0x0008 (0x0008 - 0x0000)
struct BP_AIC_Plunger_C_OnPossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_Plunger_C_OnPossess) == 0x000008, "Wrong alignment on BP_AIC_Plunger_C_OnPossess");
static_assert(sizeof(BP_AIC_Plunger_C_OnPossess) == 0x000008, "Wrong size on BP_AIC_Plunger_C_OnPossess");
static_assert(offsetof(BP_AIC_Plunger_C_OnPossess, PossessedPawn) == 0x000000, "Member 'BP_AIC_Plunger_C_OnPossess::PossessedPawn' has a wrong offset!");

// Function BP_AIC_Plunger.BP_AIC_Plunger_C.OnUnpossess
// 0x0008 (0x0008 - 0x0000)
struct BP_AIC_Plunger_C_OnUnpossess final
{
public:
	class APawn*                                  UnpossessedPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIC_Plunger_C_OnUnpossess) == 0x000008, "Wrong alignment on BP_AIC_Plunger_C_OnUnpossess");
static_assert(sizeof(BP_AIC_Plunger_C_OnUnpossess) == 0x000008, "Wrong size on BP_AIC_Plunger_C_OnUnpossess");
static_assert(offsetof(BP_AIC_Plunger_C_OnUnpossess, UnpossessedPawn) == 0x000000, "Member 'BP_AIC_Plunger_C_OnUnpossess::UnpossessedPawn' has a wrong offset!");

}

