#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AllureDamageBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.ExecuteUbergraph_BP_AllureDamageBox
// 0x03D8 (0x03D8 - 0x0000)
struct BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate; // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent1;   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor1;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp1;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex1;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0060(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter1;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_HitComponent;                   // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0178(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0230(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent__hit;                           // 0x0280(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x2];                                      // 0x030A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x032C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x0338(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x03B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_Array_Get_Item1;                          // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue1;                 // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x3];                                      // 0x03D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox) == 0x000008, "Wrong alignment on BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox");
static_assert(sizeof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox) == 0x0003D8, "Wrong size on BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, EntryPoint) == 0x000000, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, Temp_int_Variable) == 0x000018, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, Temp_int_Loop_Counter_Variable1) == 0x000028, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Add_IntInt_ReturnValue1) == 0x00002C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, Temp_int_Array_Index_Variable1) == 0x000030, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OverlappedComponent1) == 0x000040, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OverlappedComponent1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherActor1) == 0x000048, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherActor1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherComp1) == 0x000050, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherComp1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherBodyIndex1) == 0x000058, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherBodyIndex1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_bFromSweep) == 0x00005C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_SweepResult) == 0x000060, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0000E8, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherActor) == 0x0000F0, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherComp) == 0x0000F8, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000100, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_DynamicCast_AsCharacter) == 0x000108, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_DynamicCast_AsCharacter1) == 0x000118, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_DynamicCast_AsCharacter1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_DynamicCast_bSuccess1) == 0x000120, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_Add_ReturnValue) == 0x000124, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_RemoveItem_ReturnValue) == 0x000128, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_Get_Item) == 0x000130, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00013C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Less_IntInt_ReturnValue) == 0x000148, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent_HitComponent) == 0x000150, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent_OtherActor) == 0x000158, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent_OtherComp) == 0x000160, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent_NormalImpulse) == 0x000168, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent_Hit) == 0x000178, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_bBlockingHit) == 0x000200, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_bInitialOverlap) == 0x000201, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Time) == 0x000204, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Distance) == 0x000208, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Location) == 0x00020C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_ImpactPoint) == 0x000218, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Normal) == 0x000224, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_ImpactNormal) == 0x000230, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_PhysMat) == 0x000240, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitActor) == 0x000248, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitComponent) == 0x000250, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitBoneName) == 0x000258, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitItem) == 0x000260, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_FaceIndex) == 0x000264, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_TraceStart) == 0x000268, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_TraceEnd) == 0x000274, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, K2Node_CustomEvent__hit) == 0x000280, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::K2Node_CustomEvent__hit' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_bBlockingHit1) == 0x000308, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_bBlockingHit1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_bInitialOverlap1) == 0x000309, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_bInitialOverlap1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Time1) == 0x00030C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Time1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Distance1) == 0x000310, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Distance1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Location1) == 0x000314, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Location1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_ImpactPoint1) == 0x000320, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_ImpactPoint1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_Normal1) == 0x00032C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_Normal1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_ImpactNormal1) == 0x000338, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_ImpactNormal1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_PhysMat1) == 0x000348, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_PhysMat1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitActor1) == 0x000350, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitActor1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitComponent1) == 0x000358, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitComponent1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitBoneName1) == 0x000360, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitBoneName1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_HitItem1) == 0x000368, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_HitItem1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_FaceIndex1) == 0x00036C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_FaceIndex1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_TraceStart1) == 0x000370, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_TraceStart1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_BreakHitResult_TraceEnd1) == 0x00037C, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_BreakHitResult_TraceEnd1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000388, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000398, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_VSize_ReturnValue) == 0x0003A0, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Subtract_IntInt_ReturnValue) == 0x0003A4, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003A8, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0003AC, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_ApplyDamage_ReturnValue) == 0x0003B0, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_ApplyDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0003B4, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x0003B8, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_Get_Item1) == 0x0003C0, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Array_Length_ReturnValue1) == 0x0003C8, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_ApplyDamage_ReturnValue1) == 0x0003CC, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_ApplyDamage_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Less_IntInt_ReturnValue1) == 0x0003D0, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003D4, "Member 'BP_AllureDamageBox_C_ExecuteUbergraph_BP_AllureDamageBox::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.OneTimeDamge
// 0x0088 (0x0088 - 0x0000)
struct BP_AllureDamageBox_C_OneTimeDamge final
{
public:
	struct FHitResult                             _hit;                                              // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AllureDamageBox_C_OneTimeDamge) == 0x000008, "Wrong alignment on BP_AllureDamageBox_C_OneTimeDamge");
static_assert(sizeof(BP_AllureDamageBox_C_OneTimeDamge) == 0x000088, "Wrong size on BP_AllureDamageBox_C_OneTimeDamge");
static_assert(offsetof(BP_AllureDamageBox_C_OneTimeDamge, _hit) == 0x000000, "Member 'BP_AllureDamageBox_C_OneTimeDamge::_hit' has a wrong offset!");

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.DamgeUse
// 0x00B0 (0x00B0 - 0x0000)
struct BP_AllureDamageBox_C_DamgeUse final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AllureDamageBox_C_DamgeUse) == 0x000008, "Wrong alignment on BP_AllureDamageBox_C_DamgeUse");
static_assert(sizeof(BP_AllureDamageBox_C_DamgeUse) == 0x0000B0, "Wrong size on BP_AllureDamageBox_C_DamgeUse");
static_assert(offsetof(BP_AllureDamageBox_C_DamgeUse, HitComponent) == 0x000000, "Member 'BP_AllureDamageBox_C_DamgeUse::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_DamgeUse, OtherActor) == 0x000008, "Member 'BP_AllureDamageBox_C_DamgeUse::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_DamgeUse, OtherComp) == 0x000010, "Member 'BP_AllureDamageBox_C_DamgeUse::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_DamgeUse, NormalImpulse) == 0x000018, "Member 'BP_AllureDamageBox_C_DamgeUse::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_DamgeUse, Hit) == 0x000028, "Member 'BP_AllureDamageBox_C_DamgeUse::Hit' has a wrong offset!");

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_AllureDamageBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_AllureDamageBox.BP_AllureDamageBox_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AllureDamageBox_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AllureDamageBox_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AllureDamageBox_C_ReceiveTick");
static_assert(sizeof(BP_AllureDamageBox_C_ReceiveTick) == 0x000004, "Wrong size on BP_AllureDamageBox_C_ReceiveTick");
static_assert(offsetof(BP_AllureDamageBox_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AllureDamageBox_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

