#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AttackDrone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AttackDrone.BP_AttackDrone_C.ExecuteUbergraph_BP_AttackDrone
// 0x07C0 (0x07C0 - 0x0000)
struct BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_AttackDrone_C*                  K2Node_DynamicCast_AsAnim_BP_Attack_Drone;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Locations_Distance;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue1;       // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerHead_Success;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_GetPlayerHead_BoxHead;                    // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPointDistanceToLine_ReturnValue;       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index1;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stage;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerHead_Success1;                   // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoxComponent*                          CallFunc_GetPlayerHead_BoxHead1;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_DeadlyBulletSettings_C*>     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_DeadlyBulletSettings_C*             CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanMachineGunFire_Angle;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanMachineGunFire_CoolDown;               // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWpn_Helicopter_MachineGun_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue2;       // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAlongSpline_Location;          // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetLocationAlongSpline_SplineFinish;      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue1;               // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0238(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C2[0x2];                                      // 0x02C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0328(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AProjectile_RPG_PVE_C*                  K2Node_DynamicCast_AsProjectile_RPG_PVE;           // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x035A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x035B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item1;                          // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue3;         // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37A[0x2];                                      // 0x037A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue4;         // 0x0384(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0390(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue5;         // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MissileStart_C*                     CallFunc_FinishSpawningActor_ReturnValue1;         // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue1;        // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DeadlyBulletNum;                // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_TargetPoint;                    // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsUseOffset;                    // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsSpecial;                      // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_426[0x2];                                      // 0x0426(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_ImpactPoint;                    // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Normal;                         // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRPG;                          // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue2;        // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue2;               // 0x0460(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_472[0x2];                                      // 0x0472(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue1;          // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue2;          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base1;           // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    K2Node_CustomEvent_Target;                         // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue1;    // 0x04B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x04C0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Value;                          // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x054A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x054B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_Index;                          // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger1_CmpSuccess;                  // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue3;     // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue4;     // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0570(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue1;          // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue5;     // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue2;          // 0x0590(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0599(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x059A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x059B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x059C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x059D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x059E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59F[0x1];                                      // 0x059F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue3;               // 0x05A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x05B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x05B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerProjectile_C*                    K2Node_DynamicCast_AsPlayer_Projectile;            // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AProjectile_RPG_PVE_C*                  K2Node_DynamicCast_AsProjectile_RPG_PVE1;          // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0xF];                                      // 0x05F1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0600(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0630(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAllowDeadlyBullet_Result;               // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x06BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BB[0x1];                                      // 0x06BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x7];                                      // 0x06C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x06C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors1;           // 0x06D8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item2;                          // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item3;                          // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x06FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FE[0x2];                                      // 0x06FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damge;                                // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue6;         // 0x0708(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0714(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x0718(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0719(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x071A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x071B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x071C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult1;      // 0x0728(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue1;         // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue5;                // 0x07B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x07B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue6;                // 0x07B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone) == 0x000010, "Wrong alignment on BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone");
static_assert(sizeof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone) == 0x0007C0, "Wrong size on BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, EntryPoint) == 0x000000, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetSocketLocation_ReturnValue) == 0x000004, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000010, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetActorRightVector_ReturnValue) == 0x000018, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetActorForwardVector_ReturnValue) == 0x00003C, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Add_VectorVector_ReturnValue) == 0x000048, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetAnimInstance_ReturnValue) == 0x000058, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_DynamicCast_AsAnim_BP_Attack_Drone) == 0x000060, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_DynamicCast_AsAnim_BP_Attack_Drone' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, Temp_int_Array_Index_Variable) == 0x00006C, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000070, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00007C, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000080, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Distance_Between_Locations_Distance) == 0x00008C, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Distance_Between_Locations_Distance' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_SwitchInteger_CmpSuccess) == 0x000091, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetActorForwardVector_ReturnValue1) == 0x000094, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetActorForwardVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_HasAuthority_ReturnValue) == 0x0000A0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x0000A4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetPlayerHead_Success) == 0x0000B0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetPlayerHead_Success' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetPlayerHead_BoxHead) == 0x0000B8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetPlayerHead_BoxHead' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000C0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetPointDistanceToLine_ReturnValue) == 0x0000CC, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetPointDistanceToLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Abs_ReturnValue) == 0x0000D0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_CustomEvent_Index1) == 0x0000D8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_CustomEvent_Index1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_CustomEvent_Stage) == 0x0000E0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_CustomEvent_Stage' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetPlayerHead_Success1) == 0x0000E4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetPlayerHead_Success1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetPlayerHead_BoxHead1) == 0x0000E8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetPlayerHead_BoxHead1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x0000F0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetAllActorsOfClass_OutActors) == 0x000100, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetSocketTransform_ReturnValue) == 0x000110, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakTransform_Location) == 0x000148, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakTransform_Rotation) == 0x000154, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakTransform_Scale) == 0x000160, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_MakeTransform_ReturnValue) == 0x000170, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001A0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_CanMachineGunFire_Angle) == 0x0001A8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_CanMachineGunFire_Angle' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_CanMachineGunFire_CoolDown) == 0x0001A9, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_CanMachineGunFire_CoolDown' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BooleanAND_ReturnValue) == 0x0001B8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_Event_DeltaSeconds) == 0x0001BC, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001C4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetActorForwardVector_ReturnValue2) == 0x0001C8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetActorForwardVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_IsValid_ReturnValue1) == 0x0001D4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetLocationAlongSpline_Location) == 0x0001D8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetLocationAlongSpline_Location' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_GetLocationAlongSpline_SplineFinish) == 0x0001E4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_GetLocationAlongSpline_SplineFinish' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_SpawnParticle_ReturnValue) == 0x0001E8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_SpawnParticle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_SpawnParticle_ReturnValue1) == 0x0001F0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_SpawnParticle_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, Temp_int_Loop_Counter_Variable) == 0x0001F8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, Temp_int_Loop_Counter_Variable1) == 0x0001FC, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Add_IntInt_ReturnValue1) == 0x000200, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_Add_IntInt_ReturnValue2) == 0x000204, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000208, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_ComponentBoundEvent_HitComponent) == 0x000210, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_ComponentBoundEvent_OtherActor) == 0x000218, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_ComponentBoundEvent_OtherComp) == 0x000220, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000228, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, K2Node_ComponentBoundEvent_Hit) == 0x000238, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_bBlockingHit) == 0x0002C0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002C1, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_Time) == 0x0002C4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_Distance) == 0x0002C8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_Location) == 0x0002CC, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_ImpactPoint) == 0x0002D8, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_Normal) == 0x0002E4, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_ImpactNormal) == 0x0002F0, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_PhysMat) == 0x000300, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_HitActor) == 0x000308, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_HitComponent) == 0x000310, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_HitBoneName) == 0x000318, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone, CallFunc_BreakHitResult_HitItem) == 0x000320, "Member 'BP_AttackDrone_C_ExecuteUbergraph_BP_AttackDrone::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
