#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIStorage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_AIStorage.BP_AIStorage_C.ExecuteUbergraph_BP_AIStorage
// 0x0050 (0x0050 - 0x0000)
struct BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerController*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class APlayerController*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_ActorRef;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage) == 0x000008, "Wrong alignment on BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage");
static_assert(sizeof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage) == 0x000050, "Wrong size on BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, EntryPoint) == 0x000000, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_K2_GetPawn_ReturnValue) == 0x000030, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, K2Node_CustomEvent_ActorRef) == 0x000040, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::K2Node_CustomEvent_ActorRef' has a wrong offset!");
static_assert(offsetof(BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage, CallFunc_Array_AddUnique_ReturnValue) == 0x000048, "Member 'BP_AIStorage_C_ExecuteUbergraph_BP_AIStorage::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function BP_AIStorage.BP_AIStorage_C.AddActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AIStorage_C_AddActor final
{
public:
	class AActor*                                 ActorRef;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIStorage_C_AddActor) == 0x000008, "Wrong alignment on BP_AIStorage_C_AddActor");
static_assert(sizeof(BP_AIStorage_C_AddActor) == 0x000008, "Wrong size on BP_AIStorage_C_AddActor");
static_assert(offsetof(BP_AIStorage_C_AddActor, ActorRef) == 0x000000, "Member 'BP_AIStorage_C_AddActor::ActorRef' has a wrong offset!");

// Function BP_AIStorage.BP_AIStorage_C.AddActorToList
// 0x0008 (0x0008 - 0x0000)
struct BP_AIStorage_C_AddActorToList final
{
public:
	class AActor*                                 ActorRef;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIStorage_C_AddActorToList) == 0x000008, "Wrong alignment on BP_AIStorage_C_AddActorToList");
static_assert(sizeof(BP_AIStorage_C_AddActorToList) == 0x000008, "Wrong size on BP_AIStorage_C_AddActorToList");
static_assert(offsetof(BP_AIStorage_C_AddActorToList, ActorRef) == 0x000000, "Member 'BP_AIStorage_C_AddActorToList::ActorRef' has a wrong offset!");

}

