#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BehaviorComponent

#include "Basic.hpp"

#include "Enum_OperationType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"
#include "Struct_ActorTrigger_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "Enum_PatrolType_structs.hpp"
#include "Struct_NumberTrigger_structs.hpp"
#include "Struct_BasicBehavior_structs.hpp"
#include "Struct_ActorDistanceTrigger_structs.hpp"
#include "Enum_MessageTag_structs.hpp"
#include "Enum_IdleType_structs.hpp"
#include "Struct_TagTrigger_structs.hpp"


namespace SDK::Params
{

// Function BP_BehaviorComponent.BP_BehaviorComponent_C.ExecuteUbergraph_BP_BehaviorComponent
// 0x0470 (0x0470 - 0x0000)
struct BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_Anim;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_CustomEvent_Audio;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ActorRef;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_CustomEvent_StimulusRef;                    // 0x0048(0x0048)(NoDestructor)
	class UClass*                                 CallFunc_GetSenseClassForStimulus_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_MessageTag                               K2Node_CustomEvent_MessageTag;                     // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AIStorage_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x00B0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_AIStorage_C*                        CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIStorage_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_TagTrigger                     CallFunc_Array_Get_Item1;                          // 0x011C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11F[0x1];                                      // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue1;           // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_ActorTrigger>           K2Node_Select_Default;                             // 0x0130(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable1;         // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0157(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_TagTrigger                     CallFunc_Array_Get_Item2;                          // 0x015C(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E[0x2];                                      // 0x015E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue2;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue1;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_ActorTrigger                   CallFunc_Array_Get_Item3;                          // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue1;                 // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable2;         // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetRandomActorWithTag_RandomActor;        // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_Result;                         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_CustomEvent_AIController;                   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue1;             // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TalkLength;                     // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_IdleType                                 K2Node_CustomEvent_PrevIdleType;                   // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimation_AnimLength;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue2;         // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult Result, class AAIController* AIController)> K2Node_CreateDelegate_OutputDelegate2; // 0x0248(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0278(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsTargetAlive_ret;                        // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_BasicBehavior                  CallFunc_GetCurrentBehaviorConfig_Config;          // 0x0290(0x00B0)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue2;                    // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFirstSeenPlayer_IsSeen;                 // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x037B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_BasicBehavior>          K2Node_MakeArray_Array;                            // 0x0380(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue3;             // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue4;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x03B0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x03D8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0409(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x6];                                      // 0x040A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         CallFunc_AIMoveTo_ReturnValue;                     // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x0420(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter1;         // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue1;         // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter2;         // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_BehaviorType                             CallFunc_GetCurrentBehaviorType_CurrentBehaviorType; // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter3;         // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BehaviorType                             CallFunc_GetCurrentBehaviorType_CurrentBehaviorType1; // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x046A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x046B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent) == 0x000010, "Wrong alignment on BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent");
static_assert(sizeof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent) == 0x000470, "Wrong size on BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, EntryPoint) == 0x000000, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000004, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Variable) == 0x00000C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_Anim) == 0x000010, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_Anim' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_Audio) == 0x000018, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_Audio' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_PlayAnimMontage_ReturnValue) == 0x000024, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_bool_Variable) == 0x00003C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_ActorRef) == 0x000040, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_ActorRef' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_StimulusRef) == 0x000048, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_StimulusRef' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetSenseClassForStimulus_ReturnValue) == 0x000090, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetSenseClassForStimulus_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_ActorHasTag_ReturnValue) == 0x000098, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000099, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_MessageTag) == 0x00009A, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_MessageTag' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_bool_True_if_break_was_hit_Variable) == 0x00009B, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetEnumeratorName_ReturnValue) == 0x0000A0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue1) == 0x0000A8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000B0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00010C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetOwner_ReturnValue) == 0x000110, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Length_ReturnValue1) == 0x000118, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Get_Item1) == 0x00011C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00011E, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Length_ReturnValue2) == 0x000120, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetEnumeratorName_ReturnValue1) == 0x000128, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetEnumeratorName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_Select_Default) == 0x000130, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000140, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Length_ReturnValue3) == 0x000144, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Loop_Counter_Variable1) == 0x000148, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Less_IntInt_ReturnValue1) == 0x00014C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Add_IntInt_ReturnValue1) == 0x000150, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BooleanAND_ReturnValue) == 0x000154, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_bool_True_if_break_was_hit_Variable1) == 0x000155, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_bool_True_if_break_was_hit_Variable1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue2) == 0x000156, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BooleanAND_ReturnValue1) == 0x000157, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Array_Index_Variable1) == 0x000158, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Get_Item2) == 0x00015C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetEnumeratorName_ReturnValue2) == 0x000160, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetEnumeratorName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_NameName_ReturnValue1) == 0x000168, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_NameName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Array_Index_Variable2) == 0x00016C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Get_Item3) == 0x000170, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Array_Length_ReturnValue4) == 0x000180, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_ActorHasTag_ReturnValue1) == 0x000184, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_ActorHasTag_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_bool_True_if_break_was_hit_Variable2) == 0x000185, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_bool_True_if_break_was_hit_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000188, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue3) == 0x000198, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetOwner_ReturnValue1) == 0x0001A0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetAIController_ReturnValue) == 0x0001A8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_IsValid_ReturnValue1) == 0x0001B0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_HasAuthority_ReturnValue) == 0x0001B1, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeLiteralName_ReturnValue) == 0x0001B8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate1) == 0x0001C0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetRandomActorWithTag_RandomActor) == 0x0001D0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetRandomActorWithTag_RandomActor' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_Result) == 0x0001D8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_AIController) == 0x0001E0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_AIController' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001E8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeLiteralName_ReturnValue1) == 0x0001F0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeLiteralName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Loop_Counter_Variable2) == 0x0001F8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_OtherActor) == 0x000200, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_TalkLength) == 0x000208, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_TalkLength' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CustomEvent_PrevIdleType) == 0x00020C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CustomEvent_PrevIdleType' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000210, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Less_IntInt_ReturnValue2) == 0x00021C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Add_IntInt_ReturnValue2) == 0x000220, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BooleanAND_ReturnValue2) == 0x000224, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_PlayAnimation_AnimLength) == 0x000228, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_PlayAnimation_AnimLength' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_K2_GetActorLocation_ReturnValue2) == 0x00022C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_K2_GetActorLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_FindLookAtRotation_ReturnValue) == 0x000238, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate2) == 0x000248, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BreakRotator_Roll) == 0x000258, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BreakRotator_Pitch) == 0x00025C, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BreakRotator_Yaw) == 0x000260, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeRotator_ReturnValue) == 0x000264, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000270, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate3) == 0x000278, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_IsTargetAlive_ret) == 0x000288, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_IsTargetAlive_ret' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetCurrentBehaviorConfig_Config) == 0x000290, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetCurrentBehaviorConfig_Config' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000340, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeLiteralName_ReturnValue2) == 0x000348, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetValueAsBool_ReturnValue) == 0x000350, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_K2_SetTimer_ReturnValue) == 0x000358, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue4) == 0x000360, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetOwner_ReturnValue2) == 0x000368, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetOwningCharacter_RetCharacter) == 0x000370, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_IsFirstSeenPlayer_IsSeen) == 0x000378, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_IsFirstSeenPlayer_IsSeen' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_IsCrouching_ReturnValue) == 0x000379, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Not_PreBool_ReturnValue5) == 0x00037A, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Not_PreBool_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_BooleanAND_ReturnValue3) == 0x00037B, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_MakeArray_Array) == 0x000380, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeLiteralName_ReturnValue3) == 0x000390, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeLiteralName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_MakeLiteralName_ReturnValue4) == 0x000398, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_MakeLiteralName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_Event_DeltaSeconds) == 0x0003A0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0003A4, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003A8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, Temp_int_Variable1) == 0x0003AC, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate4) == 0x0003B0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0003C0, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003C4, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0003C8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_CreateDelegate_OutputDelegate5) == 0x0003D8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_Add_IntInt_ReturnValue3) == 0x0003E8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x0003EC, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, CallFunc_GetGameInstance_ReturnValue) == 0x0003F8, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000400, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent, K2Node_DynamicCast_bSuccess) == 0x000408, "Member 'BP_BehaviorComponent_C_ExecuteUbergraph_BP_BehaviorComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
