#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BehaviorTriggerComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_MessageTag_structs.hpp"


namespace SDK::Params
{

// Function BP_BehaviorTriggerComponent.BP_BehaviorTriggerComponent_C.ExecuteUbergraph_BP_BehaviorTriggerComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ReceivingActor;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MessageTag                               K2Node_CustomEvent_Message;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Instigator;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Radius;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MessageTag                               K2Node_CustomEvent_Message1;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_BehaviorComponent_C*>        CallFunc_GetComponentsByClass_ReturnValue;         // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_BehaviorComponent_C*                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent) == 0x000008, "Wrong alignment on BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent");
static_assert(sizeof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent) == 0x000060, "Wrong size on BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, EntryPoint) == 0x000000, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_ReceivingActor) == 0x000008, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_ReceivingActor' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_Message) == 0x000010, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_Message' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_Instigator) == 0x000018, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_Location) == 0x000020, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_Radius) == 0x00002C, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_Radius' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, K2Node_CustomEvent_Message1) == 0x000030, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::K2Node_CustomEvent_Message1' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, CallFunc_GetComponentsByClass_ReturnValue) == 0x000038, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, CallFunc_GetEnumeratorName_ReturnValue) == 0x000048, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::CallFunc_GetEnumeratorName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_BehaviorTriggerComponent_C_ExecuteUbergraph_BP_BehaviorTriggerComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_BehaviorTriggerComponent.BP_BehaviorTriggerComponent_C.SendDirectMessage
// 0x0010 (0x0010 - 0x0000)
struct BP_BehaviorTriggerComponent_C_SendDirectMessage final
{
public:
	class AActor*                                 ReceivingActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MessageTag                               Message;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BehaviorTriggerComponent_C_SendDirectMessage) == 0x000008, "Wrong alignment on BP_BehaviorTriggerComponent_C_SendDirectMessage");
static_assert(sizeof(BP_BehaviorTriggerComponent_C_SendDirectMessage) == 0x000010, "Wrong size on BP_BehaviorTriggerComponent_C_SendDirectMessage");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendDirectMessage, ReceivingActor) == 0x000000, "Member 'BP_BehaviorTriggerComponent_C_SendDirectMessage::ReceivingActor' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendDirectMessage, Message) == 0x000008, "Member 'BP_BehaviorTriggerComponent_C_SendDirectMessage::Message' has a wrong offset!");

// Function BP_BehaviorTriggerComponent.BP_BehaviorTriggerComponent_C.SendAreaMessage
// 0x0020 (0x0020 - 0x0000)
struct BP_BehaviorTriggerComponent_C_SendAreaMessage final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MessageTag                               Message;                                           // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BehaviorTriggerComponent_C_SendAreaMessage) == 0x000008, "Wrong alignment on BP_BehaviorTriggerComponent_C_SendAreaMessage");
static_assert(sizeof(BP_BehaviorTriggerComponent_C_SendAreaMessage) == 0x000020, "Wrong size on BP_BehaviorTriggerComponent_C_SendAreaMessage");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendAreaMessage, Instigator) == 0x000000, "Member 'BP_BehaviorTriggerComponent_C_SendAreaMessage::Instigator' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendAreaMessage, Location) == 0x000008, "Member 'BP_BehaviorTriggerComponent_C_SendAreaMessage::Location' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendAreaMessage, Radius) == 0x000014, "Member 'BP_BehaviorTriggerComponent_C_SendAreaMessage::Radius' has a wrong offset!");
static_assert(offsetof(BP_BehaviorTriggerComponent_C_SendAreaMessage, Message) == 0x000018, "Member 'BP_BehaviorTriggerComponent_C_SendAreaMessage::Message' has a wrong offset!");

}

