#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarGPS

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CarGPS.BP_CarGPS_C
// 0x0040 (0x0248 - 0x0208)
class UBP_CarGPS_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CarMap_C*                           BP_CarMap;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Distance;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     Num;                                               // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CarGPS(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitHUD(class ABP_Lv3_BaseCar_C* PlayerCar, class ABP_Lv3_BaseCar_C* Prison);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CarGPS_C">();
	}
	static class UBP_CarGPS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CarGPS_C>();
	}
};
static_assert(alignof(UBP_CarGPS_C) == 0x000008, "Wrong alignment on UBP_CarGPS_C");
static_assert(sizeof(UBP_CarGPS_C) == 0x000248, "Wrong size on UBP_CarGPS_C");
static_assert(offsetof(UBP_CarGPS_C, UberGraphFrame) == 0x000208, "Member 'UBP_CarGPS_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, BP_CarMap) == 0x000210, "Member 'UBP_CarGPS_C::BP_CarMap' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, Distance) == 0x000218, "Member 'UBP_CarGPS_C::Distance' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, Image_0) == 0x000220, "Member 'UBP_CarGPS_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, Image_2) == 0x000228, "Member 'UBP_CarGPS_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, Image_10) == 0x000230, "Member 'UBP_CarGPS_C::Image_10' has a wrong offset!");
static_assert(offsetof(UBP_CarGPS_C, Num) == 0x000238, "Member 'UBP_CarGPS_C::Num' has a wrong offset!");

}

