#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CaptionsTools

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_Language_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CaptionsTools.BP_CaptionsTools_C
// 0x0098 (0x03C0 - 0x0328)
class ABP_CaptionsTools_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGameplayTasksComponent*                GameplayTasks;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         captions;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         CaptionsNum;                                       // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StringIndex;                                       // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv3_characterBase_C*                Player;                                            // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UGameOverTips_C*>                tipswidget;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class USoundBase*                             curSound;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        AudioComponent;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 BreakTime;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         TipsSoundLoopCount;                                // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TipsSoundLoopDelay;                                // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SoundAttached;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ExecuteCount;                                      // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayTask_WaitDelay*                DelayProxy;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundID;                                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    GameInstance;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CaptionsTools(int32 EntryPoint);
	void PauseSound(bool Pause);
	void HiddenCaptions();
	void getWidget();
	void DisplayCaptions(class USceneComponent* SoundAttached_0, class FName Sound, bool IsTips, int32 TipsSoundLoopCount_0, float TipsSoundLoopDelay_0, int32 TipsDisplayTime, bool AlwaysShow);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnFinish_0C2A1D1843713C8C7B01FB9FE6EDA352();
	void OnFinish_CBEA0B7345AF4B7A1663D9BC90DDAB60();
	void OnFinish_3EAAB5124117C388472CD6A45DC2147B();
	void UserConstructionScript();
	void SpawnSound();
	void SpawnCaptions(class USceneComponent* SoundAttached_0, class FName Sound, bool IsTips, int32 TipsSoundLoopCount_0, float TipsSoundLoopDelay_0, int32 TipsDisplayTime, bool AlwaysShow, float* SoundDuration);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CaptionsTools_C">();
	}
	static class ABP_CaptionsTools_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CaptionsTools_C>();
	}
};
static_assert(alignof(ABP_CaptionsTools_C) == 0x000008, "Wrong alignment on ABP_CaptionsTools_C");
static_assert(sizeof(ABP_CaptionsTools_C) == 0x0003C0, "Wrong size on ABP_CaptionsTools_C");
static_assert(offsetof(ABP_CaptionsTools_C, UberGraphFrame) == 0x000328, "Member 'ABP_CaptionsTools_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, GameplayTasks) == 0x000330, "Member 'ABP_CaptionsTools_C::GameplayTasks' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, DefaultSceneRoot) == 0x000338, "Member 'ABP_CaptionsTools_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, captions) == 0x000340, "Member 'ABP_CaptionsTools_C::captions' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, CaptionsNum) == 0x000350, "Member 'ABP_CaptionsTools_C::CaptionsNum' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, StringIndex) == 0x000354, "Member 'ABP_CaptionsTools_C::StringIndex' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, Player) == 0x000358, "Member 'ABP_CaptionsTools_C::Player' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, tipswidget) == 0x000360, "Member 'ABP_CaptionsTools_C::tipswidget' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, curSound) == 0x000370, "Member 'ABP_CaptionsTools_C::curSound' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, AudioComponent) == 0x000378, "Member 'ABP_CaptionsTools_C::AudioComponent' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, BreakTime) == 0x000380, "Member 'ABP_CaptionsTools_C::BreakTime' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, TipsSoundLoopCount) == 0x000390, "Member 'ABP_CaptionsTools_C::TipsSoundLoopCount' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, TipsSoundLoopDelay) == 0x000394, "Member 'ABP_CaptionsTools_C::TipsSoundLoopDelay' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, SoundAttached) == 0x000398, "Member 'ABP_CaptionsTools_C::SoundAttached' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, ExecuteCount) == 0x0003A0, "Member 'ABP_CaptionsTools_C::ExecuteCount' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, DelayProxy) == 0x0003A8, "Member 'ABP_CaptionsTools_C::DelayProxy' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, SoundID) == 0x0003B0, "Member 'ABP_CaptionsTools_C::SoundID' has a wrong offset!");
static_assert(offsetof(ABP_CaptionsTools_C, GameInstance) == 0x0003B8, "Member 'ABP_CaptionsTools_C::GameInstance' has a wrong offset!");

}

