#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_MainMenu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.ExecuteUbergraph_BP_Character_MainMenu
// 0x0330 (0x0330 - 0x0000)
struct BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key1;                      // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0038(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key2;                      // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0098(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key3;                      // 0x0128(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue3;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue2;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue1; // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue1;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18F[0x1];                                      // 0x018F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default;                             // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select1_Default;                            // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A8[0x8];                                      // 0x01A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FKey                                   Temp_struct_Variable1;                             // 0x01E0(0x0018)(HasGetValueTypeHash)
	uint8                                         Pad_1F8[0x8];                                      // 0x01F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0200(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue1;        // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key4;                      // 0x0238(0x0018)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWpn_Pistol_MainMenu_C*                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0260(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWpn_Pistol_MainMenu_C*                 CallFunc_FinishSpawningActor_ReturnValue1;         // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPDefaultHand_C*                       CallFunc_FinishSpawningActor_ReturnValue2;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPRightHand_C*                         CallFunc_FinishSpawningActor_ReturnValue3;         // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue1;         // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key5;                      // 0x02C8(0x0018)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentWorldType_ReturnValue;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CommandLineArgValue_value;                // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommandLineArgValue_ReturnValue;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu) == 0x000010, "Wrong alignment on BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu");
static_assert(sizeof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu) == 0x000330, "Wrong size on BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, EntryPoint) == 0x000000, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key1) == 0x000008, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key) == 0x000020, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_struct_Variable) == 0x000038, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_Has_Been_Initd_Variable) == 0x000051, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetController_ReturnValue) == 0x000058, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_DynamicCast_AsPlayer_Controller) == 0x000060, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key2) == 0x000080, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000098, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_Has_Been_Initd_Variable1) == 0x000120, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_IsClosed_Variable1) == 0x000121, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key3) == 0x000128, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputAxisEvent_AxisValue3) == 0x000140, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputAxisEvent_AxisValue3' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputAxisEvent_AxisValue2) == 0x000144, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputAxisEvent_AxisValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetActorForwardVector_ReturnValue) == 0x000148, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetActorRightVector_ReturnValue) == 0x000154, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x000160, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue1) == 0x000161, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetForwardVector_ReturnValue) == 0x000164, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputAxisEvent_AxisValue1) == 0x000170, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputAxisEvent_AxisValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetRightVector_ReturnValue) == 0x000174, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000180, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputAxisEvent_AxisValue) == 0x000184, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000188, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsLocallyControlled_ReturnValue) == 0x00018C, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_Variable) == 0x00018D, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_bool_Variable1) == 0x00018E, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_Select_Default) == 0x000190, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_Select1_Default) == 0x00019C, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_MakeTransform_ReturnValue) == 0x0001B0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, Temp_struct_Variable1) == 0x0001E0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_MakeTransform_ReturnValue1) == 0x000200, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000230, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_K2_AttachToComponent_ReturnValue1) == 0x000231, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_K2_AttachToComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key4) == 0x000238, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000250, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_FinishSpawningActor_ReturnValue) == 0x000258, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_MakeTransform_ReturnValue2) == 0x000260, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000290, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000298, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_FinishSpawningActor_ReturnValue1) == 0x0002A0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_FinishSpawningActor_ReturnValue2) == 0x0002A8, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3) == 0x0002B0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_FinishSpawningActor_ReturnValue3) == 0x0002B8, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_FinishSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsValid_ReturnValue) == 0x0002C0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsValid_ReturnValue1) == 0x0002C1, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsValid_ReturnValue2) == 0x0002C2, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsLocallyControlled_ReturnValue1) == 0x0002C3, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsLocallyControlled_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_IsValid_ReturnValue3) == 0x0002C4, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_InputActionEvent_Key5) == 0x0002C8, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_InputActionEvent_Key5' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetCurrentWorldType_ReturnValue) == 0x0002E0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetCurrentWorldType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_CommandLineArgValue_value) == 0x0002F0, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_CommandLineArgValue_value' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_CommandLineArgValue_ReturnValue) == 0x000300, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_CommandLineArgValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_Concat_StrStr_ReturnValue) == 0x000308, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000318, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000320, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu, K2Node_DynamicCast_bSuccess1) == 0x000328, "Member 'BP_Character_MainMenu_C_ExecuteUbergraph_BP_Character_MainMenu::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpAxisEvt_LookUp_K2Node_InputAxisEvent_172
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172) == 0x000004, "Wrong alignment on BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172");
static_assert(sizeof(BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172) == 0x000004, "Wrong size on BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172");
static_assert(offsetof(BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172, AxisValue) == 0x000000, "Member 'BP_Character_MainMenu_C_InpAxisEvt_LookUp_K2Node_InputAxisEvent_172::AxisValue' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpAxisEvt_Turn_K2Node_InputAxisEvent_157
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157) == 0x000004, "Wrong alignment on BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157");
static_assert(sizeof(BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157) == 0x000004, "Wrong size on BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157");
static_assert(offsetof(BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157, AxisValue) == 0x000000, "Member 'BP_Character_MainMenu_C_InpAxisEvt_Turn_K2Node_InputAxisEvent_157::AxisValue' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192) == 0x000004, "Wrong alignment on BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192");
static_assert(sizeof(BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192) == 0x000004, "Wrong size on BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192");
static_assert(offsetof(BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192, AxisValue) == 0x000000, "Member 'BP_Character_MainMenu_C_InpAxisEvt_MoveRight_K2Node_InputAxisEvent_192::AxisValue' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181) == 0x000004, "Wrong alignment on BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181");
static_assert(sizeof(BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181) == 0x000004, "Wrong size on BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181");
static_assert(offsetof(BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181, AxisValue) == 0x000000, "Member 'BP_Character_MainMenu_C_InpAxisEvt_MoveForward_K2Node_InputAxisEvent_181::AxisValue' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Character_MainMenu_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Character_MainMenu_C_ReceiveTick");
static_assert(sizeof(BP_Character_MainMenu_C_ReceiveTick) == 0x000004, "Wrong size on BP_Character_MainMenu_C_ReceiveTick");
static_assert(offsetof(BP_Character_MainMenu_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Character_MainMenu_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Fire_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Fire_K2Node_InputActionEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Fire_K2Node_InputActionEvent_5::Key' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Fire_L_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Fire_L_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Fire_L_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Reload_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Reload_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function BP_Character_MainMenu.BP_Character_MainMenu_C.InpActEvt_Reload_L_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_Character_MainMenu_C_InpActEvt_Reload_L_K2Node_InputActionEvent_0::Key' has a wrong offset!");

}

