#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarFrontHUD

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_CarFrontHUD.BP_CarFrontHUD_C.ExecuteUbergraph_BP_CarFrontHUD
// 0x0088 (0x0088 - 0x0000)
struct BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Distance_Between_Actors_Distance;         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0070(0x0018)()
};
static_assert(alignof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD) == 0x000008, "Wrong alignment on BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD");
static_assert(sizeof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD) == 0x000088, "Wrong size on BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, EntryPoint) == 0x000000, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_IsValid_ReturnValue1) == 0x000041, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_IsValid_ReturnValue2) == 0x000060, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_Distance_Between_Actors_Distance) == 0x000064, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_Distance_Between_Actors_Distance' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD, CallFunc_Conv_FloatToText_ReturnValue) == 0x000070, "Member 'BP_CarFrontHUD_C_ExecuteUbergraph_BP_CarFrontHUD::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

// Function BP_CarFrontHUD.BP_CarFrontHUD_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_CarFrontHUD_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarFrontHUD_C_Tick) == 0x000004, "Wrong alignment on BP_CarFrontHUD_C_Tick");
static_assert(sizeof(BP_CarFrontHUD_C_Tick) == 0x00003C, "Wrong size on BP_CarFrontHUD_C_Tick");
static_assert(offsetof(BP_CarFrontHUD_C_Tick, MyGeometry) == 0x000000, "Member 'BP_CarFrontHUD_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_CarFrontHUD_C_Tick::InDeltaTime' has a wrong offset!");

// Function BP_CarFrontHUD.BP_CarFrontHUD_C.DisplayTooFar
// 0x0003 (0x0003 - 0x0000)
struct BP_CarFrontHUD_C_DisplayTooFar final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CarFrontHUD_C_DisplayTooFar) == 0x000001, "Wrong alignment on BP_CarFrontHUD_C_DisplayTooFar");
static_assert(sizeof(BP_CarFrontHUD_C_DisplayTooFar) == 0x000003, "Wrong size on BP_CarFrontHUD_C_DisplayTooFar");
static_assert(offsetof(BP_CarFrontHUD_C_DisplayTooFar, NewParam) == 0x000000, "Member 'BP_CarFrontHUD_C_DisplayTooFar::NewParam' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_DisplayTooFar, CallFunc_IsVisible_ReturnValue) == 0x000001, "Member 'BP_CarFrontHUD_C_DisplayTooFar::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CarFrontHUD_C_DisplayTooFar, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000002, "Member 'BP_CarFrontHUD_C_DisplayTooFar::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BP_CarFrontHUD.BP_CarFrontHUD_C.InitFrontHUD
// 0x0008 (0x0008 - 0x0000)
struct BP_CarFrontHUD_C_InitFrontHUD final
{
public:
	class AVehicle_MC_C*                          NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarFrontHUD_C_InitFrontHUD) == 0x000008, "Wrong alignment on BP_CarFrontHUD_C_InitFrontHUD");
static_assert(sizeof(BP_CarFrontHUD_C_InitFrontHUD) == 0x000008, "Wrong size on BP_CarFrontHUD_C_InitFrontHUD");
static_assert(offsetof(BP_CarFrontHUD_C_InitFrontHUD, NewParam) == 0x000000, "Member 'BP_CarFrontHUD_C_InitFrontHUD::NewParam' has a wrong offset!");

}

