#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarFrontHUD

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CarFrontHUD.BP_CarFrontHUD_C
// 0x0050 (0x0258 - 0x0208)
class UBP_CarFrontHUD_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CarHUD_map_C*                       BP_CarHUD_map;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Distance;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Speed;                                             // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             speed2;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Toofar;                                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AVehicle_MC_C*                          SelfCar;                                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CarFrontHUD(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void DisplayTooFar(bool NewParam);
	void InitFrontHUD(class AVehicle_MC_C* NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CarFrontHUD_C">();
	}
	static class UBP_CarFrontHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CarFrontHUD_C>();
	}
};
static_assert(alignof(UBP_CarFrontHUD_C) == 0x000008, "Wrong alignment on UBP_CarFrontHUD_C");
static_assert(sizeof(UBP_CarFrontHUD_C) == 0x000258, "Wrong size on UBP_CarFrontHUD_C");
static_assert(offsetof(UBP_CarFrontHUD_C, UberGraphFrame) == 0x000208, "Member 'UBP_CarFrontHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, BP_CarHUD_map) == 0x000210, "Member 'UBP_CarFrontHUD_C::BP_CarHUD_map' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, CanvasPanel_1) == 0x000218, "Member 'UBP_CarFrontHUD_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, Distance) == 0x000220, "Member 'UBP_CarFrontHUD_C::Distance' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, Image_1) == 0x000228, "Member 'UBP_CarFrontHUD_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, Image_2) == 0x000230, "Member 'UBP_CarFrontHUD_C::Image_2' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, Speed) == 0x000238, "Member 'UBP_CarFrontHUD_C::Speed' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, speed2) == 0x000240, "Member 'UBP_CarFrontHUD_C::speed2' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, Toofar) == 0x000248, "Member 'UBP_CarFrontHUD_C::Toofar' has a wrong offset!");
static_assert(offsetof(UBP_CarFrontHUD_C, SelfCar) == 0x000250, "Member 'UBP_CarFrontHUD_C::SelfCar' has a wrong offset!");

}

