#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarHUD_map

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_CarHUD-map.BP_CarHUD-map_C
// 0x0020 (0x0228 - 0x0208)
class UBP_CarHUD_map_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CarMap_C*                           BP_CarMap;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     Num;                                               // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_CarHUD_map(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void InitHUD(class ABP_Lv3_BaseCar_C* PlayerCar, class ABP_Lv3_BaseCar_C* Prison);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CarHUD-map_C">();
	}
	static class UBP_CarHUD_map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CarHUD_map_C>();
	}
};
static_assert(alignof(UBP_CarHUD_map_C) == 0x000008, "Wrong alignment on UBP_CarHUD_map_C");
static_assert(sizeof(UBP_CarHUD_map_C) == 0x000228, "Wrong size on UBP_CarHUD_map_C");
static_assert(offsetof(UBP_CarHUD_map_C, UberGraphFrame) == 0x000208, "Member 'UBP_CarHUD_map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_CarHUD_map_C, BP_CarMap) == 0x000210, "Member 'UBP_CarHUD_map_C::BP_CarMap' has a wrong offset!");
static_assert(offsetof(UBP_CarHUD_map_C, Num) == 0x000218, "Member 'UBP_CarHUD_map_C::Num' has a wrong offset!");

}

