#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DarkRoom.BP_DarkRoom_C
// 0x0050 (0x0378 - 0x0328)
class ABP_DarkRoom_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          EnbalePostproces;                                  // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APostProcessVolume*>             PostArray;                                         // 0x0358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AExponentialHeightFog*>          FogArray;                                          // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_DarkRoom(int32 EntryPoint);
	void ClosePostProcess();
	void EnablePostProcess();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DarkRoom_C">();
	}
	static class ABP_DarkRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DarkRoom_C>();
	}
};
static_assert(alignof(ABP_DarkRoom_C) == 0x000008, "Wrong alignment on ABP_DarkRoom_C");
static_assert(sizeof(ABP_DarkRoom_C) == 0x000378, "Wrong size on ABP_DarkRoom_C");
static_assert(offsetof(ABP_DarkRoom_C, UberGraphFrame) == 0x000328, "Member 'ABP_DarkRoom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, Sphere) == 0x000330, "Member 'ABP_DarkRoom_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, Box) == 0x000338, "Member 'ABP_DarkRoom_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, Capsule) == 0x000340, "Member 'ABP_DarkRoom_C::Capsule' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, DefaultSceneRoot) == 0x000348, "Member 'ABP_DarkRoom_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, EnbalePostproces) == 0x000350, "Member 'ABP_DarkRoom_C::EnbalePostproces' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, PostArray) == 0x000358, "Member 'ABP_DarkRoom_C::PostArray' has a wrong offset!");
static_assert(offsetof(ABP_DarkRoom_C, FogArray) == 0x000368, "Member 'ABP_DarkRoom_C::FogArray' has a wrong offset!");

}

