#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DarkRoom

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_DarkRoom.BP_DarkRoom_C.ExecuteUbergraph_BP_DarkRoom
// 0x00A8 (0x00A8 - 0x0000)
struct BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AExponentialHeightFog*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class APostProcessVolume*                     CallFunc_Array_Get_Item1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     CallFunc_Array_Get_Item2;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AExponentialHeightFog*>          CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0080(0x0010)(ZeroConstructor, ReferenceParm)
	class AExponentialHeightFog*                  CallFunc_Array_Get_Item3;                          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom) == 0x000008, "Wrong alignment on BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom");
static_assert(sizeof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom) == 0x0000A8, "Wrong size on BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, EntryPoint) == 0x000000, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Loop_Counter_Variable2) == 0x00001C, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Add_IntInt_ReturnValue2) == 0x000020, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Array_Index_Variable1) == 0x000024, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Loop_Counter_Variable3) == 0x000028, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Add_IntInt_ReturnValue3) == 0x000030, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Array_Index_Variable2) == 0x000034, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, Temp_int_Array_Index_Variable3) == 0x000038, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Get_Item1) == 0x000058, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Length_ReturnValue1) == 0x000060, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Less_IntInt_ReturnValue1) == 0x000068, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Get_Item2) == 0x000070, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Length_ReturnValue2) == 0x000078, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_IsValid_ReturnValue) == 0x00007C, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Less_IntInt_ReturnValue2) == 0x00007D, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_GetAllActorsOfClass_OutActors1) == 0x000080, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Get_Item3) == 0x000090, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Length_ReturnValue3) == 0x000098, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Less_IntInt_ReturnValue3) == 0x00009C, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_IsVisible_ReturnValue) == 0x00009D, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom, CallFunc_Array_Add_ReturnValue1) == 0x0000A0, "Member 'BP_DarkRoom_C_ExecuteUbergraph_BP_DarkRoom::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");

}

