#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameModePVP_Base

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"
#include "Enum_Winner_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GameModePVP_Base.BP_GameModePVP_Base_C.ExecuteUbergraph_BP_GameModePVP_Base
// 0x07B0 (0x07B0 - 0x0000)
struct BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable2;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable5;                             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable6;                             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable7;                             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable8;                             // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable9;                             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0117(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Get_Item;                           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item1;                          // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FYYMsgReqAckRoomInfo& RoomInfo)> K2Node_CreateDelegate_OutputDelegate1; // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_ExitingController;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerControllerPVP_Base_C*         K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base; // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomInfo                   CallFunc_CreateFakeRoomInfo_Out;                   // 0x01A8(0x0080)()
	class ABP_PlayerControllerPVP_Base_C*         K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base1; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select1_Default;                            // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item2;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x02A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Start;                          // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABPWpnBase_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x02C0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABPWpnBase_C*                           CallFunc_Array_Get_Item3;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PVP_Center_Prop_C*>          CallFunc_GetAllActorsOfClass_OutActors1;           // 0x02E0(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_PVP_Center_Prop_C*                  CallFunc_Array_Get_Item4;                          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x02F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item5;                          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Value;                          // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x033D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33E[0x2];                                      // 0x033E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item6;                          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0359(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0360(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0370(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item7;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PVP_BGM_C*>                  CallFunc_GetAllActorsOfClass_OutActors2;           // 0x03D8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_PVP_BGM_C*                          CallFunc_Array_Get_Item8;                          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x03F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F6[0xA];                                      // 0x03F6(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0400(0x0030)(IsPlainOldData, NoDestructor)
	class APlayerController*                      K2Node_Event_NewPlayerController;                  // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_RoomName;                             // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_RoomID;                               // 0x0448(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_PlayerID;                             // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PVP_LoaderServerConnection_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0478(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0488(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PlayerControllerPVP_Base_C*         K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base2; // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomInfo                   K2Node_CustomEvent_RoomInfo;                       // 0x04B8(0x0080)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x0538(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0548(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerInRoom_IsInRoom;                  // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x3];                                      // 0x0569(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_IsPlayerInRoom_Team;                      // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_IsPlayerInRoom_PlayerInfo;                // 0x0570(0x0048)()
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item9;                          // 0x05B8(0x0048)()
	class FString                                 K2Node_Select2_Default;                            // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue12;              // 0x0610(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue13;              // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue14;              // 0x0630(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PVP_StartPosition_C*                CallFunc_GetStartTransform_Target;                 // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_StartPosition_C*                CallFunc_GetStartTransform_Target1;                // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PVP_StartPosition_C*                CallFunc_GetStartTransform_Target2;                // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PVP_StartPosition_C*                CallFunc_GetStartTransform_Target3;                // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0670(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x06A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue1;           // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x7];                                      // 0x06B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Carl_C*                CallFunc_FinishSpawningActor_ReturnValue1;         // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Leonard_C*             CallFunc_FinishSpawningActor_ReturnValue2;         // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_SparkWomen_C*          CallFunc_FinishSpawningActor_ReturnValue3;         // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4; // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_SparkMan_C*            CallFunc_FinishSpawningActor_ReturnValue4;         // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5; // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Max_C*                 CallFunc_FinishSpawningActor_ReturnValue5;         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue6; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Evan_C*                CallFunc_FinishSpawningActor_ReturnValue6;         // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CountPlayers_Count;                       // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FBIdentToString_Out;                      // 0x0720(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FBIdentToString_Out1;                     // 0x0730(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue15;              // 0x0740(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue16;              // 0x0750(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue17;              // 0x0760(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_772[0x6];                                      // 0x0772(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item10;                         // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue1;               // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerControllerPVP_Base_C*         K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base3; // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base) == 0x000010, "Wrong alignment on BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base");
static_assert(sizeof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base) == 0x0007B0, "Wrong size on BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, EntryPoint) == 0x000000, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable) == 0x000008, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable1) == 0x000018, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Variable) == 0x000038, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable2) == 0x000040, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable3) == 0x000050, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable4) == 0x000060, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable4' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable5) == 0x000070, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable5' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Variable1) == 0x000080, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable6) == 0x000088, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable6' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable7) == 0x000098, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable7' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable8) == 0x0000A8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable8' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_string_Variable9) == 0x0000B8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_string_Variable9' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable) == 0x0000C8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_HasAuthority_ReturnValue) == 0x0000E0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_HasAuthority_ReturnValue1) == 0x0000E1, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable) == 0x0000E4, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable1) == 0x0000EC, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue1) == 0x0000F0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable1) == 0x0000F4, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable2) == 0x0000F8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue2) == 0x0000FC, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable2) == 0x000100, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_Variable) == 0x000104, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable3) == 0x000108, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_IsClosed_Variable) == 0x00010C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue3) == 0x000110, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_Has_Been_Initd_Variable) == 0x000114, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_Has_Been_Initd_Variable1) == 0x000115, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_IsClosed_Variable1) == 0x000116, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_IsClosed_Variable2) == 0x000117, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_IsClosed_Variable2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_bool_Has_Been_Initd_Variable2) == 0x000118, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_bool_Has_Been_Initd_Variable2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable3) == 0x00011C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable4) == 0x000120, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue4) == 0x000124, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable4) == 0x000128, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_HasAuthority_ReturnValue2) == 0x00012C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable5) == 0x000130, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable5) == 0x000134, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue5) == 0x000138, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable6) == 0x00013C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable6' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Len_ReturnValue) == 0x000140, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Greater_IntInt_ReturnValue) == 0x000144, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Get_Item) == 0x000148, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Get_Item1) == 0x00014C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_CreateDelegate_OutputDelegate1) == 0x000150, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_HasAuthority_ReturnValue3) == 0x000160, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable6) == 0x000164, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Loop_Counter_Variable7) == 0x000168, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Loop_Counter_Variable7' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue6) == 0x00016C, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Add_IntInt_ReturnValue7) == 0x000170, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, Temp_int_Array_Index_Variable7) == 0x000174, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::Temp_int_Array_Index_Variable7' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_Event_NewPlayer) == 0x000178, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_Event_ExitingController) == 0x000180, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_Event_ExitingController' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base) == 0x000188, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_DynamicCast_bSuccess) == 0x000190, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_GetDisplayName_ReturnValue) == 0x000198, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_CreateFakeRoomInfo_Out) == 0x0001A8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_CreateFakeRoomInfo_Out' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base1) == 0x000228, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_DynamicCast_AsBP_Player_Controller_PVP_Base1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_DynamicCast_bSuccess1) == 0x000230, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Length_ReturnValue) == 0x000234, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000238, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_Select_Default) == 0x000240, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000250, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Concat_StrStr_ReturnValue1) == 0x000258, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000268, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_BooleanOR_ReturnValue) == 0x000269, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_Select1_Default) == 0x000270, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_Event_DeltaSeconds) == 0x000280, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Get_Item2) == 0x000288, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Length_ReturnValue1) == 0x000290, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_IsValid_ReturnValue) == 0x000294, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000295, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_GetController_ReturnValue) == 0x000298, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_IsValid_ReturnValue1) == 0x0002A0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Concat_StrStr_ReturnValue2) == 0x0002A8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_RandomFloatInRange_ReturnValue) == 0x0002B8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, K2Node_CustomEvent_Start) == 0x0002BC, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::K2Node_CustomEvent_Start' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_GetAllActorsOfClass_OutActors) == 0x0002C0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Get_Item3) == 0x0002D0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Length_ReturnValue2) == 0x0002D8, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Less_IntInt_ReturnValue1) == 0x0002DC, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_GetAllActorsOfClass_OutActors1) == 0x0002E0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base, CallFunc_Array_Get_Item4) == 0x0002F0, "Member 'BP_GameModePVP_Base_C_ExecuteUbergraph_BP_GameModePVP_Base::CallFunc_Array_Get_Item4' has a wrong offset!");
