#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HttpWebBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HttpWebBase.BP_HttpWebBase_C.ExecuteUbergraph_BP_HttpWebBase
// 0x0028 (0x0028 - 0x0000)
struct BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetWebConfig_GameID;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebConfig_ChannelID;                   // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase) == 0x000008, "Wrong alignment on BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase");
static_assert(sizeof(BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase) == 0x000028, "Wrong size on BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase");
static_assert(offsetof(BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase, EntryPoint) == 0x000000, "Member 'BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase, CallFunc_GetWebConfig_GameID) == 0x000008, "Member 'BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase::CallFunc_GetWebConfig_GameID' has a wrong offset!");
static_assert(offsetof(BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase, CallFunc_GetWebConfig_ChannelID) == 0x000018, "Member 'BP_HttpWebBase_C_ExecuteUbergraph_BP_HttpWebBase::CallFunc_GetWebConfig_ChannelID' has a wrong offset!");

}

