#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IGM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IGM.BP_IGM_C
// 0x0068 (0x0390 - 0x0328)
class ABP_IGM_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnResuse;                                          // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnCheckPoint;                                      // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnSetting;                                         // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExit;                                            // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnRestart;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_IGM(int32 EntryPoint);
	void CustomEvent();
	void CustomEvent_2();
	void CustomEvent_3();
	void ReceiveBeginPlay();
	void Resuse();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IGM_C">();
	}
	static class ABP_IGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IGM_C>();
	}
};
static_assert(alignof(ABP_IGM_C) == 0x000008, "Wrong alignment on ABP_IGM_C");
static_assert(sizeof(ABP_IGM_C) == 0x000390, "Wrong size on ABP_IGM_C");
static_assert(offsetof(ABP_IGM_C, UberGraphFrame) == 0x000328, "Member 'ABP_IGM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, Widget) == 0x000330, "Member 'ABP_IGM_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, Scene) == 0x000338, "Member 'ABP_IGM_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, OnResuse) == 0x000340, "Member 'ABP_IGM_C::OnResuse' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, OnCheckPoint) == 0x000350, "Member 'ABP_IGM_C::OnCheckPoint' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, OnSetting) == 0x000360, "Member 'ABP_IGM_C::OnSetting' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, OnExit) == 0x000370, "Member 'ABP_IGM_C::OnExit' has a wrong offset!");
static_assert(offsetof(ABP_IGM_C, OnRestart) == 0x000380, "Member 'ABP_IGM_C::OnRestart' has a wrong offset!");

}

