#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemBase.BP_ItemBase_C.ExecuteUbergraph_BP_ItemBase
// 0x07A0 (0x07A0 - 0x0000)
struct BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWpn_HeavyRiotShield_C*                 K2Node_DynamicCast_AsWpn_Heavy_Riot_Shield;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable6;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable7;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Target;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRightHand;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable8;                              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 Temp_class_Variable9;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable10;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerProjectile_C*                    K2Node_DynamicCast_AsPlayer_Projectile;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0170(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable11;                             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPhone_C*                   K2Node_DynamicCast_AsBP_Character_Phone;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base1;           // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue1;      // 0x01D0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0xC];                                      // 0x0234(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue2;      // 0x0270(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x02A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x02AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue2;               // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x0350(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 K2Node_Select_Default;                             // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E3[0x1];                                      // 0x03E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue1;           // 0x03F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x03F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F5[0x3];                                      // 0x03F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable12;                             // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable13;                             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable14;                             // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable15;                             // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x041A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0420(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue1;                // 0x0450(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x04B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue1;                       // 0x04E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue2;                       // 0x0510(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0540(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult1;     // 0x05D0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue1;        // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable16;                             // 0x0660(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue;                // 0x0670(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue1;                // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue2;                // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State1;             // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State2;             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable17;                             // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x06C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x06C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x06C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4[0x4];                                      // 0x06C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable18;                             // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x06D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x06E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F4[0x4];                                      // 0x06F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x06F8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 K2Node_Select1_Default;                            // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase) == 0x000010, "Wrong alignment on BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase");
static_assert(sizeof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase) == 0x0007A0, "Wrong size on BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, EntryPoint) == 0x000000, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable) == 0x000008, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable1) == 0x000010, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable2) == 0x000018, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable3) == 0x000020, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable4) == 0x000028, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable5) == 0x000030, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_Variable) == 0x000038, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsBPWeapon_Base) == 0x000040, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsBPWeapon_Base' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MapRangeUnclamped_ReturnValue) == 0x00004C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsWpn_Heavy_Riot_Shield) == 0x000050, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsWpn_Heavy_Riot_Shield' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess1) == 0x000058, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_IsClosed_Variable) == 0x00005A, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_bool_Has_Been_Initd_Variable) == 0x00005B, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable6) == 0x000060, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable6' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_HasAuthority_ReturnValue) == 0x000068, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable7) == 0x000070, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable7' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_byte_Variable) == 0x000078, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_Target) == 0x000080, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_CustomEvent_IsRightHand) == 0x000088, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_CustomEvent_IsRightHand' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsBP_Character_Base) == 0x000090, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess2) == 0x000098, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00009C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue1) == 0x0000A8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue2) == 0x0000E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable8) == 0x0000E8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable8' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000F0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable9) == 0x000120, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable9' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location) == 0x000128, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation) == 0x000134, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale) == 0x000140, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable10) == 0x000150, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable10' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_SwitchEnum_CmpSuccess) == 0x000158, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_DeltaSeconds) == 0x00015C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsPlayer_Projectile) == 0x000160, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsPlayer_Projectile' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess3) == 0x000168, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_Damage) == 0x00016C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_DamageType) == 0x000170, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_InstigatedBy) == 0x000178, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Event_DamageCauser) == 0x000180, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_SwitchEnum1_CmpSuccess) == 0x000188, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsPlayer_Controller) == 0x000190, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess4) == 0x000198, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetPawn_ReturnValue) == 0x0001A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable11) == 0x0001A8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable11' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsBP_Character_Phone) == 0x0001B0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsBP_Character_Phone' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess5) == 0x0001B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsBP_Character_Base1) == 0x0001C0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsBP_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess6) == 0x0001C8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentToWorld_ReturnValue1) == 0x0001D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentToWorld_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Less_FloatFloat_ReturnValue) == 0x000200, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000204, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000210, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x00021C, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x000228, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_TLerp_ReturnValue) == 0x000240, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_GetComponentToWorld_ReturnValue2) == 0x000270, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_GetComponentToWorld_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location1) == 0x0002A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation1) == 0x0002AC, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale1) == 0x0002B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Location2) == 0x0002C4, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Rotation2) == 0x0002D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BreakTransform_Scale2) == 0x0002DC, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MakeTransform_ReturnValue1) == 0x0002F0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_MakeTransform_ReturnValue2) == 0x000320, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_MakeTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x000350, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Select_Default) == 0x0003D8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue3) == 0x0003E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue4) == 0x0003E1, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Not_PreBool_ReturnValue) == 0x0003E2, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x0003E4, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0003E8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0003EC, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue5) == 0x0003F0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0003F1, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_NotEqual_ByteByte_ReturnValue1) == 0x0003F2, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_NotEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0003F3, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BooleanAND_ReturnValue) == 0x0003F4, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable12) == 0x0003F8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable12' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable13) == 0x000400, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable13' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable14) == 0x000408, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable14' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable15) == 0x000410, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable15' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_HasAuthority_ReturnValue1) == 0x000418, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue6) == 0x000419, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue7) == 0x00041A, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetTransform_ReturnValue) == 0x000420, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetTransform_ReturnValue1) == 0x000450, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetTransform_ReturnValue2) == 0x000480, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetTransform_ReturnValue3) == 0x0004B0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_TLerp_ReturnValue1) == 0x0004E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_TLerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_TLerp_ReturnValue2) == 0x000510, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_TLerp_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000540, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0005C8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetActorTransform_SweepHitResult1) == 0x0005D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetActorTransform_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_K2_SetActorTransform_ReturnValue1) == 0x000658, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_K2_SetActorTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable16) == 0x000660, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable16' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetGameState_ReturnValue) == 0x000668, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_SpawnParticle_ReturnValue) == 0x000670, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_SpawnParticle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsMer_2Game_State) == 0x000678, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsMer_2Game_State' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess7) == 0x000680, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetGameState_ReturnValue1) == 0x000688, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetGameState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_GetGameState_ReturnValue2) == 0x000690, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_GetGameState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsMer_2Game_State1) == 0x000698, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsMer_2Game_State1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess8) == 0x0006A0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_AsMer_2Game_State2) == 0x0006A8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_AsMer_2Game_State2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_DynamicCast_bSuccess9) == 0x0006B0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable17) == 0x0006B8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable17' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue8) == 0x0006C0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_IsValid_ReturnValue9) == 0x0006C1, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0006C2, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0006C3, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, Temp_class_Variable18) == 0x0006C8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::Temp_class_Variable18' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_ComponentBoundEvent_HitComponent) == 0x0006D0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_ComponentBoundEvent_OtherActor) == 0x0006D8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_ComponentBoundEvent_OtherComp) == 0x0006E0, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0006E8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_ComponentBoundEvent_Hit) == 0x0006F8, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, K2Node_Select1_Default) == 0x000780, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000788, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000790, "Member 'BP_ItemBase_C_ExecuteUbergraph_BP_ItemBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000028, "Member 'BP_ItemBase_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_ItemBase.BP_ItemBase_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_ItemBase_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_ItemBase_C_ReceiveAnyDamage");
static_assert(sizeof(BP_ItemBase_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_ItemBase_C_ReceiveAnyDamage");
static_assert(offsetof(BP_ItemBase_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'BP_ItemBase_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_ItemBase_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_ItemBase_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
