#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemBase_lv4

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemBase_lv4.BP_ItemBase_lv4_C.ExecuteUbergraph_BP_ItemBase_lv4
// 0x03F0 (0x03F0 - 0x0000)
struct BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable5;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable6;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable7;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable8;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable9;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable10;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable11;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable12;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable13;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemTypes                                    Temp_byte_Variable;                                // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0xC];                                       // 0x00F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 Temp_class_Variable14;                             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Select_Default;                             // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable15;                             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable16;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable17;                             // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0xE];                                      // 0x0162(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0170(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0xF];                                      // 0x01A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue1;                // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue2;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TLerp_ReturnValue;                        // 0x0210(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue3;                // 0x0240(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0270(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_TLerp_ReturnValue1;                       // 0x0300(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 Temp_class_Variable18;                             // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult1;     // 0x0338(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue1;        // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select1_Default;                            // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4) == 0x000010, "Wrong alignment on BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4");
static_assert(sizeof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4) == 0x0003F0, "Wrong size on BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, EntryPoint) == 0x000000, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable) == 0x000008, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable1) == 0x000010, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable2) == 0x000018, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable3) == 0x000020, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable4) == 0x000028, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable4' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable5) == 0x000030, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable5' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable6) == 0x000038, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable6' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable7) == 0x000040, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable7' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable8) == 0x000048, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable8' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable9) == 0x000050, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable9' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable10) == 0x000058, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable10' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable11) == 0x000060, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable11' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable12) == 0x000068, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable12' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_bool_Variable) == 0x000070, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, K2Node_DynamicCast_AsBPWeapon_Base) == 0x000078, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::K2Node_DynamicCast_AsBPWeapon_Base' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_MapRangeUnclamped_ReturnValue) == 0x000084, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_MapRangeUnclamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_bool_IsClosed_Variable) == 0x000088, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable13) == 0x000090, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable13' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_bool_Has_Been_Initd_Variable) == 0x000098, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_byte_Variable) == 0x000099, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_HasAuthority_ReturnValue) == 0x00009A, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, K2Node_Event_DeltaSeconds) == 0x00009C, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000A0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_BreakTransform_Rotation) == 0x0000DC, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_BreakTransform_Scale) == 0x0000E8, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_MakeTransform_ReturnValue) == 0x000100, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable14) == 0x000130, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable14' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, K2Node_Select_Default) == 0x000138, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_IsValid_ReturnValue) == 0x000140, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_IsValid_ReturnValue1) == 0x000141, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_Less_FloatFloat_ReturnValue) == 0x000142, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_Add_FloatFloat_ReturnValue) == 0x000144, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable15) == 0x000148, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable15' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable16) == 0x000150, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable16' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable17) == 0x000158, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable17' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_HasAuthority_ReturnValue1) == 0x000160, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_IsValid_ReturnValue2) == 0x000161, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_GetTransform_ReturnValue) == 0x000170, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_IsValid_ReturnValue3) == 0x0001A0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_GetTransform_ReturnValue1) == 0x0001B0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_GetTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_GetTransform_ReturnValue2) == 0x0001E0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_GetTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_TLerp_ReturnValue) == 0x000210, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_TLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_GetTransform_ReturnValue3) == 0x000240, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_GetTransform_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000270, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0002F8, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_TLerp_ReturnValue1) == 0x000300, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_TLerp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, Temp_class_Variable18) == 0x000330, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::Temp_class_Variable18' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_K2_SetActorTransform_SweepHitResult1) == 0x000338, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_K2_SetActorTransform_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_K2_SetActorTransform_ReturnValue1) == 0x0003C0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_K2_SetActorTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, K2Node_Select1_Default) == 0x0003C8, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0003D0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_FinishSpawningActor_ReturnValue) == 0x0003D8, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0003E0, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0003E4, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4, CallFunc_Not_PreBool_ReturnValue) == 0x0003E8, "Member 'BP_ItemBase_lv4_C_ExecuteUbergraph_BP_ItemBase_lv4::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ItemBase_lv4.BP_ItemBase_lv4_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ItemBase_lv4_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ItemBase_lv4_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ItemBase_lv4_C_ReceiveTick");
static_assert(sizeof(BP_ItemBase_lv4_C_ReceiveTick) == 0x000004, "Wrong size on BP_ItemBase_lv4_C_ReceiveTick");
static_assert(offsetof(BP_ItemBase_lv4_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ItemBase_lv4_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

