#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv4_RightHand

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Lv4_LeftHand_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lv4_RightHand.BP_Lv4_RightHand_C
// 0x0020 (0x0630 - 0x0610)
class ABP_Lv4_RightHand_C final : public ABP_Lv4_LeftHand_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Lv4_RightHand_C;                 // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               Init;                                              // 0x0618(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                InitLocation;                                      // 0x0624(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lv4_RightHand(int32 EntryPoint);
	void Flip(class USceneComponent* Widget);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv4_RightHand_C">();
	}
	static class ABP_Lv4_RightHand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lv4_RightHand_C>();
	}
};
static_assert(alignof(ABP_Lv4_RightHand_C) == 0x000010, "Wrong alignment on ABP_Lv4_RightHand_C");
static_assert(sizeof(ABP_Lv4_RightHand_C) == 0x000630, "Wrong size on ABP_Lv4_RightHand_C");
static_assert(offsetof(ABP_Lv4_RightHand_C, UberGraphFrame_BP_Lv4_RightHand_C) == 0x000610, "Member 'ABP_Lv4_RightHand_C::UberGraphFrame_BP_Lv4_RightHand_C' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_RightHand_C, Init) == 0x000618, "Member 'ABP_Lv4_RightHand_C::Init' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_RightHand_C, InitLocation) == 0x000624, "Member 'ABP_Lv4_RightHand_C::InitLocation' has a wrong offset!");

}

