#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelVerify

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HttpWebBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LevelVerify.BP_LevelVerify_C
// 0x0020 (0x0480 - 0x0460)
class ABP_LevelVerify_C final : public ABP_HttpWebBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LevelVerify_C;                   // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	UMulticastDelegateProperty_                   OnReceiveMsg;                                      // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DebugPoint;                                        // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LevelVerify(int32 EntryPoint);
	void OnHttp(bool Success);
	void StartVerify(int32 LevelPoint, int32 LevelNumber, int32 Difficulty);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LevelVerify_C">();
	}
	static class ABP_LevelVerify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LevelVerify_C>();
	}
};
static_assert(alignof(ABP_LevelVerify_C) == 0x000008, "Wrong alignment on ABP_LevelVerify_C");
static_assert(sizeof(ABP_LevelVerify_C) == 0x000480, "Wrong size on ABP_LevelVerify_C");
static_assert(offsetof(ABP_LevelVerify_C, UberGraphFrame_BP_LevelVerify_C) == 0x000460, "Member 'ABP_LevelVerify_C::UberGraphFrame_BP_LevelVerify_C' has a wrong offset!");
static_assert(offsetof(ABP_LevelVerify_C, OnReceiveMsg) == 0x000468, "Member 'ABP_LevelVerify_C::OnReceiveMsg' has a wrong offset!");
static_assert(offsetof(ABP_LevelVerify_C, DebugPoint) == 0x000478, "Member 'ABP_LevelVerify_C::DebugPoint' has a wrong offset!");

}

