#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_lv3NPCController

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_lv3NPCController.BP_lv3NPCController_C.ExecuteUbergraph_BP_lv3NPCController
// 0x0018 (0x0018 - 0x0000)
struct BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController) == 0x000008, "Wrong alignment on BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController");
static_assert(sizeof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController) == 0x000018, "Wrong size on BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController");
static_assert(offsetof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController, EntryPoint) == 0x000000, "Member 'BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController, CallFunc_RunBehaviorTree_ReturnValue) == 0x000004, "Member 'BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController, CallFunc_UseBlackboard_BlackboardComponent) == 0x000008, "Member 'BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController, CallFunc_UseBlackboard_ReturnValue) == 0x000010, "Member 'BP_lv3NPCController_C_ExecuteUbergraph_BP_lv3NPCController::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");

}

