#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LevelVerify

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_LevelVerify.BP_LevelVerify_C.ExecuteUbergraph_BP_LevelVerify
// 0x0228 (0x0228 - 0x0000)
struct BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMer2VerifyGameUrl_Url;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LevelPoint;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_LevelNumber;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Difficulty;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Success;                        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue1;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue2;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue3;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            K2Node_MakeMap_Map;                                // 0x0128(0x0050)(ZeroConstructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetStringResponse_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVerifyApiResult_IsVerify;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify) == 0x000008, "Wrong alignment on BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify");
static_assert(sizeof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify) == 0x000228, "Wrong size on BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, EntryPoint) == 0x000000, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_bool_Variable) == 0x000018, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_string_Variable) == 0x000020, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_string_Variable1) == 0x000030, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000040, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_bool_Has_Been_Initd_Variable) == 0x000041, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_IsPlayInEditor_ReturnValue) == 0x000058, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_GetMer2VerifyGameUrl_Url) == 0x000060, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_GetMer2VerifyGameUrl_Url' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_CustomEvent_LevelPoint) == 0x000070, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_CustomEvent_LevelPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_CustomEvent_LevelNumber) == 0x000074, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_CustomEvent_LevelNumber' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_CustomEvent_Difficulty) == 0x000078, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_CustomEvent_Difficulty' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_CustomEvent_Success) == 0x00007C, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Multiply_IntInt_ReturnValue) == 0x000090, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_Select_Default) == 0x000098, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Conv_IntToString_ReturnValue1) == 0x0000B0, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Conv_IntToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000C8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000D8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Conv_IntToString_ReturnValue2) == 0x0000E8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Conv_IntToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Conv_IntToString_ReturnValue3) == 0x0000F8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Conv_IntToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue3) == 0x000108, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue4) == 0x000118, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_MakeMap_Map) == 0x000128, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue5) == 0x000178, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue6) == 0x000188, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_GetStringResponse_ReturnValue) == 0x000198, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_GetStringResponse_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue7) == 0x0001A8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue8) == 0x0001B8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue9) == 0x0001C8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, Temp_bool_IsClosed_Variable) == 0x0001D9, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_GetGameInstance_ReturnValue) == 0x0001E0, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x0001E8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, K2Node_DynamicCast_bSuccess) == 0x0001F0, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_GetDisplayName_ReturnValue) == 0x0001F8, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Concat_StrStr_ReturnValue10) == 0x000208, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Concat_StrStr_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Percent_IntInt_ReturnValue) == 0x00021C, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_Subtract_IntInt_ReturnValue) == 0x000220, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify, CallFunc_IsVerifyApiResult_IsVerify) == 0x000224, "Member 'BP_LevelVerify_C_ExecuteUbergraph_BP_LevelVerify::CallFunc_IsVerifyApiResult_IsVerify' has a wrong offset!");

// Function BP_LevelVerify.BP_LevelVerify_C.OnHttp
// 0x0001 (0x0001 - 0x0000)
struct BP_LevelVerify_C_OnHttp final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LevelVerify_C_OnHttp) == 0x000001, "Wrong alignment on BP_LevelVerify_C_OnHttp");
static_assert(sizeof(BP_LevelVerify_C_OnHttp) == 0x000001, "Wrong size on BP_LevelVerify_C_OnHttp");
static_assert(offsetof(BP_LevelVerify_C_OnHttp, Success) == 0x000000, "Member 'BP_LevelVerify_C_OnHttp::Success' has a wrong offset!");

// Function BP_LevelVerify.BP_LevelVerify_C.StartVerify
// 0x000C (0x000C - 0x0000)
struct BP_LevelVerify_C_StartVerify final
{
public:
	int32                                         LevelPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LevelNumber;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Difficulty;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LevelVerify_C_StartVerify) == 0x000004, "Wrong alignment on BP_LevelVerify_C_StartVerify");
static_assert(sizeof(BP_LevelVerify_C_StartVerify) == 0x00000C, "Wrong size on BP_LevelVerify_C_StartVerify");
static_assert(offsetof(BP_LevelVerify_C_StartVerify, LevelPoint) == 0x000000, "Member 'BP_LevelVerify_C_StartVerify::LevelPoint' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_StartVerify, LevelNumber) == 0x000004, "Member 'BP_LevelVerify_C_StartVerify::LevelNumber' has a wrong offset!");
static_assert(offsetof(BP_LevelVerify_C_StartVerify, Difficulty) == 0x000008, "Member 'BP_LevelVerify_C_StartVerify::Difficulty' has a wrong offset!");

}

