#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_plunger_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BE_Lv2_NPCAttackstate_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Lv2_plunger_Anim.BP_Lv2_plunger_Anim_C
// 0x1950 (0x1CA8 - 0x0358)
class UBP_Lv2_plunger_Anim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CAA397834448C6FC93D1F59E42288042; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5EDFD97F4A08111947233AA373864463; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8C1AB9D841829A425433DEAF314DAEBF; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AB703AEF44B9BA91B1F971A3F3468EA6; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E3F3305E4F542E57E099FDAEB395A85C; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2463A57048937DF40333C98B0A979A48; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A79B21034D13AEFB382FB5AE569E613F; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28C203944D1490BF66CCF7AFB9290C83; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5FF478F74A98FE68C3D940AB3A596441; // 0x05A0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8359484B4A3E92BA814250B1A95A4921; // 0x05E8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40F361504A42979461E600AF0C2AB146; // 0x0630(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6F08CDA54A0A502A2FC3578029529A68; // 0x0678(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BADC0DFF4DD4D7A5273EDFA21C46A873; // 0x06C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EFB903B641B1FD767EEB15891A6A3029; // 0x0708(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D0C2649846EA0FB121DC1882646513BB; // 0x0750(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F9E3FBDC43828BA8F6E4CEAF82AFBA94; // 0x0798(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A879A17E45346AEF0993169715DA4437; // 0x0838(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6917FF124B856AF887A9AEAF944A8205; // 0x0878(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_466A30364F50F6259463228D0B3A018D; // 0x0918(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3FCE8BB24FCBE80E73BAB691CACD9DBB; // 0x0958(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B4E7DE4B41C969AF8028789FFDAC9B34; // 0x09F8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B5C614054FC3213467041DB1EAF9A31F; // 0x0A38(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A862D14D4C1A9EBC0429BD89D0541E6B; // 0x0AD8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6031AB0E4667B0B0BE906396C32576F3; // 0x0B18(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8C7DE35B4557AFB70AE1AC96CC5B9772; // 0x0BB8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24E1C1F940F62FA29B3D5B85BCC480FF; // 0x0BF8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A358E950445F6C219655E19064AF14F5; // 0x0C98(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50A12B7842D38A11609DC3BE55C724D6; // 0x0CD8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7562291C49E0EE1DC66D44A8D6838D77; // 0x0D78(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_0E82C1704CA96E97F21BC99D044B29BB; // 0x0DB8(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F0317E1B4163AC06412A08ABE8B57E36; // 0x0EE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B83813BA4FA89336F86CBD918370C151; // 0x0F20(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5DD7F1A847C29D27CEA81F80E1F65D98; // 0x0FC0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B1268464B782BD01D9244AE4D31484A; // 0x1000(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E53F704F4386E4443799B5B56CA3D0E0; // 0x10A0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABA06B284A0B658A363E028889CA09CF; // 0x10E0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_08871EC742FC0010F1BED9A99F5A5147; // 0x1180(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D9A6F014992CEE3F563B189AF9DEE1E; // 0x1220(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B983C08E46890471CE24549D1C2DD1EE; // 0x12C0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_385DF03E4AA42D9380BC6E923B3AEE33; // 0x1360(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1BA3E7ED42B7F640E2C94490EED5FE4B; // 0x1430(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52528966413E24245E95D792EBAEC9CB; // 0x1500(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0D6AC8F547090475781193BD0A1B222B; // 0x15A0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7546353C4F90AC6EAA35378800F55FFC; // 0x1640(0x00A0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_FAEFFBC448C9C594BB4964A830157160; // 0x16E0(0x00E0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5645455A47C9AE55D36645B43807FACA; // 0x17C0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_855C7DC944414E1F5D20ADBC1E166C68; // 0x1800(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_54F4DCCF48264D1E26C49FAB57EB6E29; // 0x18E0(0x0068)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_659E636B46C43430187B3CB0D58DDCD1; // 0x1948(0x00D8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12379A8848E2BBFD3C0AFE8D032D6845; // 0x1A20(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8F838F2043B99880770DB08890BEB385; // 0x1AC0(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4CE7FD5449C84A9C66B962B143116204; // 0x1BF8(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1D9A697C4CE456E79DBEEFB80C81B5F9; // 0x1C38(0x0040)()
	Enum_BehaviorType                             BehaviorState;                                     // 0x1C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C79[0x3];                                     // 0x1C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x1C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandmoBool;                                        // 0x1C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C81[0x3];                                     // 0x1C81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurPatrolWaitTime;                                 // 0x1C84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         XDirection;                                        // 0x1C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv2_NPCAttackstate                        AttackState;                                       // 0x1C8C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C8D[0x3];                                     // 0x1C8D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Ratio;                                             // 0x1C90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x1C94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YDirection;                                        // 0x1C98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Arrived;                                           // 0x1C9C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9D[0x3];                                     // 0x1C9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         beforeSpeed;                                       // 0x1CA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_BADC0DFF4DD4D7A5273EDFA21C46A873();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_6F08CDA54A0A502A2FC3578029529A68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_40F361504A42979461E600AF0C2AB146();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_D0C2649846EA0FB121DC1882646513BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_EFB903B641B1FD767EEB15891A6A3029();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_A79B21034D13AEFB382FB5AE569E613F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_2463A57048937DF40333C98B0A979A48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_8359484B4A3E92BA814250B1A95A4921();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_E3F3305E4F542E57E099FDAEB395A85C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_BlendListByBool_385DF03E4AA42D9380BC6E923B3AEE33();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_SequencePlayer_9B1268464B782BD01D9244AE4D31484A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_AB703AEF44B9BA91B1F971A3F3468EA6();
	void ExecuteUbergraph_BP_Lv2_plunger_Anim(int32 EntryPoint);
	void AnimNotify_FireEnd();
	void BlueprintBeginPlay();
	void AnimNotify_CrouchToIdle();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_5FF478F74A98FE68C3D940AB3A596441();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_28C203944D1490BF66CCF7AFB9290C83();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_ModifyBone_8F838F2043B99880770DB08890BEB385();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_LayeredBoneBlend_659E636B46C43430187B3CB0D58DDCD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_plunger_Anim_AnimGraphNode_TransitionResult_8C1AB9D841829A425433DEAF314DAEBF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv2_plunger_Anim_C">();
	}
	static class UBP_Lv2_plunger_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Lv2_plunger_Anim_C>();
	}
};
static_assert(alignof(UBP_Lv2_plunger_Anim_C) == 0x000008, "Wrong alignment on UBP_Lv2_plunger_Anim_C");
static_assert(sizeof(UBP_Lv2_plunger_Anim_C) == 0x001CA8, "Wrong size on UBP_Lv2_plunger_Anim_C");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, UberGraphFrame) == 0x000360, "Member 'UBP_Lv2_plunger_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_Root_CAA397834448C6FC93D1F59E42288042) == 0x000368, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_Root_CAA397834448C6FC93D1F59E42288042' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_5EDFD97F4A08111947233AA373864463) == 0x0003A8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_5EDFD97F4A08111947233AA373864463' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_8C1AB9D841829A425433DEAF314DAEBF) == 0x0003F0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_8C1AB9D841829A425433DEAF314DAEBF' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_AB703AEF44B9BA91B1F971A3F3468EA6) == 0x000438, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_AB703AEF44B9BA91B1F971A3F3468EA6' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_E3F3305E4F542E57E099FDAEB395A85C) == 0x000480, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_E3F3305E4F542E57E099FDAEB395A85C' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_2463A57048937DF40333C98B0A979A48) == 0x0004C8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_2463A57048937DF40333C98B0A979A48' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_A79B21034D13AEFB382FB5AE569E613F) == 0x000510, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_A79B21034D13AEFB382FB5AE569E613F' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_28C203944D1490BF66CCF7AFB9290C83) == 0x000558, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_28C203944D1490BF66CCF7AFB9290C83' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_5FF478F74A98FE68C3D940AB3A596441) == 0x0005A0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_5FF478F74A98FE68C3D940AB3A596441' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_8359484B4A3E92BA814250B1A95A4921) == 0x0005E8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_8359484B4A3E92BA814250B1A95A4921' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_40F361504A42979461E600AF0C2AB146) == 0x000630, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_40F361504A42979461E600AF0C2AB146' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_6F08CDA54A0A502A2FC3578029529A68) == 0x000678, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_6F08CDA54A0A502A2FC3578029529A68' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_BADC0DFF4DD4D7A5273EDFA21C46A873) == 0x0006C0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_BADC0DFF4DD4D7A5273EDFA21C46A873' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_EFB903B641B1FD767EEB15891A6A3029) == 0x000708, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_EFB903B641B1FD767EEB15891A6A3029' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_TransitionResult_D0C2649846EA0FB121DC1882646513BB) == 0x000750, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_TransitionResult_D0C2649846EA0FB121DC1882646513BB' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_F9E3FBDC43828BA8F6E4CEAF82AFBA94) == 0x000798, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_F9E3FBDC43828BA8F6E4CEAF82AFBA94' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_A879A17E45346AEF0993169715DA4437) == 0x000838, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_A879A17E45346AEF0993169715DA4437' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_6917FF124B856AF887A9AEAF944A8205) == 0x000878, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_6917FF124B856AF887A9AEAF944A8205' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_466A30364F50F6259463228D0B3A018D) == 0x000918, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_466A30364F50F6259463228D0B3A018D' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_3FCE8BB24FCBE80E73BAB691CACD9DBB) == 0x000958, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_3FCE8BB24FCBE80E73BAB691CACD9DBB' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_B4E7DE4B41C969AF8028789FFDAC9B34) == 0x0009F8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_B4E7DE4B41C969AF8028789FFDAC9B34' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_B5C614054FC3213467041DB1EAF9A31F) == 0x000A38, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_B5C614054FC3213467041DB1EAF9A31F' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_A862D14D4C1A9EBC0429BD89D0541E6B) == 0x000AD8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_A862D14D4C1A9EBC0429BD89D0541E6B' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_6031AB0E4667B0B0BE906396C32576F3) == 0x000B18, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_6031AB0E4667B0B0BE906396C32576F3' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_8C7DE35B4557AFB70AE1AC96CC5B9772) == 0x000BB8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_8C7DE35B4557AFB70AE1AC96CC5B9772' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_24E1C1F940F62FA29B3D5B85BCC480FF) == 0x000BF8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_24E1C1F940F62FA29B3D5B85BCC480FF' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_A358E950445F6C219655E19064AF14F5) == 0x000C98, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_A358E950445F6C219655E19064AF14F5' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_50A12B7842D38A11609DC3BE55C724D6) == 0x000CD8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_50A12B7842D38A11609DC3BE55C724D6' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_7562291C49E0EE1DC66D44A8D6838D77) == 0x000D78, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_7562291C49E0EE1DC66D44A8D6838D77' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_BlendSpacePlayer_0E82C1704CA96E97F21BC99D044B29BB) == 0x000DB8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_BlendSpacePlayer_0E82C1704CA96E97F21BC99D044B29BB' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_F0317E1B4163AC06412A08ABE8B57E36) == 0x000EE0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_F0317E1B4163AC06412A08ABE8B57E36' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_B83813BA4FA89336F86CBD918370C151) == 0x000F20, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_B83813BA4FA89336F86CBD918370C151' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_5DD7F1A847C29D27CEA81F80E1F65D98) == 0x000FC0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_5DD7F1A847C29D27CEA81F80E1F65D98' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_9B1268464B782BD01D9244AE4D31484A) == 0x001000, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_9B1268464B782BD01D9244AE4D31484A' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_E53F704F4386E4443799B5B56CA3D0E0) == 0x0010A0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_E53F704F4386E4443799B5B56CA3D0E0' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_ABA06B284A0B658A363E028889CA09CF) == 0x0010E0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_ABA06B284A0B658A363E028889CA09CF' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_08871EC742FC0010F1BED9A99F5A5147) == 0x001180, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_08871EC742FC0010F1BED9A99F5A5147' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_1D9A6F014992CEE3F563B189AF9DEE1E) == 0x001220, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_1D9A6F014992CEE3F563B189AF9DEE1E' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_B983C08E46890471CE24549D1C2DD1EE) == 0x0012C0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_B983C08E46890471CE24549D1C2DD1EE' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_BlendListByBool_385DF03E4AA42D9380BC6E923B3AEE33) == 0x001360, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_BlendListByBool_385DF03E4AA42D9380BC6E923B3AEE33' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_BlendListByBool_1BA3E7ED42B7F640E2C94490EED5FE4B) == 0x001430, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_BlendListByBool_1BA3E7ED42B7F640E2C94490EED5FE4B' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_52528966413E24245E95D792EBAEC9CB) == 0x001500, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_52528966413E24245E95D792EBAEC9CB' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_0D6AC8F547090475781193BD0A1B222B) == 0x0015A0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_0D6AC8F547090475781193BD0A1B222B' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_7546353C4F90AC6EAA35378800F55FFC) == 0x001640, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_7546353C4F90AC6EAA35378800F55FFC' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_BlendListByEnum_FAEFFBC448C9C594BB4964A830157160) == 0x0016E0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_BlendListByEnum_FAEFFBC448C9C594BB4964A830157160' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateResult_5645455A47C9AE55D36645B43807FACA) == 0x0017C0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateResult_5645455A47C9AE55D36645B43807FACA' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_StateMachine_855C7DC944414E1F5D20ADBC1E166C68) == 0x001800, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_StateMachine_855C7DC944414E1F5D20ADBC1E166C68' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_Slot_54F4DCCF48264D1E26C49FAB57EB6E29) == 0x0018E0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_Slot_54F4DCCF48264D1E26C49FAB57EB6E29' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_LayeredBoneBlend_659E636B46C43430187B3CB0D58DDCD1) == 0x001948, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_LayeredBoneBlend_659E636B46C43430187B3CB0D58DDCD1' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_SequencePlayer_12379A8848E2BBFD3C0AFE8D032D6845) == 0x001A20, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_SequencePlayer_12379A8848E2BBFD3C0AFE8D032D6845' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_ModifyBone_8F838F2043B99880770DB08890BEB385) == 0x001AC0, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_ModifyBone_8F838F2043B99880770DB08890BEB385' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_LocalToComponentSpace_4CE7FD5449C84A9C66B962B143116204) == 0x001BF8, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_LocalToComponentSpace_4CE7FD5449C84A9C66B962B143116204' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AnimGraphNode_ComponentToLocalSpace_1D9A697C4CE456E79DBEEFB80C81B5F9) == 0x001C38, "Member 'UBP_Lv2_plunger_Anim_C::AnimGraphNode_ComponentToLocalSpace_1D9A697C4CE456E79DBEEFB80C81B5F9' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, BehaviorState) == 0x001C78, "Member 'UBP_Lv2_plunger_Anim_C::BehaviorState' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, Speed) == 0x001C7C, "Member 'UBP_Lv2_plunger_Anim_C::Speed' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, RandmoBool) == 0x001C80, "Member 'UBP_Lv2_plunger_Anim_C::RandmoBool' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, CurPatrolWaitTime) == 0x001C84, "Member 'UBP_Lv2_plunger_Anim_C::CurPatrolWaitTime' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, XDirection) == 0x001C88, "Member 'UBP_Lv2_plunger_Anim_C::XDirection' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, AttackState) == 0x001C8C, "Member 'UBP_Lv2_plunger_Anim_C::AttackState' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, Ratio) == 0x001C90, "Member 'UBP_Lv2_plunger_Anim_C::Ratio' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, Rate) == 0x001C94, "Member 'UBP_Lv2_plunger_Anim_C::Rate' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, YDirection) == 0x001C98, "Member 'UBP_Lv2_plunger_Anim_C::YDirection' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, Arrived) == 0x001C9C, "Member 'UBP_Lv2_plunger_Anim_C::Arrived' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_plunger_Anim_C, beforeSpeed) == 0x001CA0, "Member 'UBP_Lv2_plunger_Anim_C::beforeSpeed' has a wrong offset!");

}

