#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_RightHand_Car

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Lv2_LeftHand_Car_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lv2_RightHand_Car.BP_Lv2_RightHand_Car_C
// 0x0020 (0x0600 - 0x05E0)
class ABP_Lv2_RightHand_Car_C final : public ABP_Lv2_LeftHand_Car_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Lv2_RightHand_Car_C;             // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               Init;                                              // 0x05E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                InitLocation;                                      // 0x05F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Lv2_RightHand_Car(int32 EntryPoint);
	void Clpi(class USceneComponent* NewParam);
	void ReceiveBeginPlay();
	void PullTrigger();
	void ReleaseTrigger();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv2_RightHand_Car_C">();
	}
	static class ABP_Lv2_RightHand_Car_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lv2_RightHand_Car_C>();
	}
};
static_assert(alignof(ABP_Lv2_RightHand_Car_C) == 0x000010, "Wrong alignment on ABP_Lv2_RightHand_Car_C");
static_assert(sizeof(ABP_Lv2_RightHand_Car_C) == 0x000600, "Wrong size on ABP_Lv2_RightHand_Car_C");
static_assert(offsetof(ABP_Lv2_RightHand_Car_C, UberGraphFrame_BP_Lv2_RightHand_Car_C) == 0x0005E0, "Member 'ABP_Lv2_RightHand_Car_C::UberGraphFrame_BP_Lv2_RightHand_Car_C' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_RightHand_Car_C, Init) == 0x0005E8, "Member 'ABP_Lv2_RightHand_Car_C::Init' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_RightHand_Car_C, InitLocation) == 0x0005F4, "Member 'ABP_Lv2_RightHand_Car_C::InitLocation' has a wrong offset!");

}

