#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_TargetPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Lv2_TargetPoint.BP_Lv2_TargetPoint_C.ExecuteUbergraph_BP_Lv2_TargetPoint
// 0x0008 (0x0008 - 0x0000)
struct BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint) == 0x000004, "Wrong alignment on BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint");
static_assert(sizeof(BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint) == 0x000008, "Wrong size on BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint");
static_assert(offsetof(BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint, EntryPoint) == 0x000000, "Member 'BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Lv2_TargetPoint_C_ExecuteUbergraph_BP_Lv2_TargetPoint::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_Lv2_TargetPoint.BP_Lv2_TargetPoint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv2_TargetPoint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_TargetPoint_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Lv2_TargetPoint_C_ReceiveTick");
static_assert(sizeof(BP_Lv2_TargetPoint_C_ReceiveTick) == 0x000004, "Wrong size on BP_Lv2_TargetPoint_C_ReceiveTick");
static_assert(offsetof(BP_Lv2_TargetPoint_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Lv2_TargetPoint_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Lv2_TargetPoint.BP_Lv2_TargetPoint_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Lv2_TargetPoint_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0098(0x0018)()
};
static_assert(alignof(BP_Lv2_TargetPoint_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Lv2_TargetPoint_C_UserConstructionScript");
static_assert(sizeof(BP_Lv2_TargetPoint_C_UserConstructionScript) == 0x0000B0, "Wrong size on BP_Lv2_TargetPoint_C_UserConstructionScript");
static_assert(offsetof(BP_Lv2_TargetPoint_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000000, "Member 'BP_Lv2_TargetPoint_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv2_TargetPoint_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000088, "Member 'BP_Lv2_TargetPoint_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_TargetPoint_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x000098, "Member 'BP_Lv2_TargetPoint_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

