#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv4_RightHand

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Lv4_RightHand.BP_Lv4_RightHand_C.ExecuteUbergraph_BP_Lv4_RightHand
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand) == 0x000004, "Wrong alignment on BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand");
static_assert(sizeof(BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand) == 0x000004, "Wrong size on BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand");
static_assert(offsetof(BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand, EntryPoint) == 0x000000, "Member 'BP_Lv4_RightHand_C_ExecuteUbergraph_BP_Lv4_RightHand::EntryPoint' has a wrong offset!");

// Function BP_Lv4_RightHand.BP_Lv4_RightHand_C.Flip
// 0x0150 (0x0150 - 0x0000)
struct BP_Lv4_RightHand_C_Flip final
{
public:
	class USceneComponent*                        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0018(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Lv4_RightHand_C_Flip) == 0x000008, "Wrong alignment on BP_Lv4_RightHand_C_Flip");
static_assert(sizeof(BP_Lv4_RightHand_C_Flip) == 0x000150, "Wrong size on BP_Lv4_RightHand_C_Flip");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, Widget) == 0x000000, "Member 'BP_Lv4_RightHand_C_Flip::Widget' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_Add_VectorVector_ReturnValue) == 0x000008, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000018, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_BreakVector_X) == 0x0000A0, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_ComposeRotators_ReturnValue) == 0x0000B0, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_RightHand_C_Flip, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000C8, "Member 'BP_Lv4_RightHand_C_Flip::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

}

