#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_plunger_Anim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Lv2_plunger_Anim.BP_Lv2_plunger_Anim_C.ExecuteUbergraph_BP_Lv2_plunger_Anim
// 0x0160 (0x0160 - 0x0000)
struct BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue3;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue4;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue5;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue6;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue7;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue8;        // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Locations_Distance;      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue9;        // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue7;         // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue8;         // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase1;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue2;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase2;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue9;         // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim) == 0x000008, "Wrong alignment on BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim");
static_assert(sizeof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim) == 0x000160, "Wrong size on BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, EntryPoint) == 0x000000, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000010, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000013, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000015, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000018, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanOR_ReturnValue1) == 0x00001C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x00001D, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00001F, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000020, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanAND_ReturnValue1) == 0x000021, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000022, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1) == 0x000024, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue2) == 0x000028, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2) == 0x00002C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue3) == 0x000030, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3) == 0x000034, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue4) == 0x000038, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue5) == 0x000039, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue6) == 0x00003A, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4) == 0x000040, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue7) == 0x000044, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x000045, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue8) == 0x000046, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x000047, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000048, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00004C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue6) == 0x000050, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_Event_DeltaTimeX) == 0x000054, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000060, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_FClamp_ReturnValue) == 0x000068, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_AsBP_Lv_2_NPCBase) == 0x000070, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_AsBP_Lv_2_NPCBase' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_MakeRotator_ReturnValue) == 0x00007C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetValueAsVector_ReturnValue) == 0x000088, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetVelocity_ReturnValue) == 0x000094, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_VSize_ReturnValue) == 0x0000A0, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Not_PreBool_ReturnValue) == 0x0000A4, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Distance_Between_Locations_Distance) == 0x0000B4, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Distance_Between_Locations_Distance' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x0000B8, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue9) == 0x0000C4, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000C8, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Roll) == 0x0000D4, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Pitch) == 0x0000D8, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Yaw) == 0x0000DC, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000E0, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_GetControlRotation_ReturnValue) == 0x0000EC, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000F8, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Roll1) == 0x000104, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Pitch1) == 0x000108, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BreakRotator_Yaw1) == 0x00010C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_RandomBool_ReturnValue) == 0x000110, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue7) == 0x000111, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue8) == 0x000112, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_TryGetPawnOwner_ReturnValue1) == 0x000118, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_TryGetPawnOwner_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_AsBP_Lv_2_NPCBase1) == 0x000120, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_AsBP_Lv_2_NPCBase1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_bSuccess1) == 0x000128, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x00012C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Abs_ReturnValue) == 0x000130, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000134, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000138, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x00013C, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_FClamp_ReturnValue1) == 0x000140, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_FClamp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_TryGetPawnOwner_ReturnValue2) == 0x000148, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_TryGetPawnOwner_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_AsBP_Lv_2_NPCBase2) == 0x000150, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_AsBP_Lv_2_NPCBase2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, K2Node_DynamicCast_bSuccess2) == 0x000158, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue9) == 0x000159, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanOR_ReturnValue2) == 0x00015A, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim, CallFunc_BooleanAND_ReturnValue2) == 0x00015B, "Member 'BP_Lv2_plunger_Anim_C_ExecuteUbergraph_BP_Lv2_plunger_Anim::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");

// Function BP_Lv2_plunger_Anim.BP_Lv2_plunger_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_Lv2_plunger_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

