#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_Sniper_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "BE_Lv2_NPCAttackstate_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_Lv2_Sniper_Anim.BP_Lv2_Sniper_Anim_C
// 0x0938 (0x0C90 - 0x0358)
class UBP_Lv2_Sniper_Anim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_24F37C8D42E40E85F369A4999BE8CFC8; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6B11718E4551FC4FD4FC318584347642; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C7D37ABF449CA8B0ECE37BB1A92ECE5B; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68E3D7A9415BCF460BD43F94FD9677B8; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49D5B053405CEAE8338E20B3D3A25DB4; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D4EEB801495DCFD608B625A394D30842; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D9C04CED455F6618C740DBA9C274CF67; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A55A11944D09CDCC86A5DD97556D0461; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F389D3904A9AF385168BD38C4D9205F9; // 0x05A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D2A5F81F42FB7577AD9C0A89B7550A73; // 0x05E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12243602402F023DB3B6C3BA1D48034F; // 0x0688(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_957A2D1E4FA17A3CCDA46D966B7718E8; // 0x06C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D20E2DE541C5FEA982960595CAC30709; // 0x0768(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_01E37B9E4CF206F2DCFC3983742709A8; // 0x07A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21B546F64D4657D103DC3D9DF10A9476; // 0x0848(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8983B2BF41C9592B534F83A3AB1BC345; // 0x0888(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_C0C711E64EC94B8E91D96EB5A9EE1B0C; // 0x0928(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_850952FA4D82BF3824973E82B3EDC945; // 0x0968(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37825A644E4685EE1267F58740E5DC5F; // 0x0A08(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_196049044D6ED3DC47F1B3B61BC2BC6B; // 0x0A48(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_96AD3D2C4ABD21D453454CB7DAFB1B5D; // 0x0AE8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_CD8F9B914AC8B346A3E51283CF700DF4; // 0x0B28(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3E8163DF4B64301515E8B2829BA45993; // 0x0C08(0x0068)()
	Enum_BehaviorType                             BehaviorState;                                     // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandmoBool;                                        // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C79[0x3];                                      // 0x0C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurPatrolWaitTime;                                 // 0x0C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0C80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFire;                                            // 0x0C84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EBE_Lv2_NPCAttackstate                        AttackState;                                       // 0x0C85(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C86[0x2];                                      // 0x0C86(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Ratio;                                             // 0x0C88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rate;                                              // 0x0C8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_D9C04CED455F6618C740DBA9C274CF67();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_D4EEB801495DCFD608B625A394D30842();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_49D5B053405CEAE8338E20B3D3A25DB4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_F389D3904A9AF385168BD38C4D9205F9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_A55A11944D09CDCC86A5DD97556D0461();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_C7D37ABF449CA8B0ECE37BB1A92ECE5B();
	void ExecuteUbergraph_BP_Lv2_Sniper_Anim(int32 EntryPoint);
	void BlueprintBeginPlay();
	void AnimNotify_CrouchToIdle();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_68E3D7A9415BCF460BD43F94FD9677B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_Lv2_Sniper_Anim_AnimGraphNode_TransitionResult_6B11718E4551FC4FD4FC318584347642();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv2_Sniper_Anim_C">();
	}
	static class UBP_Lv2_Sniper_Anim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Lv2_Sniper_Anim_C>();
	}
};
static_assert(alignof(UBP_Lv2_Sniper_Anim_C) == 0x000008, "Wrong alignment on UBP_Lv2_Sniper_Anim_C");
static_assert(sizeof(UBP_Lv2_Sniper_Anim_C) == 0x000C90, "Wrong size on UBP_Lv2_Sniper_Anim_C");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, UberGraphFrame) == 0x000360, "Member 'UBP_Lv2_Sniper_Anim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_Root_24F37C8D42E40E85F369A4999BE8CFC8) == 0x000368, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_Root_24F37C8D42E40E85F369A4999BE8CFC8' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_6B11718E4551FC4FD4FC318584347642) == 0x0003A8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_6B11718E4551FC4FD4FC318584347642' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_C7D37ABF449CA8B0ECE37BB1A92ECE5B) == 0x0003F0, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_C7D37ABF449CA8B0ECE37BB1A92ECE5B' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_68E3D7A9415BCF460BD43F94FD9677B8) == 0x000438, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_68E3D7A9415BCF460BD43F94FD9677B8' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_49D5B053405CEAE8338E20B3D3A25DB4) == 0x000480, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_49D5B053405CEAE8338E20B3D3A25DB4' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_D4EEB801495DCFD608B625A394D30842) == 0x0004C8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_D4EEB801495DCFD608B625A394D30842' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_D9C04CED455F6618C740DBA9C274CF67) == 0x000510, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_D9C04CED455F6618C740DBA9C274CF67' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_A55A11944D09CDCC86A5DD97556D0461) == 0x000558, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_A55A11944D09CDCC86A5DD97556D0461' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_TransitionResult_F389D3904A9AF385168BD38C4D9205F9) == 0x0005A0, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_TransitionResult_F389D3904A9AF385168BD38C4D9205F9' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_D2A5F81F42FB7577AD9C0A89B7550A73) == 0x0005E8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_D2A5F81F42FB7577AD9C0A89B7550A73' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_12243602402F023DB3B6C3BA1D48034F) == 0x000688, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_12243602402F023DB3B6C3BA1D48034F' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_957A2D1E4FA17A3CCDA46D966B7718E8) == 0x0006C8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_957A2D1E4FA17A3CCDA46D966B7718E8' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_D20E2DE541C5FEA982960595CAC30709) == 0x000768, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_D20E2DE541C5FEA982960595CAC30709' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_01E37B9E4CF206F2DCFC3983742709A8) == 0x0007A8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_01E37B9E4CF206F2DCFC3983742709A8' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_21B546F64D4657D103DC3D9DF10A9476) == 0x000848, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_21B546F64D4657D103DC3D9DF10A9476' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_8983B2BF41C9592B534F83A3AB1BC345) == 0x000888, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_8983B2BF41C9592B534F83A3AB1BC345' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_C0C711E64EC94B8E91D96EB5A9EE1B0C) == 0x000928, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_C0C711E64EC94B8E91D96EB5A9EE1B0C' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_850952FA4D82BF3824973E82B3EDC945) == 0x000968, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_850952FA4D82BF3824973E82B3EDC945' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_37825A644E4685EE1267F58740E5DC5F) == 0x000A08, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_37825A644E4685EE1267F58740E5DC5F' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_SequencePlayer_196049044D6ED3DC47F1B3B61BC2BC6B) == 0x000A48, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_SequencePlayer_196049044D6ED3DC47F1B3B61BC2BC6B' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateResult_96AD3D2C4ABD21D453454CB7DAFB1B5D) == 0x000AE8, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateResult_96AD3D2C4ABD21D453454CB7DAFB1B5D' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_StateMachine_CD8F9B914AC8B346A3E51283CF700DF4) == 0x000B28, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_StateMachine_CD8F9B914AC8B346A3E51283CF700DF4' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AnimGraphNode_Slot_3E8163DF4B64301515E8B2829BA45993) == 0x000C08, "Member 'UBP_Lv2_Sniper_Anim_C::AnimGraphNode_Slot_3E8163DF4B64301515E8B2829BA45993' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, BehaviorState) == 0x000C70, "Member 'UBP_Lv2_Sniper_Anim_C::BehaviorState' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, Speed) == 0x000C74, "Member 'UBP_Lv2_Sniper_Anim_C::Speed' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, RandmoBool) == 0x000C78, "Member 'UBP_Lv2_Sniper_Anim_C::RandmoBool' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, CurPatrolWaitTime) == 0x000C7C, "Member 'UBP_Lv2_Sniper_Anim_C::CurPatrolWaitTime' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, Direction) == 0x000C80, "Member 'UBP_Lv2_Sniper_Anim_C::Direction' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, IsFire) == 0x000C84, "Member 'UBP_Lv2_Sniper_Anim_C::IsFire' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, AttackState) == 0x000C85, "Member 'UBP_Lv2_Sniper_Anim_C::AttackState' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, Ratio) == 0x000C88, "Member 'UBP_Lv2_Sniper_Anim_C::Ratio' has a wrong offset!");
static_assert(offsetof(UBP_Lv2_Sniper_Anim_C, Rate) == 0x000C8C, "Member 'UBP_Lv2_Sniper_Anim_C::Rate' has a wrong offset!");

}

