#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_lv3_ActiveBox

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_lv3_ActiveBox.BP_lv3_ActiveBox_C.ExecuteUbergraph_BP_lv3_ActiveBox
// 0x02A8 (0x02A8 - 0x0000)
struct BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv3_Wave_C*                         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool FromSweep, const struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate; // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0080(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AVehicle_MC_C*                          K2Node_DynamicCast_AsVehicle_MC;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv3_Wave_C*                         CallFunc_Array_Get_Item1;                          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALv4_PrisonCar_C*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	class ALv4_PrisonCar_C*                       CallFunc_Array_Get_Item2;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_FromSweep;                      // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x01A8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_Lv3_BaseCar_C*                      K2Node_DynamicCast_AsBP_Lv_3_Base_Car;             // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AVehicle_MC_C*                          K2Node_DynamicCast_AsVehicle_MC1;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox) == 0x000008, "Wrong alignment on BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox");
static_assert(sizeof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox) == 0x0002A8, "Wrong size on BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, EntryPoint) == 0x000000, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, Temp_int_Variable) == 0x000008, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Conv_IntToString_ReturnValue) == 0x000010, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Concat_StrStr_ReturnValue) == 0x000020, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Add_IntInt_ReturnValue1) == 0x00003C, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000060, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_OtherActor) == 0x000068, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_OtherComp) == 0x000070, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000078, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_bFromSweep) == 0x00007C, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_ComponentBoundEvent_SweepResult) == 0x000080, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_AsVehicle_MC) == 0x000108, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_AsVehicle_MC' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Array_Get_Item1) == 0x000118, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, Temp_bool_Has_Been_Initd_Variable) == 0x000120, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Conv_FloatToString_ReturnValue) == 0x000128, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_GetGameState_ReturnValue) == 0x000138, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_AsMer_2Game_State) == 0x000140, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_AsMer_2Game_State' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_bSuccess1) == 0x000148, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Array_Length_ReturnValue1) == 0x00014C, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000150, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Subtract_IntInt_ReturnValue) == 0x000154, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Subtract_IntInt_ReturnValue1) == 0x000158, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Subtract_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_LessEqual_IntInt_ReturnValue1) == 0x00015C, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_LessEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_GetAllActorsOfClass_OutActors) == 0x000160, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Array_Get_Item2) == 0x000170, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_GetDistanceTo_ReturnValue) == 0x00017C, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000180, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_IsValid_ReturnValue1) == 0x000181, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, Temp_bool_IsClosed_Variable) == 0x000182, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_OverlappedComponent) == 0x000188, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_OtherActor) == 0x000190, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_OtherComp) == 0x000198, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_OtherBodyIndex) == 0x0001A0, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_FromSweep) == 0x0001A4, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_FromSweep' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_CustomEvent_SweepResult) == 0x0001A8, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_AsBP_Lv_3_Base_Car) == 0x000230, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_AsBP_Lv_3_Base_Car' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_bSuccess2) == 0x000238, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_GetDisplayName_ReturnValue) == 0x000240, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_BreakVector2D_X) == 0x000250, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_BreakVector2D_Y) == 0x000254, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Concat_StrStr_ReturnValue1) == 0x000258, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000268, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Concat_StrStr_ReturnValue2) == 0x000270, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_SelectFloat_ReturnValue) == 0x000280, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_Concat_StrStr_ReturnValue3) == 0x000288, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_AsVehicle_MC1) == 0x000298, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_AsVehicle_MC1' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, K2Node_DynamicCast_bSuccess3) == 0x0002A0, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002A1, "Member 'BP_lv3_ActiveBox_C_ExecuteUbergraph_BP_lv3_ActiveBox::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_lv3_ActiveBox.BP_lv3_ActiveBox_C.OnOverlap_Event_0
// 0x00A8 (0x00A8 - 0x0000)
struct BP_lv3_ActiveBox_C_OnOverlap_Event_0 final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FromSweep;                                         // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_lv3_ActiveBox_C_OnOverlap_Event_0) == 0x000008, "Wrong alignment on BP_lv3_ActiveBox_C_OnOverlap_Event_0");
static_assert(sizeof(BP_lv3_ActiveBox_C_OnOverlap_Event_0) == 0x0000A8, "Wrong size on BP_lv3_ActiveBox_C_OnOverlap_Event_0");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, OverlappedComponent) == 0x000000, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, OtherActor) == 0x000008, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, OtherComp) == 0x000010, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, OtherBodyIndex) == 0x000018, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, FromSweep) == 0x00001C, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::FromSweep' has a wrong offset!");
static_assert(offsetof(BP_lv3_ActiveBox_C_OnOverlap_Event_0, SweepResult) == 0x000020, "Member 'BP_lv3_ActiveBox_C_OnOverlap_Event_0::SweepResult' has a wrong offset!");

// Function BP_lv3_ActiveBox.BP_lv3_ActiveBox_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_lv3_ActiveBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_lv3_ActiveBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_lv3_ActiveBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_lv3_ActiveBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_lv3_ActiveBox_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
