#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv4_TargetActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lv4_TargetActor.BP_Lv4_TargetActor_C
// 0x0060 (0x0388 - 0x0328)
class ABP_Lv4_TargetActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_NVSplineMesh_C*                     Road;                                              // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Ratio;                                             // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv4BaseCar_C*                       PrisonCar;                                         // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv4BaseCar_C*                       PlayerCar;                                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnOverLaped;                                       // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Lv4_TargetActor(int32 EntryPoint);
	void CheatAdd();
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv4_TargetActor_C">();
	}
	static class ABP_Lv4_TargetActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lv4_TargetActor_C>();
	}
};
static_assert(alignof(ABP_Lv4_TargetActor_C) == 0x000008, "Wrong alignment on ABP_Lv4_TargetActor_C");
static_assert(sizeof(ABP_Lv4_TargetActor_C) == 0x000388, "Wrong size on ABP_Lv4_TargetActor_C");
static_assert(offsetof(ABP_Lv4_TargetActor_C, UberGraphFrame) == 0x000328, "Member 'ABP_Lv4_TargetActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, TextRender) == 0x000330, "Member 'ABP_Lv4_TargetActor_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, Box) == 0x000338, "Member 'ABP_Lv4_TargetActor_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, StaticMesh) == 0x000340, "Member 'ABP_Lv4_TargetActor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, Scene) == 0x000348, "Member 'ABP_Lv4_TargetActor_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, Road) == 0x000350, "Member 'ABP_Lv4_TargetActor_C::Road' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, Ratio) == 0x000358, "Member 'ABP_Lv4_TargetActor_C::Ratio' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, PrisonCar) == 0x000360, "Member 'ABP_Lv4_TargetActor_C::PrisonCar' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, Distance) == 0x000368, "Member 'ABP_Lv4_TargetActor_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, PlayerCar) == 0x000370, "Member 'ABP_Lv4_TargetActor_C::PlayerCar' has a wrong offset!");
static_assert(offsetof(ABP_Lv4_TargetActor_C, OnOverLaped) == 0x000378, "Member 'ABP_Lv4_TargetActor_C::OnOverLaped' has a wrong offset!");

}

