#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_AlertSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lv2_AlertSound.BP_Lv2_AlertSound_C
// 0x0018 (0x0340 - 0x0328)
class ABP_Lv2_AlertSound_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlay;                                            // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Lv2_AlertSound(int32 EntryPoint);
	void PLaySiren();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv2_AlertSound_C">();
	}
	static class ABP_Lv2_AlertSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lv2_AlertSound_C>();
	}
};
static_assert(alignof(ABP_Lv2_AlertSound_C) == 0x000008, "Wrong alignment on ABP_Lv2_AlertSound_C");
static_assert(sizeof(ABP_Lv2_AlertSound_C) == 0x000340, "Wrong size on ABP_Lv2_AlertSound_C");
static_assert(offsetof(ABP_Lv2_AlertSound_C, UberGraphFrame) == 0x000328, "Member 'ABP_Lv2_AlertSound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_AlertSound_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_Lv2_AlertSound_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_AlertSound_C, IsPlay) == 0x000338, "Member 'ABP_Lv2_AlertSound_C::IsPlay' has a wrong offset!");

}

