#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv4_TargetActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Lv4_TargetActor.BP_Lv4_TargetActor_C.ExecuteUbergraph_BP_Lv4_TargetActor
// 0x0260 (0x0260 - 0x0000)
struct BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0038(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVehicle_MC_C*                          K2Node_DynamicCast_AsVehicle_MC;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALv4_AttackCarBase_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class ALv4_AttackCarBase_C*                   CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0xC];                                      // 0x0174(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x01B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor) == 0x000010, "Wrong alignment on BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor");
static_assert(sizeof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor) == 0x000260, "Wrong size on BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, EntryPoint) == 0x000000, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, Temp_bool_Has_Been_Initd_Variable) == 0x000010, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000018, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_OtherActor) == 0x000020, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_OtherComp) == 0x000028, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000030, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_bFromSweep) == 0x000034, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_ComponentBoundEvent_SweepResult) == 0x000038, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, Temp_bool_IsClosed_Variable) == 0x0000C0, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_AsVehicle_MC) == 0x0000C8, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_AsVehicle_MC' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000D8, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Array_Length_ReturnValue) == 0x0000F0, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Array_Length_ReturnValue1) == 0x0000F8, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Greater_IntInt_ReturnValue) == 0x0000FC, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_GetGameInstance_ReturnValue) == 0x000100, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_GetSplineLength_ReturnValue) == 0x000108, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000110, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00011C, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000120, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_BreakTransform_Location) == 0x000150, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_BreakTransform_Rotation) == 0x00015C, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_BreakTransform_Scale) == 0x000168, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_MakeTransform_ReturnValue) == 0x000180, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0001B0, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000238, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_GetGameInstance_ReturnValue1) == 0x000240, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000248, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, K2Node_DynamicCast_bSuccess2) == 0x000250, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000251, "Member 'BP_Lv4_TargetActor_C_ExecuteUbergraph_BP_Lv4_TargetActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_Lv4_TargetActor.BP_Lv4_TargetActor_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Lv4_TargetActor_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Lv4_TargetActor.BP_Lv4_TargetActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv4_TargetActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv4_TargetActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Lv4_TargetActor_C_ReceiveTick");
static_assert(sizeof(BP_Lv4_TargetActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_Lv4_TargetActor_C_ReceiveTick");
static_assert(offsetof(BP_Lv4_TargetActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Lv4_TargetActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Lv4_TargetActor.BP_Lv4_TargetActor_C.UserConstructionScript
// 0x0140 (0x0140 - 0x0000)
struct BP_Lv4_TargetActor_C_UserConstructionScript final
{
public:
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0000(0x0018)()
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0xC];                                       // 0x0074(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv4_TargetActor_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Lv4_TargetActor_C_UserConstructionScript");
static_assert(sizeof(BP_Lv4_TargetActor_C_UserConstructionScript) == 0x000140, "Wrong size on BP_Lv4_TargetActor_C_UserConstructionScript");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_Conv_FloatToText_ReturnValue) == 0x000000, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x000018, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000B0, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv4_TargetActor_C_UserConstructionScript, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000138, "Member 'BP_Lv4_TargetActor_C_UserConstructionScript::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

}

