#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_LeftHand

#include "Basic.hpp"

#include "BPDefaultHand_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Lv2_LeftHand.BP_Lv2_LeftHand_C
// 0x0010 (0x05E0 - 0x05D0)
class ABP_Lv2_LeftHand_C : public ABPDefaultHand_C
{
public:
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Lv2_LeftHand_C;                  // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsbothHold;                                        // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsNeedChangeMesh;                                  // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Lv2_LeftHand(int32 EntryPoint);
	void ReverseHand(bool IsNormal);
	void ReceiveTick(float DeltaSeconds);
	void PullTrigger();
	void ReleaseTrigger();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Lv2_LeftHand_C">();
	}
	static class ABP_Lv2_LeftHand_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Lv2_LeftHand_C>();
	}
};
static_assert(alignof(ABP_Lv2_LeftHand_C) == 0x000010, "Wrong alignment on ABP_Lv2_LeftHand_C");
static_assert(sizeof(ABP_Lv2_LeftHand_C) == 0x0005E0, "Wrong size on ABP_Lv2_LeftHand_C");
static_assert(offsetof(ABP_Lv2_LeftHand_C, UberGraphFrame_BP_Lv2_LeftHand_C) == 0x0005D0, "Member 'ABP_Lv2_LeftHand_C::UberGraphFrame_BP_Lv2_LeftHand_C' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_LeftHand_C, IsbothHold) == 0x0005D8, "Member 'ABP_Lv2_LeftHand_C::IsbothHold' has a wrong offset!");
static_assert(offsetof(ABP_Lv2_LeftHand_C, IsNeedChangeMesh) == 0x0005D9, "Member 'ABP_Lv2_LeftHand_C::IsNeedChangeMesh' has a wrong offset!");

}

