#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Lv2_Gia

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BE_Lv2_GiaAnim_structs.hpp"
#include "Engine_structs.hpp"
#include "GameState_structs.hpp"


namespace SDK::Params
{

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.ExecuteUbergraph_BP_Lv2_Gia
// 0x03B0 (0x03B0 - 0x0000)
struct BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSniperAimDirection_Direction;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ComponentBoundEvent_Pawn;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LV2_plunger_C*                      K2Node_DynamicCast_AsBP_LV2_Plunger;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameState                                    K2Node_CustomEvent_gamestate;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0150(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x01F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_characterBase_C*                K2Node_DynamicCast_AsBP_Lv_2_Character_Base;       // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_LV2_plunger_C*                      K2Node_DynamicCast_AsBP_LV2_Plunger1;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue1;                      // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F[0x1];                                      // 0x024F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue1;               // 0x0260(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0290(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x02A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x032A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32B[0x1];                                      // 0x032B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x039C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia) == 0x000010, "Wrong alignment on BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia");
static_assert(sizeof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia) == 0x0003B0, "Wrong size on BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, EntryPoint) == 0x000000, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000005, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000006, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsBP_Character_Base) == 0x000018, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetSniperAimDirection_Direction) == 0x000024, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetSniperAimDirection_Direction' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000030, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Add_VectorVector_ReturnValue) == 0x00004C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_ComponentBoundEvent_Pawn) == 0x000058, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_ComponentBoundEvent_Pawn' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsBP_LV2_Plunger) == 0x000060, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsBP_LV2_Plunger' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_NPCBase) == 0x000070, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_NPCBase' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess2) == 0x000078, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, Temp_int_Variable) == 0x00007C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x0000B0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess3) == 0x0000B8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0000B9, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_CustomEvent_gamestate) == 0x0000C0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_CustomEvent_gamestate' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetGameInstance_ReturnValue1) == 0x0000C8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x0000D0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess4) == 0x0000D8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakTransform_Location) == 0x0000DC, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakTransform_Rotation) == 0x0000E8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakTransform_Scale) == 0x0000F4, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakRotator_Roll) == 0x000100, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakRotator_Pitch) == 0x000104, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakRotator_Yaw) == 0x000108, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_MakeRotator_ReturnValue) == 0x00010C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000150, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001D8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetAnimInstance_ReturnValue) == 0x0001E0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_Event_Damage) == 0x0001E8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_Event_DamageType) == 0x0001F0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_Event_InstigatedBy) == 0x0001F8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_Event_DamageCauser) == 0x000200, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_K2_GetPawn_ReturnValue) == 0x000208, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000210, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000218, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsBP_Lv_2_Character_Base) == 0x000220, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsBP_Lv_2_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess5) == 0x000228, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_IsValid_ReturnValue1) == 0x000229, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_AsBP_LV2_Plunger1) == 0x000230, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_AsBP_LV2_Plunger1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, K2Node_DynamicCast_bSuccess6) == 0x000238, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00023C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_FClamp_ReturnValue) == 0x000240, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Add_FloatFloat_ReturnValue2) == 0x000244, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_FClamp_ReturnValue1) == 0x000248, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_FClamp_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_IsValid_ReturnValue2) == 0x00024C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_Not_PreBool_ReturnValue) == 0x00024D, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue) == 0x00024E, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GetPlayerController_ReturnValue) == 0x000250, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x000258, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_MakeTransform_ReturnValue1) == 0x000260, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_MakeTransform_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, Temp_object_Variable) == 0x000290, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_LineTraceSingle_OutHit) == 0x0002A0, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_LineTraceSingle_ReturnValue) == 0x000328, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_bBlockingHit) == 0x000329, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_bInitialOverlap) == 0x00032A, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_Time) == 0x00032C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_Distance) == 0x000330, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_Location) == 0x000334, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_ImpactPoint) == 0x000340, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_Normal) == 0x00034C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_ImpactNormal) == 0x000358, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_PhysMat) == 0x000368, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_HitActor) == 0x000370, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_HitComponent) == 0x000378, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_HitBoneName) == 0x000380, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_HitItem) == 0x000388, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_FaceIndex) == 0x00038C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_TraceStart) == 0x000390, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BreakHitResult_TraceEnd) == 0x00039C, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003A8, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia, CallFunc_BooleanAND_ReturnValue1) == 0x0003A9, "Member 'BP_Lv2_Gia_C_ExecuteUbergraph_BP_Lv2_Gia::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_Lv2_Gia_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_Lv2_Gia_C_ReceiveAnyDamage");
static_assert(sizeof(BP_Lv2_Gia_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_Lv2_Gia_C_ReceiveAnyDamage");
static_assert(offsetof(BP_Lv2_Gia_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'BP_Lv2_Gia_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_Lv2_Gia_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_Lv2_Gia_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'BP_Lv2_Gia_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.JoinP2
// 0x0001 (0x0001 - 0x0000)
struct BP_Lv2_Gia_C_JoinP2 final
{
public:
	EGameState                                    GameState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_JoinP2) == 0x000001, "Wrong alignment on BP_Lv2_Gia_C_JoinP2");
static_assert(sizeof(BP_Lv2_Gia_C_JoinP2) == 0x000001, "Wrong size on BP_Lv2_Gia_C_JoinP2");
static_assert(offsetof(BP_Lv2_Gia_C_JoinP2, GameState) == 0x000000, "Member 'BP_Lv2_Gia_C_JoinP2::GameState' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature final
{
public:
	class APawn*                                  Pawn;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature");
static_assert(sizeof(BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature) == 0x000008, "Wrong size on BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature");
static_assert(offsetof(BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature, Pawn) == 0x000000, "Member 'BP_Lv2_Gia_C_BndEvt__PawnSensing_K2Node_ComponentBoundEvent_0_SeePawnDelegate__DelegateSignature::Pawn' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.MoveNextPoint
// 0x0140 (0x0140 - 0x0000)
struct BP_Lv2_Gia_C_MoveNextPoint final
{
public:
	class ABP_PatrolRoute_C*                      Path;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv2_GiaAnim                               EndAnim;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Lv2_Gia_C*                      K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	class UAnimBP_Lv2SpecialNPC_C*                K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0080(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue2;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Lv2SpecialNPC_C*                K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC1;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv2_Gia_C_MoveNextPoint) == 0x000010, "Wrong alignment on BP_Lv2_Gia_C_MoveNextPoint");
static_assert(sizeof(BP_Lv2_Gia_C_MoveNextPoint) == 0x000140, "Wrong size on BP_Lv2_Gia_C_MoveNextPoint");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, Path) == 0x000000, "Member 'BP_Lv2_Gia_C_MoveNextPoint::Path' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, EndAnim) == 0x000008, "Member 'BP_Lv2_Gia_C_MoveNextPoint::EndAnim' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x00000C, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia) == 0x000020, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_IsValid_ReturnValue1) == 0x00002A, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_GetAnimInstance_ReturnValue1) == 0x000030, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_GetAnimInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_MakeTransform_ReturnValue) == 0x000040, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC) == 0x000070, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_bSuccess1) == 0x000078, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000080, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_K2_SetActorTransform_ReturnValue) == 0x000108, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_IsValid_ReturnValue2) == 0x000109, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_GetAnimInstance_ReturnValue2) == 0x000110, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_GetAnimInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, CallFunc_GetGameInstance_ReturnValue) == 0x000118, "Member 'BP_Lv2_Gia_C_MoveNextPoint::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC1) == 0x000120, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_AsAnim_BP_Lv_2Special_NPC1' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_bSuccess2) == 0x000128, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000130, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_DynamicCast_bSuccess3) == 0x000138, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_MoveNextPoint, K2Node_SwitchEnum_CmpSuccess) == 0x000139, "Member 'BP_Lv2_Gia_C_MoveNextPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.CheckFocus
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv2_Gia_C_CheckFocus final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_CheckFocus) == 0x000004, "Wrong alignment on BP_Lv2_Gia_C_CheckFocus");
static_assert(sizeof(BP_Lv2_Gia_C_CheckFocus) == 0x000004, "Wrong size on BP_Lv2_Gia_C_CheckFocus");
static_assert(offsetof(BP_Lv2_Gia_C_CheckFocus, Time) == 0x000000, "Member 'BP_Lv2_Gia_C_CheckFocus::Time' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.ToCrouch
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv2_Gia_C_ToCrouch final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_ToCrouch) == 0x000004, "Wrong alignment on BP_Lv2_Gia_C_ToCrouch");
static_assert(sizeof(BP_Lv2_Gia_C_ToCrouch) == 0x000004, "Wrong size on BP_Lv2_Gia_C_ToCrouch");
static_assert(offsetof(BP_Lv2_Gia_C_ToCrouch, Delay) == 0x000000, "Member 'BP_Lv2_Gia_C_ToCrouch::Delay' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.AttackAppoint
// 0x0030 (0x0030 - 0x0000)
struct BP_Lv2_Gia_C_AttackAppoint final
{
public:
	class AActor*                                 Point;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBE_Lv2_GiaAnim                               AnimType_0;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttackCount_0;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Lv2_Gia_C*                      K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv2_Gia_C_AttackAppoint) == 0x000008, "Wrong alignment on BP_Lv2_Gia_C_AttackAppoint");
static_assert(sizeof(BP_Lv2_Gia_C_AttackAppoint) == 0x000030, "Wrong size on BP_Lv2_Gia_C_AttackAppoint");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, Point) == 0x000000, "Member 'BP_Lv2_Gia_C_AttackAppoint::Point' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, AnimType_0) == 0x000008, "Member 'BP_Lv2_Gia_C_AttackAppoint::AnimType_0' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, AttackCount_0) == 0x00000C, "Member 'BP_Lv2_Gia_C_AttackAppoint::AttackCount_0' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, CallFunc_Clamp_ReturnValue) == 0x000010, "Member 'BP_Lv2_Gia_C_AttackAppoint::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'BP_Lv2_Gia_C_AttackAppoint::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia) == 0x000020, "Member 'BP_Lv2_Gia_C_AttackAppoint::K2Node_DynamicCast_AsAnim_BP_Lv_2_Gia' has a wrong offset!");
static_assert(offsetof(BP_Lv2_Gia_C_AttackAppoint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Lv2_Gia_C_AttackAppoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Lv2_Gia_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Lv2_Gia_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Lv2_Gia_C_ReceiveTick");
static_assert(sizeof(BP_Lv2_Gia_C_ReceiveTick) == 0x000004, "Wrong size on BP_Lv2_Gia_C_ReceiveTick");
static_assert(offsetof(BP_Lv2_Gia_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Lv2_Gia_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Lv2_Gia.BP_Lv2_Gia_C.Attack
// 0x0040 (0x0040 - 0x0000)
struct BP_Lv2_Gia_C_Attack final
{
public:
	bool                                          UseControllerRotation;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Delay;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Lv2_Gia_C_Attack) == 0x000008, "Wrong alignment on BP_Lv2_Gia_C_Attack");
static_assert(sizeof(BP_Lv2_Gia_C_Attack) == 0x000040, "Wrong size on BP_Lv2_Gia_C_Attack");
