#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mer2_Lv2_Character_VR_Man

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Lv2_characterBase_classes.hpp"
#include "SiliconRising_structs.hpp"
#include "Enum_PlayMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mer2_Lv2_Character_VR_Man.BP_Mer2_Lv2_Character_VR_Man_C
// 0x0060 (0x0EA0 - 0x0E40)
class ABP_Mer2_Lv2_Character_VR_Man_C final : public ABP_Lv2_characterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mer2_Lv2_Character_VR_Man_C;     // 0x0E40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 IKBody;                                            // 0x0E48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tracker;                                           // 0x0E50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSetSpectatorUI;                                  // 0x0E58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFlipFlopUI;                                      // 0x0E59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5A[0x6];                                      // 0x0E5A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimBP_Andy_IK_C*                      AnimInstance;                                      // 0x0E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableHMD;                                       // 0x0E68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsOntoLeftHand;                                    // 0x0E69(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOntoRightHand;                                   // 0x0E6A(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOntoHead;                                        // 0x0E6B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          OnSeat;                                            // 0x0E6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanMove;                                           // 0x0E6D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6E[0x2];                                      // 0x0E6E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UIKAnimInstance*                        AnimBP;                                            // 0x0E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastDirectionVector;                               // 0x0E78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDebug;                                           // 0x0E84(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E85[0x3];                                      // 0x0E85(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpectatorUISize_InPlay;                            // 0x0E88(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpectatorUISize_GameOVer;                          // 0x0E8C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpectatorHud_C*                        SpectatorHud;                                      // 0x0E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Man(int32 EntryPoint);
	void OnShowLeaderboard();
	void UpdateToClient(const struct FTransform& head, const struct FTransform& LeftHand_0, const struct FTransform& RightHand_0);
	void UpdateToServer(const struct FTransform& head, const struct FTransform& LeftHand_0, const struct FTransform& RightHand_0);
	void UpdateReplication();
	void InpActEvt_L_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_O_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_I_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_K_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Nine_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Eight_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void SetSpectatorUI(bool IsShow, bool IsGameOver_0);
	void ResetCameraHeight();
	void RotatePointAroundPoint(class USceneComponent* Center, const struct FVector& RotateTargetLocation, float Angle, struct FVector* TargetLocation);
	void SetTriggerStatus(bool IsRightHand, bool Value);
	void SetHandType(bool IsRightHand, EItemTypes Value);
	void InpAxisEvt_LookUp_K2Node_InputAxisEvent_172(float AxisValue);
	void InpAxisEvt_Turn_K2Node_InputAxisEvent_157(float AxisValue);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mer2_Lv2_Character_VR_Man_C">();
	}
	static class ABP_Mer2_Lv2_Character_VR_Man_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mer2_Lv2_Character_VR_Man_C>();
	}
};
static_assert(alignof(ABP_Mer2_Lv2_Character_VR_Man_C) == 0x000010, "Wrong alignment on ABP_Mer2_Lv2_Character_VR_Man_C");
static_assert(sizeof(ABP_Mer2_Lv2_Character_VR_Man_C) == 0x000EA0, "Wrong size on ABP_Mer2_Lv2_Character_VR_Man_C");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, UberGraphFrame_BP_Mer2_Lv2_Character_VR_Man_C) == 0x000E40, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::UberGraphFrame_BP_Mer2_Lv2_Character_VR_Man_C' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IKBody) == 0x000E48, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IKBody' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, Tracker) == 0x000E50, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::Tracker' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsSetSpectatorUI) == 0x000E58, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsSetSpectatorUI' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsFlipFlopUI) == 0x000E59, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsFlipFlopUI' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, AnimInstance) == 0x000E60, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::AnimInstance' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsEnableHMD) == 0x000E68, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsEnableHMD' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsOntoLeftHand) == 0x000E69, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsOntoLeftHand' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsOntoRightHand) == 0x000E6A, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsOntoRightHand' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsOntoHead) == 0x000E6B, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsOntoHead' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, OnSeat) == 0x000E6C, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::OnSeat' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, CanMove) == 0x000E6D, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::CanMove' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, AnimBP) == 0x000E70, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::AnimBP' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, LastDirectionVector) == 0x000E78, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::LastDirectionVector' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, IsDebug) == 0x000E84, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::IsDebug' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, SpectatorUISize_InPlay) == 0x000E88, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::SpectatorUISize_InPlay' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, SpectatorUISize_GameOVer) == 0x000E8C, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::SpectatorUISize_GameOVer' has a wrong offset!");
static_assert(offsetof(ABP_Mer2_Lv2_Character_VR_Man_C, SpectatorHud) == 0x000E90, "Member 'ABP_Mer2_Lv2_Character_VR_Man_C::SpectatorHud' has a wrong offset!");

}

