#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mer2_lv2_Character_PC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.ExecuteUbergraph_BP_Mer2_lv2_Character_PC
// 0x02C8 (0x02C8 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key8;                         // 0x0008(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key7;                         // 0x0020(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key6;                         // 0x0038(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x0050(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x0068(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x0080(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key1;                      // 0x0098(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x00B0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable1;                             // 0x00C8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x00E0(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x00F8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable2;                             // 0x0110(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key1;                         // 0x0128(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0140(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable3;                             // 0x0158(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCModeHud_C*                           CallFunc_Create_ReturnValue;                       // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x019C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x1];                                      // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue1;         // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll2;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch2;                      // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw2;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x021D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x021E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21F[0x1];                                      // 0x021F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue1;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_TPP_C*                          K2Node_DynamicCast_AsAnim_BP_TPP;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_267[0x1];                                      // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select3_Default;                            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_LV2_plunger_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	struct FKey                                   K2Node_InputKeyEvent_Key9;                         // 0x0280(0x0018)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key10;                        // 0x02A0(0x0018)(HasGetValueTypeHash)
	class ABP_LV2_plunger_C*                      CallFunc_Array_Get_Item;                           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC) == 0x0002C8, "Wrong size on BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, EntryPoint) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key8) == 0x000008, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key8' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key7) == 0x000020, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key7' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key6) == 0x000038, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key6' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_struct_Variable) == 0x000050, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key5) == 0x000068, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key5' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key4) == 0x000080, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputActionEvent_Key1) == 0x000098, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputActionEvent_Key1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputActionEvent_Key) == 0x0000B0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_struct_Variable1) == 0x0000C8, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key3) == 0x0000E0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key2) == 0x0000F8, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_struct_Variable2) == 0x000110, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key1) == 0x000128, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key) == 0x000140, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_struct_Variable3) == 0x000158, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_struct_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_bool_Variable) == 0x000170, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_Event_DeltaSeconds) == 0x000174, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_GetController_ReturnValue) == 0x000178, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_DynamicCast_AsPlayer_Controller) == 0x000180, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Create_ReturnValue) == 0x000190, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_bool_Variable1) == 0x000198, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00019C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Roll) == 0x0001A8, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Pitch) == 0x0001AC, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Yaw) == 0x0001B0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_MakeRotator_ReturnValue) == 0x0001B4, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001C0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_IsValid_ReturnValue) == 0x0001C1, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_IsValid_ReturnValue1) == 0x0001C2, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_GetVelocity_ReturnValue) == 0x0001C4, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_K2_GetActorRotation_ReturnValue1) == 0x0001D0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_K2_GetActorRotation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_VSize_ReturnValue) == 0x0001DC, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0001E0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001EC, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0001F0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Roll1) == 0x0001FC, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Pitch1) == 0x000200, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Yaw1) == 0x000204, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Roll2) == 0x000208, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Roll2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Pitch2) == 0x00020C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Pitch2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_BreakRotator_Yaw2) == 0x000210, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_BreakRotator_Yaw2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000214, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Abs_ReturnValue) == 0x000218, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Less_FloatFloat_ReturnValue) == 0x00021C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Less_FloatFloat_ReturnValue1) == 0x00021D, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00021E, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_Select_Default) == 0x000220, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000224, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000228, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_bool_Variable2) == 0x000229, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_Select1_Default) == 0x00022C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_Select2_Default) == 0x000230, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000234, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000238, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Add_FloatFloat_ReturnValue) == 0x00023C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000240, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_K2_AttachToComponent_ReturnValue1) == 0x000241, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_K2_AttachToComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_GetAnimInstance_ReturnValue) == 0x000248, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_DynamicCast_AsAnim_BP_TPP) == 0x000250, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_DynamicCast_AsAnim_BP_TPP' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_DynamicCast_bSuccess1) == 0x000258, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_IsValid_ReturnValue2) == 0x000259, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_float_Variable) == 0x00025C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_float_Variable1) == 0x000260, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_bool_Variable3) == 0x000264, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, Temp_bool_Variable4) == 0x000265, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Not_PreBool_ReturnValue) == 0x000266, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_Select3_Default) == 0x000268, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_GetAllActorsOfClass_OutActors) == 0x000270, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key9) == 0x000280, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key9' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Array_Length_ReturnValue) == 0x000298, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_RandomInteger_ReturnValue) == 0x00029C, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, K2Node_InputKeyEvent_Key10) == 0x0002A0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::K2Node_InputKeyEvent_Key10' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_Array_Get_Item) == 0x0002B8, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC, CallFunc_IsValid_ReturnValue3) == 0x0002C0, "Member 'BP_Mer2_lv2_Character_PC_C_ExecuteUbergraph_BP_Mer2_lv2_Character_PC::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_Reload_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_Reload_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_Reload_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_B_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_B_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_P_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_P_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_LeftShift_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_LeftShift_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_9::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.InpActEvt_Backslash_K2Node_InputKeyEvent_10
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10) == 0x000018, "Wrong size on BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10, Key) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_InpActEvt_Backslash_K2Node_InputKeyEvent_10::Key' has a wrong offset!");

// Function BP_Mer2_lv2_Character_PC.BP_Mer2_lv2_Character_PC_C.SkipWaves
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Mer2_lv2_Character_PC_C_SkipWaves final
{
public:
	TArray<class ABP_AI_Wave_C*>                  Waves;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
	class UPCModeCheat_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AI_Wave_C*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AI_Wave_C*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class UObject*>                        CallFunc_SortArrayWithDefault_OutArray;            // 0x0068(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AI_Wave_C*                          K2Node_DynamicCast_AsBP_AI_Wave;                   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPCModeCheat_C*                         K2Node_DynamicCast_AsPCMode_Cheat;                 // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mer2_lv2_Character_PC_C_SkipWaves) == 0x000008, "Wrong alignment on BP_Mer2_lv2_Character_PC_C_SkipWaves");
static_assert(sizeof(BP_Mer2_lv2_Character_PC_C_SkipWaves) == 0x0000B0, "Wrong size on BP_Mer2_lv2_Character_PC_C_SkipWaves");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, Waves) == 0x000000, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::Waves' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, Temp_int_Array_Index_Variable) == 0x000018, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, Temp_int_Array_Index_Variable1) == 0x000024, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_GetController_ReturnValue) == 0x000038, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, K2Node_DynamicCast_AsPlayer_Controller) == 0x000048, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_SetGamePaused_ReturnValue) == 0x000051, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, Temp_int_Loop_Counter_Variable1) == 0x000054, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_GetAllActorsOfClass_OutActors) == 0x000058, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_SortArrayWithDefault_OutArray) == 0x000068, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_SortArrayWithDefault_OutArray' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Add_IntInt_ReturnValue1) == 0x000078, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Array_Get_Item1) == 0x000080, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, K2Node_DynamicCast_AsBP_AI_Wave) == 0x000088, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::K2Node_DynamicCast_AsBP_AI_Wave' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, K2Node_DynamicCast_bSuccess1) == 0x000090, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_lv2_Character_PC_C_SkipWaves, CallFunc_Array_Length_ReturnValue1) == 0x000094, "Member 'BP_Mer2_lv2_Character_PC_C_SkipWaves::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
