#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mer2Character_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_CharacterBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Mer2Character_PC.BP_Mer2Character_PC_C
// 0x0060 (0x0D30 - 0x0CD0)
class ABP_Mer2Character_PC_C final : public ABP_CharacterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Mer2Character_PC_C;              // 0x0CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x0CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_323B00504062F1792C9BA4BC17A6E379; // 0x0CF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_323B00504062F1792C9BA4BC17A6E379; // 0x0CF4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF5[0x3];                                      // 0x0CF5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPCModeHud_C*                           PCModeWidget;                                      // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTPP;                                             // 0x0D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D09[0x7];                                      // 0x0D09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimBP_TPP_C*                          TPPAnim;                                           // 0x0D10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PCModeCheat;                                       // 0x0D18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ffff;                                              // 0x0D20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Mer2Character_PC(int32 EntryPoint);
	void JumpTest();
	void InpActEvt_Enter_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_RightBracket_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_LeftBracket_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_LeftBracket_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Eight_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Nine_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_Zero_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_B_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_P_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_9(const struct FKey& Key);
	void InpActEvt_LeftShift_K2Node_InputKeyEvent_10(const struct FKey& Key);
	void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_11(const struct FKey& Key);
	void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_12(const struct FKey& Key);
	void InpActEvt_Backslash_K2Node_InputKeyEvent_13(const struct FKey& Key);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void SkipWaves();
	void NewFunction_0_0(int32 A);
	void ControllerTriggerRightRelease();
	void ControllerTriggerRightPress();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void TickCheck();
	void UserConstructionScript();
	void GetAimPos(struct FVector* AimPos);
	void GetCameraTargetPoint(struct FVector* Location);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Mer2Character_PC_C">();
	}
	static class ABP_Mer2Character_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Mer2Character_PC_C>();
	}
};
static_assert(alignof(ABP_Mer2Character_PC_C) == 0x000010, "Wrong alignment on ABP_Mer2Character_PC_C");
static_assert(sizeof(ABP_Mer2Character_PC_C) == 0x000D30, "Wrong size on ABP_Mer2Character_PC_C");
static_assert(offsetof(ABP_Mer2Character_PC_C, UberGraphFrame_BP_Mer2Character_PC_C) == 0x000CD0, "Member 'ABP_Mer2Character_PC_C::UberGraphFrame_BP_Mer2Character_PC_C' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, Camera) == 0x000CD8, "Member 'ABP_Mer2Character_PC_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, SpringArm) == 0x000CE0, "Member 'ABP_Mer2Character_PC_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, SceneCaptureComponent2D) == 0x000CE8, "Member 'ABP_Mer2Character_PC_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, Timeline_0_NewTrack_0_323B00504062F1792C9BA4BC17A6E379) == 0x000CF0, "Member 'ABP_Mer2Character_PC_C::Timeline_0_NewTrack_0_323B00504062F1792C9BA4BC17A6E379' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, Timeline_0__Direction_323B00504062F1792C9BA4BC17A6E379) == 0x000CF4, "Member 'ABP_Mer2Character_PC_C::Timeline_0__Direction_323B00504062F1792C9BA4BC17A6E379' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, Timeline_0) == 0x000CF8, "Member 'ABP_Mer2Character_PC_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, PCModeWidget) == 0x000D00, "Member 'ABP_Mer2Character_PC_C::PCModeWidget' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, IsTPP) == 0x000D08, "Member 'ABP_Mer2Character_PC_C::IsTPP' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, TPPAnim) == 0x000D10, "Member 'ABP_Mer2Character_PC_C::TPPAnim' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, PCModeCheat) == 0x000D18, "Member 'ABP_Mer2Character_PC_C::PCModeCheat' has a wrong offset!");
static_assert(offsetof(ABP_Mer2Character_PC_C, ffff) == 0x000D20, "Member 'ABP_Mer2Character_PC_C::ffff' has a wrong offset!");

}

