#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Mer2_Lv2_Character_VR_Car

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Enum_PlayMode_structs.hpp"


namespace SDK::Params
{

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car
// 0x0BA0 (0x0BA0 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue1;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue2;              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue3;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue4;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_Head1;                          // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_LeftHand1;                      // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_RightHand1;                     // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_Head;                           // 0x00A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_LeftHand;                       // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             K2Node_CustomEvent_RightHand;                      // 0x0100(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue1;      // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0xF];                                      // 0x0191(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue2;      // 0x01A0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue1;                    // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x01E0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult1;     // 0x0268(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult2;     // 0x02F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult3;     // 0x0378(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult4;     // 0x0400(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue1;         // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult5;     // 0x0490(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue5;              // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_519[0x3];                                      // 0x0519(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x051C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue2;         // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0521(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0522(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0523(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue3;         // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0525(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_526[0x2];                                      // 0x0526(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x052E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue6;              // 0x052F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_532[0xE];                                      // 0x0532(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue3;      // 0x0540(0x0030)(IsPlainOldData, NoDestructor)
	float                                         Temp_float_Variable1;                              // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x058C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_PlayMode                                 Temp_byte_Variable;                                // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x05A0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult1;        // 0x0628(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Select_Default;                             // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B4[0xC];                                      // 0x06B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue4;      // 0x06C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue5;      // 0x06F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location1;                 // 0x0720(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation1;                 // 0x072C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale1;                    // 0x0738(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x0744(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x0750(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x075C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue1;                  // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x077C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x0788(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x0798(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult1;   // 0x0820(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x08A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x08B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x08C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x08C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotatePointAroundPoint_TargetLocation;    // 0x08D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotatePointAroundPoint_TargetLocation1;   // 0x08E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x08EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue1;          // 0x08F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_904[0x4];                                      // 0x0904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0908(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult1; // 0x0990(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue4;         // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0A20(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue7;              // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key1;                         // 0x0A40(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue8;                     // 0x0A59(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0A5A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue9;                     // 0x0A5B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0A5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue10;                    // 0x0A5D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5E[0x2];                                      // 0x0A5E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key2;                         // 0x0A60(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0A7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0A88(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAntiAliasingQuality_ReturnValue;       // 0x0A94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0A98(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0B20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0B24(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UIKAnimInstance*                        K2Node_DynamicCast_AsIKAnim_Instance;              // 0x0B30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0B38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B39[0x7];                                      // 0x0B39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key3;                         // 0x0B40(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0B58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B59[0x7];                                      // 0x0B59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key4;                         // 0x0B60(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7A[0x6];                                      // 0x0B7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key5;                         // 0x0B80(0x0018)(HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car) == 0x000010, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car) == 0x000BA0, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, EntryPoint) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue) == 0x000004, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue1) == 0x000005, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue2) == 0x000006, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue3) == 0x000007, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue4) == 0x000008, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsLocallyControlled_ReturnValue) == 0x000009, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_Head1) == 0x000010, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_Head1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_LeftHand1) == 0x000040, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_LeftHand1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_RightHand1) == 0x000070, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_RightHand1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_Head) == 0x0000A0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_Head' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_LeftHand) == 0x0000D0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_LeftHand' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_CustomEvent_RightHand) == 0x000100, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_CustomEvent_RightHand' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue1) == 0x000160, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsServer_ReturnValue) == 0x000190, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue2) == 0x0001A0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsServer_ReturnValue1) == 0x0001D0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsServer_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers) == 0x0001D4, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Greater_IntInt_ReturnValue) == 0x0001D8, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0001E0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult1) == 0x000268, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult2) == 0x0002F0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult3) == 0x000378, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult4) == 0x000400, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsLocallyControlled_ReturnValue1) == 0x000488, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsLocallyControlled_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldTransform_SweepHitResult5) == 0x000490, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldTransform_SweepHitResult5' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue5) == 0x000518, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_Event_DeltaSeconds) == 0x00051C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsLocallyControlled_ReturnValue2) == 0x000520, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsLocallyControlled_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Not_PreBool_ReturnValue) == 0x000521, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue) == 0x000522, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue1) == 0x000523, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsLocallyControlled_ReturnValue3) == 0x000524, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsLocallyControlled_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Not_PreBool_ReturnValue1) == 0x000525, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Not_PreBool_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, Temp_float_Variable) == 0x000528, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue2) == 0x00052C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue3) == 0x00052D, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue4) == 0x00052E, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue6) == 0x00052F, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue5) == 0x000530, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue6) == 0x000531, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue3) == 0x000540, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, Temp_float_Variable1) == 0x000570, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Location) == 0x000574, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Rotation) == 0x000580, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Scale) == 0x00058C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, Temp_byte_Variable) == 0x000598, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x0005A0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_AddLocalOffset_SweepHitResult1) == 0x000628, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_AddLocalOffset_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_Select_Default) == 0x0006B0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue4) == 0x0006C0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentToWorld_ReturnValue5) == 0x0006F0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentToWorld_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Location1) == 0x000720, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Location1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Rotation1) == 0x00072C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Rotation1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Scale1) == 0x000738, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Scale1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Location2) == 0x000744, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Rotation2) == 0x000750, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_BreakTransform_Scale2) == 0x00075C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputAxisEvent_AxisValue1) == 0x000768, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputAxisEvent_AxisValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputAxisEvent_AxisValue) == 0x00076C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000770, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000774, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000778, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_MakeRotator_ReturnValue) == 0x00077C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_MakeRotator_ReturnValue1) == 0x000788, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x000798, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_AddRelativeRotation_SweepHitResult1) == 0x000820, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_AddRelativeRotation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0008A8, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x0008B4, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0008C0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0008C4, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_GetComponentLocation_ReturnValue2) == 0x0008C8, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_GetComponentLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_RotatePointAroundPoint_TargetLocation) == 0x0008D4, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_RotatePointAroundPoint_TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_RotatePointAroundPoint_TargetLocation1) == 0x0008E0, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_RotatePointAroundPoint_TargetLocation1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_FindLookAtRotation_ReturnValue) == 0x0008EC, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_FindLookAtRotation_ReturnValue1) == 0x0008F8, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_FindLookAtRotation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000908, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult1) == 0x000990, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsLocallyControlled_ReturnValue4) == 0x000A18, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsLocallyControlled_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key) == 0x000A20, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsPlayInEditor_ReturnValue7) == 0x000A38, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsPlayInEditor_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key1) == 0x000A40, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue7) == 0x000A58, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue8) == 0x000A59, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, Temp_bool_Variable) == 0x000A5A, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue9) == 0x000A5B, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Not_PreBool_ReturnValue2) == 0x000A5C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_IsValid_ReturnValue10) == 0x000A5D, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_IsValid_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key2) == 0x000A60, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key2' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x000A78, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Add_FloatFloat_ReturnValue) == 0x000A7C, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_GetGameUserSettings_ReturnValue) == 0x000A80, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_MakeVector_ReturnValue) == 0x000A88, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_GetAntiAliasingQuality_ReturnValue) == 0x000A94, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_GetAntiAliasingQuality_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000A98, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Add_IntInt_ReturnValue) == 0x000B20, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Percent_IntInt_ReturnValue) == 0x000B24, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_GetAnimInstance_ReturnValue) == 0x000B28, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_DynamicCast_AsIKAnim_Instance) == 0x000B30, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_DynamicCast_AsIKAnim_Instance' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_DynamicCast_bSuccess) == 0x000B38, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key3) == 0x000B40, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, Temp_bool_Variable1) == 0x000B58, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key4) == 0x000B60, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key4' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_Not_PreBool_ReturnValue3) == 0x000B78, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, CallFunc_HasAuthority_ReturnValue) == 0x000B79, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car, K2Node_InputKeyEvent_Key5) == 0x000B80, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_ExecuteUbergraph_BP_Mer2_Lv2_Character_VR_Car::K2Node_InputKeyEvent_Key5' has a wrong offset!");

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.UpdateToClient
// 0x0090 (0x0090 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient final
{
public:
	struct FTransform                             head;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             LeftHand_0;                                        // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             RightHand_0;                                       // 0x0060(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient) == 0x000010, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient) == 0x000090, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient, head) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient::head' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient, LeftHand_0) == 0x000030, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient::LeftHand_0' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient, RightHand_0) == 0x000060, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToClient::RightHand_0' has a wrong offset!");

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.UpdateToServer
// 0x0090 (0x0090 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer final
{
public:
	struct FTransform                             head;                                              // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             LeftHand_0;                                        // 0x0030(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FTransform                             RightHand_0;                                       // 0x0060(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer) == 0x000010, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer) == 0x000090, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer, head) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer::head' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer, LeftHand_0) == 0x000030, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer::LeftHand_0' has a wrong offset!");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer, RightHand_0) == 0x000060, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_UpdateToServer::RightHand_0' has a wrong offset!");

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.InpActEvt_L_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_L_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.InpActEvt_O_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_O_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function BP_Mer2_Lv2_Character_VR_Car.BP_Mer2_Lv2_Character_VR_Car_C.InpActEvt_I_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2");
static_assert(sizeof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2");
static_assert(offsetof(BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'BP_Mer2_Lv2_Character_VR_Car_C_InpActEvt_I_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

