#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Plunger

#include "Basic.hpp"

#include "Struct_BasicBehavior_structs.hpp"
#include "Struct_BindTriggerAllure_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.ExecuteUbergraph_BP_NPC_Plunger
// 0x01C0 (0x01C0 - 0x0000)
struct BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_Damage;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PlayerController4;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation3;                         // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal3;                           // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PlayerController3;                    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation2;                         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal2;                           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_PlayerController2;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation1;                         // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal1;                           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue2;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance2;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue3;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance3;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PlayerController1;                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_PlayerController;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue4;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance4;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NPC_EnemySentryHead_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger) == 0x000010, "Wrong alignment on BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger");
static_assert(sizeof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger) == 0x0001C0, "Wrong size on BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, EntryPoint) == 0x000000, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000010, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_IsValid_ReturnValue) == 0x00001A, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, Temp_bool_Has_Been_Initd_Variable) == 0x00001B, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_Damage) == 0x00001C, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_DamageType) == 0x000020, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_InstigatedBy) == 0x000028, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_DamageCauser) == 0x000030, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetGameInstance_ReturnValue1) == 0x000038, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_PlayerController4) == 0x000040, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_PlayerController4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitLocation3) == 0x000048, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitLocation3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitNormal3) == 0x000054, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitNormal3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000060, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess1) == 0x000068, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_PlayerController3) == 0x000070, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_PlayerController3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitLocation2) == 0x000078, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitLocation2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitNormal2) == 0x000084, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitNormal2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_PlayerController2) == 0x000090, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_PlayerController2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitLocation1) == 0x000098, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitLocation1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitNormal1) == 0x0000A4, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitNormal1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetGameInstance_ReturnValue2) == 0x0000B0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetGameInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance2) == 0x0000B8, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess2) == 0x0000C0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetGameInstance_ReturnValue3) == 0x0000C8, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetGameInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance3) == 0x0000D0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess3) == 0x0000D8, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_PlayerController1) == 0x0000E0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_PlayerController1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_DeltaSeconds) == 0x0000E8, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000EC, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, Temp_bool_IsClosed_Variable) == 0x0000F0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitLocation) == 0x0000F4, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_HitNormal) == 0x000100, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_Event_PlayerController) == 0x000110, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_Event_PlayerController' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000118, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_Add_VectorVector_ReturnValue) == 0x000124, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000130, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_MakeTransform_ReturnValue) == 0x000140, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetGameInstance_ReturnValue4) == 0x000170, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetGameInstance_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000178, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsMer_2Game_Instance4) == 0x000180, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsMer_2Game_Instance4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess4) == 0x000188, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_FinishSpawningActor_ReturnValue) == 0x000190, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000198, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0001A0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_AsBP_Character_Base) == 0x0001A8, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, K2Node_DynamicCast_bSuccess5) == 0x0001B0, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger, CallFunc_Not_PreBool_ReturnValue) == 0x0001B1, "Member 'BP_NPC_Plunger_C_ExecuteUbergraph_BP_NPC_Plunger::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.PatrolInit
// 0x00B8 (0x00B8 - 0x0000)
struct BP_NPC_Plunger_C_PatrolInit final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_BasicBehavior                  K2Node_MakeStruct_Struct_BasicBehavior;            // 0x0008(0x00B0)(HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_PatrolInit) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_PatrolInit");
static_assert(sizeof(BP_NPC_Plunger_C_PatrolInit) == 0x0000B8, "Wrong size on BP_NPC_Plunger_C_PatrolInit");
static_assert(offsetof(BP_NPC_Plunger_C_PatrolInit, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_NPC_Plunger_C_PatrolInit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_PatrolInit, CallFunc_IsValid_ReturnValue1) == 0x000001, "Member 'BP_NPC_Plunger_C_PatrolInit::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_PatrolInit, K2Node_MakeStruct_Struct_BasicBehavior) == 0x000008, "Member 'BP_NPC_Plunger_C_PatrolInit::K2Node_MakeStruct_Struct_BasicBehavior' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.TriggerInit
// 0x0038 (0x0038 - 0x0000)
struct BP_NPC_Plunger_C_TriggerInit final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_BindTriggerAllure              CallFunc_Array_Get_Item;                           // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_TriggerInit) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_TriggerInit");
static_assert(sizeof(BP_NPC_Plunger_C_TriggerInit) == 0x000038, "Wrong size on BP_NPC_Plunger_C_TriggerInit");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_NPC_Plunger_C_TriggerInit::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_NPC_Plunger_C_TriggerInit::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_Less_IntInt_ReturnValue) == 0x000028, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_TriggerInit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BP_NPC_Plunger_C_TriggerInit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.OnHitHeadDead
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Plunger_C_OnHitHeadDead final
{
public:
	struct FVector                                HitLocation_0;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      PlayerController;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_OnHitHeadDead) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_OnHitHeadDead");
static_assert(sizeof(BP_NPC_Plunger_C_OnHitHeadDead) == 0x000020, "Wrong size on BP_NPC_Plunger_C_OnHitHeadDead");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHeadDead, HitLocation_0) == 0x000000, "Member 'BP_NPC_Plunger_C_OnHitHeadDead::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHeadDead, HitNormal_0) == 0x00000C, "Member 'BP_NPC_Plunger_C_OnHitHeadDead::HitNormal_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHeadDead, PlayerController) == 0x000018, "Member 'BP_NPC_Plunger_C_OnHitHeadDead::PlayerController' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Plunger_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Plunger_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Plunger_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Plunger_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Plunger_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Plunger_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.OnDeath
// 0x0008 (0x0008 - 0x0000)
struct BP_NPC_Plunger_C_OnDeath final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_OnDeath) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_OnDeath");
static_assert(sizeof(BP_NPC_Plunger_C_OnDeath) == 0x000008, "Wrong size on BP_NPC_Plunger_C_OnDeath");
static_assert(offsetof(BP_NPC_Plunger_C_OnDeath, PlayerController) == 0x000000, "Member 'BP_NPC_Plunger_C_OnDeath::PlayerController' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.OnHitOther
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Plunger_C_OnHitOther final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_OnHitOther) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_OnHitOther");
static_assert(sizeof(BP_NPC_Plunger_C_OnHitOther) == 0x000020, "Wrong size on BP_NPC_Plunger_C_OnHitOther");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitOther, PlayerController) == 0x000000, "Member 'BP_NPC_Plunger_C_OnHitOther::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitOther, HitLocation_0) == 0x000008, "Member 'BP_NPC_Plunger_C_OnHitOther::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitOther, HitNormal_0) == 0x000014, "Member 'BP_NPC_Plunger_C_OnHitOther::HitNormal_0' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.OnHitBody
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Plunger_C_OnHitBody final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_OnHitBody) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_OnHitBody");
static_assert(sizeof(BP_NPC_Plunger_C_OnHitBody) == 0x000020, "Wrong size on BP_NPC_Plunger_C_OnHitBody");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitBody, PlayerController) == 0x000000, "Member 'BP_NPC_Plunger_C_OnHitBody::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitBody, HitLocation_0) == 0x000008, "Member 'BP_NPC_Plunger_C_OnHitBody::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitBody, HitNormal_0) == 0x000014, "Member 'BP_NPC_Plunger_C_OnHitBody::HitNormal_0' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.OnHitHead
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Plunger_C_OnHitHead final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation_0;                                     // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal_0;                                       // 0x0014(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_OnHitHead) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_OnHitHead");
static_assert(sizeof(BP_NPC_Plunger_C_OnHitHead) == 0x000020, "Wrong size on BP_NPC_Plunger_C_OnHitHead");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHead, PlayerController) == 0x000000, "Member 'BP_NPC_Plunger_C_OnHitHead::PlayerController' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHead, HitLocation_0) == 0x000008, "Member 'BP_NPC_Plunger_C_OnHitHead::HitLocation_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_OnHitHead, HitNormal_0) == 0x000014, "Member 'BP_NPC_Plunger_C_OnHitHead::HitNormal_0' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Plunger_C_ReceiveAnyDamage final
{
public:
	float                                         Damage_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Plunger_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_NPC_Plunger_C_ReceiveAnyDamage");
static_assert(sizeof(BP_NPC_Plunger_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_NPC_Plunger_C_ReceiveAnyDamage");
static_assert(offsetof(BP_NPC_Plunger_C_ReceiveAnyDamage, Damage_0) == 0x000000, "Member 'BP_NPC_Plunger_C_ReceiveAnyDamage::Damage_0' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_NPC_Plunger_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_NPC_Plunger_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_NPC_Plunger_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'BP_NPC_Plunger_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function BP_NPC_Plunger.BP_NPC_Plunger_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Plunger_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Plunger_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_NPC_Plunger_C_UserConstructionScript");
static_assert(sizeof(BP_NPC_Plunger_C_UserConstructionScript) == 0x000001, "Wrong size on BP_NPC_Plunger_C_UserConstructionScript");
static_assert(offsetof(BP_NPC_Plunger_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000000, "Member 'BP_NPC_Plunger_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

