#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_HeavyRiot_RootMotion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_NPC_Base_classes.hpp"
#include "Enum_BehaviorType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_HeavyRiot_RootMotion.BP_NPC_HeavyRiot_RootMotion_C
// 0x0140 (0x09F0 - 0x08B0)
class ABP_NPC_HeavyRiot_RootMotion_C : public ABP_NPC_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_HeavyRiot_RootMotion_C;      // 0x08B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         HitReactionTime;                                   // 0x08B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitReactionTimeCurrent;                            // 0x08BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttackSpeed;                                       // 0x08C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttackSpeedMax;                                    // 0x08C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwitchCoverTimeMin;                                // 0x08D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SwitchCoverTimeMax;                                // 0x08D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitSettings;                                    // 0x08E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1[0x3];                                      // 0x08E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttackSpeed_Min_;                                  // 0x08E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSpeed_Max_;                                  // 0x08E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SwitchCoverInterval_Min_;                          // 0x08EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SwitchCoverInterval_Max_;                          // 0x08F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeadShotDead;                                    // 0x08F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	Enum_BehaviorType                             HitTransition;                                     // 0x08F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F6[0x2];                                      // 0x08F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DodgeRate;                                         // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DodgeCD_Min_;                                      // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DodgeCD_Max_;                                      // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAimMe;                                           // 0x0904(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPlayDodge;                                       // 0x0905(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906[0x2];                                      // 0x0906(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimMontage*>                   RunHurtAM;                                         // 0x0908(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   CrouchHurtAM;                                      // 0x0918(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   StandHurtAM;                                       // 0x0928(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   ReloadAM;                                          // 0x0938(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   FireAM;                                            // 0x0948(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         AimPitch;                                          // 0x0958(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DTime;                                             // 0x095C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_EnemyRiot_RootMotion_C*         AnimBP;                                            // 0x0960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MiniBreakThreshold;                                // 0x0968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxBreakThreshold;                                 // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMoving;                                          // 0x0970(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHurting;                                         // 0x0971(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsReloading;                                       // 0x0972(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_973[0x1];                                      // 0x0973(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         State;                                             // 0x0974(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveTargetLocation;                                // 0x0978(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldAttack;                                      // 0x0984(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_985[0x3];                                      // 0x0985(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RandomCount;                                       // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timespan;                                          // 0x098C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouch;                                          // 0x0990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Waypoint;                                          // 0x0998(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          IsShowWayPoint;                                    // 0x09A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A9[0x3];                                      // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FreshWayPointTime;                                 // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckAvoid;                                        // 0x09B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FixedTargetLocation;                               // 0x09B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShootAvoid;                                        // 0x09C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLocation;                                      // 0x09C4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovingStuckCheckTime;                              // 0x09D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GoToStartPathCheckTime;                            // 0x09D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DeathCheck;                                        // 0x09D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D9[0x7];                                      // 0x09D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWpn_AI_HeavyRiotShield_C*              shield;                                            // 0x09E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WayEmpty;                                          // 0x09E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_NPC_HeavyRiot_RootMotion(int32 EntryPoint);
	void CheckOnDestroy(class AActor* DestroyedActor);
	void OnCheckMovingStuck();
	void BndEvt__BehaviorComponent_K2Node_ComponentBoundEvent_0_OnEndAttackRanged__DelegateSignature();
	void OnTickSwitchCover();
	void Stage_OnChangeCover(bool OnOrOff);
	void OnTickGoStartLocation();
	void Stage_StartPath(bool OnOrOff);
	void OnTickRandomMove();
	void OnRandomMove(bool OnOrOff);
	void OnAnim_AimDirection(float Value);
	void OnAnim_AimPich(float Value);
	void OnAnim_CurrentSpeed(float Value);
	void OnAnim_CurrentDirection(float Value);
	void OnAnim_moveStartDirection(float Value);
	void OnAnim_SetLockingTarget(bool Value);
	void OnAnim_SetMoving(bool Value);
	void FaceToTarget(const struct FVector& TargetLocation);
	void HitOtherDead(const struct FVector& HitLocation_0, int32* BreakType);
	void OnHitOtherDead(const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, class APlayerController* PlayerController);
	void GoToTargetLocation(const struct FVector& PathEnd);
	void GoToTargetLocationWithLockTarget(struct FVector& PathEnd, struct FVector& Target);
	void CheckAttackConditions(bool* CouldAttack);
	void FindRandomMoveLocation(struct FVector* Location);
	void OnHitHeadDead(const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, class APlayerController* PlayerController);
	void OnHitOther(class APlayerController* PlayerController, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0);
	void OnHitBody(class APlayerController* PlayerController, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0);
	void OnHitHead(class APlayerController* PlayerController, const struct FVector& HitLocation_0, const struct FVector& HitNormal_0);
	void OnDeath(class APlayerController* PlayerController);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveAnyDamage(float Damage_0, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_HeavyRiot_RootMotion_C">();
	}
	static class ABP_NPC_HeavyRiot_RootMotion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_HeavyRiot_RootMotion_C>();
	}
};
static_assert(alignof(ABP_NPC_HeavyRiot_RootMotion_C) == 0x000010, "Wrong alignment on ABP_NPC_HeavyRiot_RootMotion_C");
static_assert(sizeof(ABP_NPC_HeavyRiot_RootMotion_C) == 0x0009F0, "Wrong size on ABP_NPC_HeavyRiot_RootMotion_C");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, UberGraphFrame_BP_NPC_HeavyRiot_RootMotion_C) == 0x0008B0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::UberGraphFrame_BP_NPC_HeavyRiot_RootMotion_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, HitReactionTime) == 0x0008B8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::HitReactionTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, HitReactionTimeCurrent) == 0x0008BC, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::HitReactionTimeCurrent' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AttackSpeed) == 0x0008C0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AttackSpeed' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AttackSpeedMax) == 0x0008C8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AttackSpeedMax' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, SwitchCoverTimeMin) == 0x0008D0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::SwitchCoverTimeMin' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, SwitchCoverTimeMax) == 0x0008D8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::SwitchCoverTimeMax' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsInitSettings) == 0x0008E0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsInitSettings' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AttackSpeed_Min_) == 0x0008E4, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AttackSpeed_Min_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AttackSpeed_Max_) == 0x0008E8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AttackSpeed_Max_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, SwitchCoverInterval_Min_) == 0x0008EC, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::SwitchCoverInterval_Min_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, SwitchCoverInterval_Max_) == 0x0008F0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::SwitchCoverInterval_Max_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsHeadShotDead) == 0x0008F4, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsHeadShotDead' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, HitTransition) == 0x0008F5, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::HitTransition' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, DodgeRate) == 0x0008F8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::DodgeRate' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, DodgeCD_Min_) == 0x0008FC, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::DodgeCD_Min_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, DodgeCD_Max_) == 0x000900, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::DodgeCD_Max_' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsAimMe) == 0x000904, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsAimMe' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsPlayDodge) == 0x000905, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsPlayDodge' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, RunHurtAM) == 0x000908, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::RunHurtAM' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, CrouchHurtAM) == 0x000918, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::CrouchHurtAM' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, StandHurtAM) == 0x000928, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::StandHurtAM' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, ReloadAM) == 0x000938, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::ReloadAM' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, FireAM) == 0x000948, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::FireAM' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AimPitch) == 0x000958, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AimPitch' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, DTime) == 0x00095C, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::DTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, AnimBP) == 0x000960, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::AnimBP' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, MiniBreakThreshold) == 0x000968, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::MiniBreakThreshold' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, MaxBreakThreshold) == 0x00096C, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::MaxBreakThreshold' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsMoving) == 0x000970, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsMoving' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsHurting) == 0x000971, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsHurting' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsReloading) == 0x000972, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsReloading' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, State) == 0x000974, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::State' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, MoveTargetLocation) == 0x000978, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::MoveTargetLocation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, ShouldAttack) == 0x000984, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::ShouldAttack' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, RandomCount) == 0x000988, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::RandomCount' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, Timespan) == 0x00098C, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::Timespan' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsCrouch) == 0x000990, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsCrouch' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, Waypoint) == 0x000998, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::Waypoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, IsShowWayPoint) == 0x0009A8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::IsShowWayPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, FreshWayPointTime) == 0x0009AC, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::FreshWayPointTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, CheckAvoid) == 0x0009B0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::CheckAvoid' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, FixedTargetLocation) == 0x0009B4, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::FixedTargetLocation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, ShootAvoid) == 0x0009C0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::ShootAvoid' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, LastLocation) == 0x0009C4, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::LastLocation' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, MovingStuckCheckTime) == 0x0009D0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::MovingStuckCheckTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, GoToStartPathCheckTime) == 0x0009D4, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::GoToStartPathCheckTime' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, DeathCheck) == 0x0009D8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::DeathCheck' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, shield) == 0x0009E0, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::shield' has a wrong offset!");
static_assert(offsetof(ABP_NPC_HeavyRiot_RootMotion_C, WayEmpty) == 0x0009E8, "Member 'ABP_NPC_HeavyRiot_RootMotion_C::WayEmpty' has a wrong offset!");

}

