#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Secret

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Secret.BP_NPC_Secret_C.ExecuteUbergraph_BP_NPC_Secret
// 0x02F0 (0x02F0 - 0x0000)
struct BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult1;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AIStorage_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0088(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_AIStorage_C*                        CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIStorage_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue1;             // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIM_SERCET_C*                         K2Node_DynamicCast_AsANIM_SERCET;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue2;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UANIM_SERCET_C*                         K2Node_DynamicCast_AsANIM_SERCET1;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue1;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base1;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSniperAimDirection_Direction;          // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate1;      // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue1;     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x01C8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetRotationAtSplinePoint_ReturnValue;     // 0x0254(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x2];                                      // 0x0262(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret) == 0x000010, "Wrong alignment on BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret");
static_assert(sizeof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret) == 0x0002F0, "Wrong size on BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, EntryPoint) == 0x000000, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, Temp_name_Variable) == 0x000008, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, Temp_object_Variable) == 0x000010, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_HasAuthority_ReturnValue) == 0x000020, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_CustomEvent_MovementResult1) == 0x000021, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_CustomEvent_MovementResult1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000024, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000038, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, Temp_int_Variable) == 0x000040, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_PlayAnimMontage_ReturnValue) == 0x000048, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00004C, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_Event_Damage) == 0x000054, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_Event_DamageType) == 0x000058, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_Event_InstigatedBy) == 0x000060, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_Event_DamageCauser) == 0x000068, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetAnimInstance_ReturnValue) == 0x000070, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BooleanAND_ReturnValue) == 0x000080, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000081, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetAllActorsOfClass_OutActors) == 0x000088, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_CreateDelegate_OutputDelegate) == 0x0000A0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_MakeTransform_ReturnValue) == 0x0000C0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F8, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, Temp_byte_Variable) == 0x000108, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_CustomEvent_MovementResult) == 0x000109, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetPlayerPawn_ReturnValue) == 0x000110, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_AsBP_Character_Base) == 0x000120, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetAnimInstance_ReturnValue1) == 0x000130, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetAnimInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_AsANIM_SERCET) == 0x000138, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_AsANIM_SERCET' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_bSuccess1) == 0x000140, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetAnimInstance_ReturnValue2) == 0x000148, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetAnimInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_AsANIM_SERCET1) == 0x000150, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_AsANIM_SERCET1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_bSuccess2) == 0x000158, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_Event_DeltaSeconds) == 0x00015C, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_IsValid_ReturnValue1) == 0x000160, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetPlayerPawn_ReturnValue1) == 0x000168, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetPlayerPawn_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_AsBP_Character_Base1) == 0x000170, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_AsBP_Character_Base1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_DynamicCast_bSuccess3) == 0x000178, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetSniperAimDirection_Direction) == 0x00017C, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetSniperAimDirection_Direction' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000188, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000194, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001AC, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, K2Node_CreateDelegate_OutputDelegate1) == 0x0001B0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GreaterEqual_FloatFloat_ReturnValue1) == 0x0001C0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GreaterEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_LineTraceSingle_OutHit) == 0x0001C8, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_LineTraceSingle_ReturnValue) == 0x000250, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_GetRotationAtSplinePoint_ReturnValue) == 0x000254, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_GetRotationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_bBlockingHit) == 0x000260, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_bInitialOverlap) == 0x000261, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_Time) == 0x000264, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_Distance) == 0x000268, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_Location) == 0x00026C, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_ImpactPoint) == 0x000278, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_Normal) == 0x000284, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_ImpactNormal) == 0x000290, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_PhysMat) == 0x0002A0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_HitActor) == 0x0002A8, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_HitComponent) == 0x0002B0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_HitBoneName) == 0x0002B8, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_HitItem) == 0x0002C0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_FaceIndex) == 0x0002C4, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_TraceStart) == 0x0002C8, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BreakHitResult_TraceEnd) == 0x0002D4, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0002E0, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002E1, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret, CallFunc_BooleanAND_ReturnValue1) == 0x0002E2, "Member 'BP_NPC_Secret_C_ExecuteUbergraph_BP_NPC_Secret::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Secret_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Secret_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Secret_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Secret_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Secret_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Secret_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_NPC_Secret_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_NPC_Secret_C_ReceiveAnyDamage");
static_assert(sizeof(BP_NPC_Secret_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_NPC_Secret_C_ReceiveAnyDamage");
static_assert(offsetof(BP_NPC_Secret_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'BP_NPC_Secret_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_NPC_Secret_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_NPC_Secret_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'BP_NPC_Secret_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.OnSuccess_2C6F5C1049B0742354325896B63AC9C2
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2) == 0x000001, "Wrong alignment on BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2");
static_assert(sizeof(BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2) == 0x000001, "Wrong size on BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2");
static_assert(offsetof(BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2, MovementResult) == 0x000000, "Member 'BP_NPC_Secret_C_OnSuccess_2C6F5C1049B0742354325896B63AC9C2::MovementResult' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.OnFail_2C6F5C1049B0742354325896B63AC9C2
// 0x0001 (0x0001 - 0x0000)
struct BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2) == 0x000001, "Wrong alignment on BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2");
static_assert(sizeof(BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2) == 0x000001, "Wrong size on BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2");
static_assert(offsetof(BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2, MovementResult) == 0x000000, "Member 'BP_NPC_Secret_C_OnFail_2C6F5C1049B0742354325896B63AC9C2::MovementResult' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.SetMovingPathAndAnim
// 0x0010 (0x0010 - 0x0000)
struct BP_NPC_Secret_C_SetMovingPathAndAnim final
{
public:
	class ASplinePath_C*                          _path;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           _EndAnim;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_SetMovingPathAndAnim) == 0x000008, "Wrong alignment on BP_NPC_Secret_C_SetMovingPathAndAnim");
static_assert(sizeof(BP_NPC_Secret_C_SetMovingPathAndAnim) == 0x000010, "Wrong size on BP_NPC_Secret_C_SetMovingPathAndAnim");
static_assert(offsetof(BP_NPC_Secret_C_SetMovingPathAndAnim, _path) == 0x000000, "Member 'BP_NPC_Secret_C_SetMovingPathAndAnim::_path' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_SetMovingPathAndAnim, _EndAnim) == 0x000008, "Member 'BP_NPC_Secret_C_SetMovingPathAndAnim::_EndAnim' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.SetFocusCheckIn
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Secret_C_SetFocusCheckIn final
{
public:
	float                                         _time;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Secret_C_SetFocusCheckIn) == 0x000004, "Wrong alignment on BP_NPC_Secret_C_SetFocusCheckIn");
static_assert(sizeof(BP_NPC_Secret_C_SetFocusCheckIn) == 0x000004, "Wrong size on BP_NPC_Secret_C_SetFocusCheckIn");
static_assert(offsetof(BP_NPC_Secret_C_SetFocusCheckIn, _time) == 0x000000, "Member 'BP_NPC_Secret_C_SetFocusCheckIn::_time' has a wrong offset!");

// Function BP_NPC_Secret.BP_NPC_Secret_C.SetWeaponByClass
// 0x0060 (0x0060 - 0x0000)
struct BP_NPC_Secret_C_SetWeaponByClass final
{
public:
	class UClass*                                 Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Secret_C_SetWeaponByClass) == 0x000010, "Wrong alignment on BP_NPC_Secret_C_SetWeaponByClass");
static_assert(sizeof(BP_NPC_Secret_C_SetWeaponByClass) == 0x000060, "Wrong size on BP_NPC_Secret_C_SetWeaponByClass");
static_assert(offsetof(BP_NPC_Secret_C_SetWeaponByClass, Type) == 0x000000, "Member 'BP_NPC_Secret_C_SetWeaponByClass::Type' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_SetWeaponByClass, CallFunc_IsValidClass_ReturnValue) == 0x000008, "Member 'BP_NPC_Secret_C_SetWeaponByClass::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Secret_C_SetWeaponByClass, CallFunc_HasAuthority_ReturnValue) == 0x000009, "Member 'BP_NPC_Secret_C_SetWeaponByClass::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
