#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Passerby

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_NPC_Passerby.BP_NPC_Passerby_C.ExecuteUbergraph_BP_NPC_Passerby
// 0x0040 (0x0040 - 0x0000)
struct BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Locations_2D_Distance;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby) == 0x000004, "Wrong alignment on BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby");
static_assert(sizeof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby) == 0x000040, "Wrong size on BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, EntryPoint) == 0x000000, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_IsValid_ReturnValue1) == 0x00000D, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_IsValid_ReturnValue2) == 0x000014, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, Temp_bool_Has_Been_Initd_Variable1) == 0x000015, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, Temp_bool_IsClosed_Variable) == 0x000016, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000018, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_Distance_Between_Locations_2D_Distance) == 0x000038, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_Distance_Between_Locations_2D_Distance' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby, Temp_bool_IsClosed_Variable1) == 0x00003D, "Member 'BP_NPC_Passerby_C_ExecuteUbergraph_BP_NPC_Passerby::Temp_bool_IsClosed_Variable1' has a wrong offset!");

// Function BP_NPC_Passerby.BP_NPC_Passerby_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_NPC_Passerby_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NPC_Passerby_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_NPC_Passerby_C_ReceiveTick");
static_assert(sizeof(BP_NPC_Passerby_C_ReceiveTick) == 0x000004, "Wrong size on BP_NPC_Passerby_C_ReceiveTick");
static_assert(offsetof(BP_NPC_Passerby_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_NPC_Passerby_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

