#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NVSplineMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SSplineMeshDetails_structs.hpp"
#include "ESplineMeshStretchMode_structs.hpp"
#include "Engine_structs.hpp"
#include "SSplineMeshStep_structs.hpp"
#include "SSplineMeshInstanceList_structs.hpp"
#include "ESplineMeshSequenceDistanceModifierType_structs.hpp"
#include "ESplineMeshSequenceType_structs.hpp"


namespace SDK::Params
{

// Function BP_NVSplineMesh.BP_NVSplineMesh_C.UserConstructionScript
// 0x0140 (0x0140 - 0x0000)
struct BP_NVSplineMesh_C_UserConstructionScript final
{
public:
	TArray<struct FSSplineMeshStep>               Sequence;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FSSplineMeshDetails>            Dependants;                                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	struct FTransform                             Temp_struct_Variable;                              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             Temp_struct_Variable1;                             // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue1;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue1;        // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue1;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue1;               // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x00C8(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue; // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue1;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue1; // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue1; // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NVSplineMesh_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_NVSplineMesh_C_UserConstructionScript");
static_assert(sizeof(BP_NVSplineMesh_C_UserConstructionScript) == 0x000140, "Wrong size on BP_NVSplineMesh_C_UserConstructionScript");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, Sequence) == 0x000000, "Member 'BP_NVSplineMesh_C_UserConstructionScript::Sequence' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, Dependants) == 0x000010, "Member 'BP_NVSplineMesh_C_UserConstructionScript::Dependants' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, Temp_struct_Variable) == 0x000020, "Member 'BP_NVSplineMesh_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, Temp_struct_Variable1) == 0x000050, "Member 'BP_NVSplineMesh_C_UserConstructionScript::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000080, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue1) == 0x000088, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, Temp_int_Variable) == 0x000090, "Member 'BP_NVSplineMesh_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000094, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue1) == 0x000098, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x00009C, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_BreakVector2D_X) == 0x0000A4, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_BreakVector2D_Y) == 0x0000A8, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000AC, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue) == 0x0000B0, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x0000B4, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Add_Vector2DVector2D_ReturnValue1) == 0x0000BC, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Add_Vector2DVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Array_Contains_ReturnValue1) == 0x0000C4, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Array_Contains_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x0000C5, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue1) == 0x0000C6, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetBounds_ReturnValue) == 0x0000C8, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetSplineLength_ReturnValue) == 0x0000E4, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x0000E8, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x0000EC, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000F4, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000F8, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000FC, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue) == 0x000100, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x00010C, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000110, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00011C, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue1) == 0x000120, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue1) == 0x000124, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetTangentAtDistanceAlongSpline_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_UserConstructionScript, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue1) == 0x000130, "Member 'BP_NVSplineMesh_C_UserConstructionScript::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue1' has a wrong offset!");

// Function BP_NVSplineMesh.BP_NVSplineMesh_C.BuildMeshSequence
// 0x02A0 (0x02A0 - 0x0000)
struct BP_NVSplineMesh_C_BuildMeshSequence final
{
public:
	struct FSSplineMeshDetails                    SplineMeshDetails_0;                               // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	float                                         StartDistance;                                     // 0x00B0(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndDistnace;                                       // 0x00B4(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSplineMeshStep>               Mesh_segment_sequence;                             // 0x00B8(0x0010)(Parm, OutParm, ZeroConstructor)
	float                                         AdjustedEndDistance;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            FinalMesh;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DesiredDistance;                                   // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeepLooping;                                       // 0x00DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            MeshToTry;                                         // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BestLengthDifference;                              // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Longest;                                           // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            ChosenMesh;                                        // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSSplineMeshStep>               MeshSteps;                                         // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         CurrentDistance;                                   // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRangeFromStream_ReturnValue; // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item1;                          // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_ChooseNextMeshInSequence_Chosen_Mesh;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_FindBestMeshForLength_ChosenMesh;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshSequenceType                       Temp_byte_Variable;                                // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_Select_Default;                             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0170(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue1;                   // 0x01AC(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue1;                        // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue1;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue1;                 // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSplineMeshStep                       K2Node_MakeStruct_SSplineMeshStep;                 // 0x0200(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue3;         // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSSplineMeshStep                       CallFunc_Array_Get_Item2;                          // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MathExpression_ReturnValue1;                // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSplineMeshStep                       K2Node_MakeStruct_SSplineMeshStep1;                // 0x0240(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue2;                   // 0x0250(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue2;                        // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue2;                 // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue6;         // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NVSplineMesh_C_BuildMeshSequence) == 0x000010, "Wrong alignment on BP_NVSplineMesh_C_BuildMeshSequence");
static_assert(sizeof(BP_NVSplineMesh_C_BuildMeshSequence) == 0x0002A0, "Wrong size on BP_NVSplineMesh_C_BuildMeshSequence");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, SplineMeshDetails_0) == 0x000000, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::SplineMeshDetails_0' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, StartDistance) == 0x0000B0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::StartDistance' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, EndDistnace) == 0x0000B4, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::EndDistnace' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, Mesh_segment_sequence) == 0x0000B8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::Mesh_segment_sequence' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, AdjustedEndDistance) == 0x0000C8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::AdjustedEndDistance' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, FinalMesh) == 0x0000D0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::FinalMesh' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, DesiredDistance) == 0x0000D8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::DesiredDistance' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, KeepLooping) == 0x0000DC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::KeepLooping' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, MeshToTry) == 0x0000E0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::MeshToTry' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, BestLengthDifference) == 0x0000E8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::BestLengthDifference' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, Longest) == 0x0000EC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::Longest' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, ChosenMesh) == 0x0000F0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::ChosenMesh' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, MeshSteps) == 0x0000F8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::MeshSteps' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CurrentDistance) == 0x000108, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CurrentDistance' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Get_Item) == 0x000110, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000118, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Length_ReturnValue) == 0x00011C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Length_ReturnValue1) == 0x000120, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_IntInt_ReturnValue) == 0x000124, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_IntInt_ReturnValue) == 0x000128, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_SwitchEnum_CmpSuccess) == 0x000129, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00012A, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00012B, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Length_ReturnValue2) == 0x00012C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_IntInt_ReturnValue1) == 0x000130, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000134, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000138, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000139, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_RandomIntegerInRangeFromStream_ReturnValue) == 0x00013C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_RandomIntegerInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000140, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Get_Item1) == 0x000148, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_ChooseNextMeshInSequence_Chosen_Mesh) == 0x000150, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_ChooseNextMeshInSequence_Chosen_Mesh' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_FindBestMeshForLength_ChosenMesh) == 0x000158, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_FindBestMeshForLength_ChosenMesh' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000160, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, Temp_byte_Variable) == 0x000164, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_Select_Default) == 0x000168, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_GetBounds_ReturnValue) == 0x000170, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_GetBounds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, Temp_int_Array_Index_Variable) == 0x00018C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_X) == 0x000190, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Y) == 0x000194, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Z) == 0x000198, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00019C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001A0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_FMax_ReturnValue) == 0x0001A4, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_SelectFloat_ReturnValue) == 0x0001A8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_GetBounds_ReturnValue1) == 0x0001AC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_GetBounds_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001C8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x0001CC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_X1) == 0x0001D0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Y1) == 0x0001D4, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Z1) == 0x0001D8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x0001DC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0001E0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_FMax_ReturnValue1) == 0x0001E4, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_FMax_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_NotEqual_ObjectObject_ReturnValue1) == 0x0001E8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_NotEqual_ObjectObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_SelectFloat_ReturnValue1) == 0x0001EC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_SelectFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0001F0, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0001F4, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, Temp_int_Loop_Counter_Variable) == 0x0001F8, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Add_IntInt_ReturnValue) == 0x0001FC, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_MakeStruct_SSplineMeshStep) == 0x000200, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_MakeStruct_SSplineMeshStep' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000210, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_FloatFloat_ReturnValue3) == 0x000214, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Get_Item2) == 0x000218, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000228, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Length_ReturnValue3) == 0x00022C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_MathExpression_ReturnValue) == 0x000230, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Less_IntInt_ReturnValue) == 0x000234, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_MathExpression_ReturnValue1) == 0x000238, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_MathExpression_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, K2Node_MakeStruct_SSplineMeshStep1) == 0x000240, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::K2Node_MakeStruct_SSplineMeshStep1' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_GetBounds_ReturnValue2) == 0x000250, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_GetBounds_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Array_Add_ReturnValue) == 0x00026C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_X2) == 0x000270, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Y2) == 0x000274, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BreakVector_Z2) == 0x000278, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Multiply_FloatFloat_ReturnValue4) == 0x00027C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Multiply_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000280, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_FMax_ReturnValue2) == 0x000284, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_FMax_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_SelectFloat_ReturnValue2) == 0x000288, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_SelectFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Add_FloatFloat_ReturnValue3) == 0x00028C, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Greater_FloatFloat_ReturnValue3) == 0x000290, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Greater_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_Subtract_FloatFloat_ReturnValue6) == 0x000294, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_Subtract_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000298, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_BuildMeshSequence, CallFunc_BooleanOR_ReturnValue) == 0x000299, "Member 'BP_NVSplineMesh_C_BuildMeshSequence::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_NVSplineMesh.BP_NVSplineMesh_C.GetLongestMeshes
// 0x0108 (0x0108 - 0x0000)
struct BP_NVSplineMesh_C_GetLongestMeshes final
{
public:
	TArray<class UStaticMesh*>                    Meshes;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	float                                         Tolerance;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    Matching_Meshes;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor)
	float                                         Longest;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMesh*>                    MeshList;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            CallFunc_Array_Get_Item1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue;                    // 0x0080(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FBoxSphereBounds                       CallFunc_GetBounds_ReturnValue1;                   // 0x009C(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue1;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue1;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NVSplineMesh_C_GetLongestMeshes) == 0x000008, "Wrong alignment on BP_NVSplineMesh_C_GetLongestMeshes");
static_assert(sizeof(BP_NVSplineMesh_C_GetLongestMeshes) == 0x000108, "Wrong size on BP_NVSplineMesh_C_GetLongestMeshes");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, Meshes) == 0x000000, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::Meshes' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, Tolerance) == 0x000010, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::Tolerance' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, Matching_Meshes) == 0x000018, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::Matching_Meshes' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, Longest) == 0x000028, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::Longest' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, MeshList) == 0x000030, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::MeshList' has a wrong offset!");
static_assert(offsetof(BP_NVSplineMesh_C_GetLongestMeshes, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_NVSplineMesh_C_GetLongestMeshes::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
