#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_DroneSpline

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"
#include "Struct_DroneSpawnConfig_structs.hpp"


namespace SDK::Params
{

// Function BP_PVP_DroneSpline.BP_PVP_DroneSpline_C.ExecuteUbergraph_BP_PVP_DroneSpline
// 0x0034 (0x0034 - 0x0000)
struct BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_DroneSpawnConfig               CallFunc_Array_Get_Item;                           // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStruct_DroneSpawnConfig               CallFunc_Array_Get_Item1;                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline) == 0x000004, "Wrong alignment on BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline");
static_assert(sizeof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline) == 0x000034, "Wrong size on BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, EntryPoint) == 0x000000, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Greater_IntInt_ReturnValue) == 0x00000C, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Array_Get_Item) == 0x000014, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Array_Length_ReturnValue1) == 0x000020, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000025, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Less_FloatFloat_ReturnValue) == 0x000026, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000027, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Array_Get_Item1) == 0x000028, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'BP_PVP_DroneSpline_C_ExecuteUbergraph_BP_PVP_DroneSpline::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_PVP_DroneSpline.BP_PVP_DroneSpline_C.GetDroneWeaponType
// 0x0058 (0x0058 - 0x0000)
struct BP_PVP_DroneSpline_C_GetDroneWeaponType final
{
public:
	EItemTypes                                    WeaponType;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RndFloat;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         total;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_DroneSpawnConfig               CallFunc_Array_Get_Item;                           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_DroneSpawnConfig               CallFunc_Array_Get_Item1;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_DroneSpline_C_GetDroneWeaponType) == 0x000004, "Wrong alignment on BP_PVP_DroneSpline_C_GetDroneWeaponType");
static_assert(sizeof(BP_PVP_DroneSpline_C_GetDroneWeaponType) == 0x000058, "Wrong size on BP_PVP_DroneSpline_C_GetDroneWeaponType");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, WeaponType) == 0x000000, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::WeaponType' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, RndFloat) == 0x000004, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::RndFloat' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, total) == 0x000008, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::total' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, Temp_int_Array_Index_Variable1) == 0x00001C, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, Temp_int_Loop_Counter_Variable1) == 0x000020, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_RandomFloatInRange_ReturnValue) == 0x000024, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Add_IntInt_ReturnValue1) == 0x000028, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Array_Get_Item) == 0x00002C, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000041, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Array_Length_ReturnValue1) == 0x000044, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Array_Get_Item1) == 0x000048, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Less_IntInt_ReturnValue1) == 0x000050, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_DroneSpline_C_GetDroneWeaponType, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_PVP_DroneSpline_C_GetDroneWeaponType::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

