#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_RunawayShow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PVP_RunawayShow.BP_PVP_RunawayShow_C
// 0x0050 (0x0378 - 0x0328)
class ABP_PVP_RunawayShow_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Win2;                                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Win1;                                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequenceGiaJason;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    SequenceCarlGrant;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnFinished;                                        // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_PVP_RunawayShow(int32 EntryPoint);
	void CustomEvent();
	void CustomEvent_0();
	void ShowRunaway(bool IsTeamA);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PVP_RunawayShow_C">();
	}
	static class ABP_PVP_RunawayShow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PVP_RunawayShow_C>();
	}
};
static_assert(alignof(ABP_PVP_RunawayShow_C) == 0x000008, "Wrong alignment on ABP_PVP_RunawayShow_C");
static_assert(sizeof(ABP_PVP_RunawayShow_C) == 0x000378, "Wrong size on ABP_PVP_RunawayShow_C");
static_assert(offsetof(ABP_PVP_RunawayShow_C, UberGraphFrame) == 0x000328, "Member 'ABP_PVP_RunawayShow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, Spline) == 0x000330, "Member 'ABP_PVP_RunawayShow_C::Spline' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, Arrow1) == 0x000338, "Member 'ABP_PVP_RunawayShow_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, Arrow) == 0x000340, "Member 'ABP_PVP_RunawayShow_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, Win2) == 0x000348, "Member 'ABP_PVP_RunawayShow_C::Win2' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, Win1) == 0x000350, "Member 'ABP_PVP_RunawayShow_C::Win1' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, SequenceGiaJason) == 0x000358, "Member 'ABP_PVP_RunawayShow_C::SequenceGiaJason' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, SequenceCarlGrant) == 0x000360, "Member 'ABP_PVP_RunawayShow_C::SequenceCarlGrant' has a wrong offset!");
static_assert(offsetof(ABP_PVP_RunawayShow_C, OnFinished) == 0x000368, "Member 'ABP_PVP_RunawayShow_C::OnFinished' has a wrong offset!");

}

