#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerControllerPVP_Base

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerControllerPVP_Base.BP_PlayerControllerPVP_Base_C.ExecuteUbergraph_BP_PlayerControllerPVP_Base
// 0x0060 (0x0060 - 0x0000)
struct BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0xB];                                        // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_FrontServerConnection_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue1;     // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base) == 0x000010, "Wrong alignment on BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base");
static_assert(sizeof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base) == 0x000060, "Wrong size on BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, EntryPoint) == 0x000000, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_IsLocalPlayerController_ReturnValue) == 0x000004, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_IsLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_HasAuthority_ReturnValue) == 0x000048, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_FinishSpawningActor_ReturnValue) == 0x000050, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base, CallFunc_IsLocalPlayerController_ReturnValue1) == 0x000059, "Member 'BP_PlayerControllerPVP_Base_C_ExecuteUbergraph_BP_PlayerControllerPVP_Base::CallFunc_IsLocalPlayerController_ReturnValue1' has a wrong offset!");

// Function BP_PlayerControllerPVP_Base.BP_PlayerControllerPVP_Base_C.InitPlayerController
// 0x0090 (0x0090 - 0x0000)
struct BP_PlayerControllerPVP_Base_C_InitPlayerController final
{
public:
	struct FYYMsgReqAckRoomMember                 PlayerInfo;                                        // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         CharType_0;                                        // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue1;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerControllerPVP_Base_C_InitPlayerController) == 0x000008, "Wrong alignment on BP_PlayerControllerPVP_Base_C_InitPlayerController");
static_assert(sizeof(BP_PlayerControllerPVP_Base_C_InitPlayerController) == 0x000090, "Wrong size on BP_PlayerControllerPVP_Base_C_InitPlayerController");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, PlayerInfo) == 0x000000, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::PlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, CharType_0) == 0x000048, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::CharType_0' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, CallFunc_Int64ToString_ReturnValue) == 0x000050, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::CallFunc_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, CallFunc_Int64ToString_ReturnValue1) == 0x000060, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::CallFunc_Int64ToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerControllerPVP_Base_C_InitPlayerController, CallFunc_Concat_StrStr_ReturnValue1) == 0x000080, "Member 'BP_PlayerControllerPVP_Base_C_InitPlayerController::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

}

