#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_WinnerShow

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PVP_WinnerShow.BP_PVP_WinnerShow_C.ExecuteUbergraph_BP_PVP_WinnerShow
// 0x0040 (0x0040 - 0x0000)
struct BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsTeamA;                        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnParticle_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow) == 0x000008, "Wrong alignment on BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow");
static_assert(sizeof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow) == 0x000040, "Wrong size on BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, EntryPoint) == 0x000000, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000008, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, K2Node_CreateDelegate_OutputDelegate1) == 0x000020, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, CallFunc_HasAuthority_ReturnValue1) == 0x000031, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, K2Node_CustomEvent_IsTeamA) == 0x000032, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::K2Node_CustomEvent_IsTeamA' has a wrong offset!");
static_assert(offsetof(BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow, CallFunc_SpawnParticle_ReturnValue) == 0x000038, "Member 'BP_PVP_WinnerShow_C_ExecuteUbergraph_BP_PVP_WinnerShow::CallFunc_SpawnParticle_ReturnValue' has a wrong offset!");

// Function BP_PVP_WinnerShow.BP_PVP_WinnerShow_C.ShowWinner
// 0x0001 (0x0001 - 0x0000)
struct BP_PVP_WinnerShow_C_ShowWinner final
{
public:
	bool                                          IsTeamA;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_WinnerShow_C_ShowWinner) == 0x000001, "Wrong alignment on BP_PVP_WinnerShow_C_ShowWinner");
static_assert(sizeof(BP_PVP_WinnerShow_C_ShowWinner) == 0x000001, "Wrong size on BP_PVP_WinnerShow_C_ShowWinner");
static_assert(offsetof(BP_PVP_WinnerShow_C_ShowWinner, IsTeamA) == 0x000000, "Member 'BP_PVP_WinnerShow_C_ShowWinner::IsTeamA' has a wrong offset!");

}

