#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_BGM

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_PVP_BGM.BP_PVP_BGM_C.ExecuteUbergraph_BP_PVP_BGM
// 0x0020 (0x0020 - 0x0000)
struct BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsPlay3;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPlay2;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPlay1;                        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPlay;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue1;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM) == 0x000008, "Wrong alignment on BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM");
static_assert(sizeof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM) == 0x000020, "Wrong size on BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, EntryPoint) == 0x000000, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, K2Node_CustomEvent_IsPlay3) == 0x000004, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::K2Node_CustomEvent_IsPlay3' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, K2Node_CustomEvent_IsPlay2) == 0x000005, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::K2Node_CustomEvent_IsPlay2' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, K2Node_CustomEvent_IsPlay1) == 0x000006, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::K2Node_CustomEvent_IsPlay1' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, K2Node_CustomEvent_IsPlay) == 0x000007, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::K2Node_CustomEvent_IsPlay' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_SpawnSound2D_ReturnValue) == 0x000008, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_SpawnSound2D_ReturnValue1) == 0x000010, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_SpawnSound2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_IsValid_ReturnValue1) == 0x000019, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_IsValid_ReturnValue2) == 0x00001A, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM, CallFunc_IsValid_ReturnValue3) == 0x00001B, "Member 'BP_PVP_BGM_C_ExecuteUbergraph_BP_PVP_BGM::CallFunc_IsValid_ReturnValue3' has a wrong offset!");

// Function BP_PVP_BGM.BP_PVP_BGM_C.OnPlayWinnerBGMBroadcast
// 0x0001 (0x0001 - 0x0000)
struct BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast) == 0x000001, "Wrong alignment on BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast");
static_assert(sizeof(BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast) == 0x000001, "Wrong size on BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast");
static_assert(offsetof(BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast, IsPlay) == 0x000000, "Member 'BP_PVP_BGM_C_OnPlayWinnerBGMBroadcast::IsPlay' has a wrong offset!");

// Function BP_PVP_BGM.BP_PVP_BGM_C.OnPlayBGMBroadcast
// 0x0001 (0x0001 - 0x0000)
struct BP_PVP_BGM_C_OnPlayBGMBroadcast final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_BGM_C_OnPlayBGMBroadcast) == 0x000001, "Wrong alignment on BP_PVP_BGM_C_OnPlayBGMBroadcast");
static_assert(sizeof(BP_PVP_BGM_C_OnPlayBGMBroadcast) == 0x000001, "Wrong size on BP_PVP_BGM_C_OnPlayBGMBroadcast");
static_assert(offsetof(BP_PVP_BGM_C_OnPlayBGMBroadcast, IsPlay) == 0x000000, "Member 'BP_PVP_BGM_C_OnPlayBGMBroadcast::IsPlay' has a wrong offset!");

// Function BP_PVP_BGM.BP_PVP_BGM_C.OnPlayWinnerBGM
// 0x0001 (0x0001 - 0x0000)
struct BP_PVP_BGM_C_OnPlayWinnerBGM final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_BGM_C_OnPlayWinnerBGM) == 0x000001, "Wrong alignment on BP_PVP_BGM_C_OnPlayWinnerBGM");
static_assert(sizeof(BP_PVP_BGM_C_OnPlayWinnerBGM) == 0x000001, "Wrong size on BP_PVP_BGM_C_OnPlayWinnerBGM");
static_assert(offsetof(BP_PVP_BGM_C_OnPlayWinnerBGM, IsPlay) == 0x000000, "Member 'BP_PVP_BGM_C_OnPlayWinnerBGM::IsPlay' has a wrong offset!");

// Function BP_PVP_BGM.BP_PVP_BGM_C.OnPlayBGM
// 0x0001 (0x0001 - 0x0000)
struct BP_PVP_BGM_C_OnPlayBGM final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_BGM_C_OnPlayBGM) == 0x000001, "Wrong alignment on BP_PVP_BGM_C_OnPlayBGM");
static_assert(sizeof(BP_PVP_BGM_C_OnPlayBGM) == 0x000001, "Wrong size on BP_PVP_BGM_C_OnPlayBGM");
static_assert(offsetof(BP_PVP_BGM_C_OnPlayBGM, IsPlay) == 0x000000, "Member 'BP_PVP_BGM_C_OnPlayBGM::IsPlay' has a wrong offset!");

}

