#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_FrontServerConnection

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.ExecuteUbergraph_BP_PVP_FrontServerConnection
// 0x08E8 (0x08E8 - 0x0000)
struct BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Room_Name1;                     // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Password;                       // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckCreateRoom                 K2Node_MakeStruct_YYMsgReqAckCreateRoom;           // 0x0028(0x00B0)()
	TArray<uint8>                                 CallFunc_PackReqAckCreateRoom_OutData;             // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckCreateRoom_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendMessageToServer_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData;                       // 0x00F0(0x0018)()
	int32                                         K2Node_CustomEvent_Page;                           // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Page_Size;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FYYMsgReqAckRoomInfo>           K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ZeroConstructor, ReferenceParm)
	struct FYYMsgReqAckRoomList                   K2Node_MakeStruct_YYMsgReqAckRoomList;             // 0x0120(0x0020)()
	TArray<uint8>                                 CallFunc_PackReqAckRoomList_OutData;               // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckRoomList_ReturnValue;           // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData1;                      // 0x0158(0x0018)()
	class FString                                 K2Node_CustomEvent_Room_Name;                      // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Team;                           // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Position;                       // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckEnterRoom                  K2Node_MakeStruct_YYMsgReqAckEnterRoom;            // 0x0188(0x0040)()
	TArray<uint8>                                 CallFunc_PackReqAckEnterRoom_OutData;              // 0x01C8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckEnterRoom_ReturnValue;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_PackReqAckRoomInfo_OutData;               // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckRoomInfo_ReturnValue;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData2;                      // 0x01F8(0x0018)()
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData3;                      // 0x0210(0x0018)()
	class FString                                 K2Node_CustomEvent_RoomName;                       // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgData                             K2Node_Event_Message;                              // 0x0238(0x0018)()
	struct FYYMsgReqAckQuickEnter                 CallFunc_UnpackReqAckQuickEnter_OutUE4Data;        // 0x0250(0x0090)()
	bool                                          CallFunc_UnpackReqAckQuickEnter_ReturnValue;       // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomStart                  CallFunc_UnpackReqAckRoomStart_OutUE4Data;         // 0x02E8(0x00A8)()
	bool                                          CallFunc_UnpackReqAckRoomStart_ReturnValue;        // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckEnterRoom                  CallFunc_UnpackReqAckEnterRoom_OutUE4Data;         // 0x0398(0x0040)()
	bool                                          CallFunc_UnpackReqAckEnterRoom_ReturnValue;        // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckCreateRoom                 CallFunc_UnpackReqAckCreateRoom_OutUE4Data;        // 0x03E0(0x00B0)()
	bool                                          CallFunc_UnpackReqAckCreateRoom_ReturnValue;       // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomList                   CallFunc_UnpackReqAckRoomList_OutUE4Data;          // 0x0498(0x0020)()
	bool                                          CallFunc_UnpackReqAckRoomList_ReturnValue;         // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BA[0x6];                                      // 0x04BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomInfo                   CallFunc_UnpackReqAckRoomInfo_OutUE4Data;          // 0x04C0(0x0080)()
	bool                                          CallFunc_UnpackReqAckRoomInfo_ReturnValue;         // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckLogin                      CallFunc_UnpackReqAckLogin_OutUE4Data;             // 0x0548(0x0058)()
	bool                                          CallFunc_UnpackReqAckLogin_ReturnValue;            // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x05A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x05A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x05A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x05A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x05A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue7;         // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomStart                  K2Node_MakeStruct_YYMsgReqAckRoomStart;            // 0x05B0(0x00A8)()
	TArray<uint8>                                 CallFunc_PackReqAckRoomStart_OutData;              // 0x0658(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckRoomStart_ReturnValue;          // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomInfo                   K2Node_CustomEvent_RoomInfo;                       // 0x0670(0x0080)()
	TArray<uint8>                                 CallFunc_PackReqAckRoomInfo_OutData1;              // 0x06F0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckRoomInfo_ReturnValue1;          // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x7];                                      // 0x0701(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData4;                      // 0x0708(0x0018)()
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData5;                      // 0x0720(0x0018)()
	struct FYYMsgIdent                            K2Node_CustomEvent_Player_ID;                      // 0x0738(0x0010)(NoDestructor)
	struct FYYMsgReqAckQuickEnter                 K2Node_MakeStruct_YYMsgReqAckQuickEnter;           // 0x0748(0x0090)()
	TArray<uint8>                                 CallFunc_PackReqAckQuickEnter_OutData;             // 0x07D8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckQuickEnter_ReturnValue;         // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData6;                      // 0x07F0(0x0018)()
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80C[0x4];                                      // 0x080C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetChannelID_ReturnValue;                 // 0x0810(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetViveportHeadUrl_ReturnValue;           // 0x0820(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_834[0x4];                                      // 0x0834(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetViveportNickName_ReturnValue;          // 0x0838(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetViveportID_ReturnValue;                // 0x0848(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckLogin                      K2Node_MakeStruct_YYMsgReqAckLogin;                // 0x0858(0x0058)()
	TArray<uint8>                                 CallFunc_PackReqAckLogin_OutData;                  // 0x08B0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckLogin_ReturnValue;              // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData7;                      // 0x08C8(0x0018)()
	bool                                          CallFunc_SendMessageToServer_ReturnValue1;         // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection) == 0x0008E8, "Wrong size on BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, EntryPoint) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Room_Name1) == 0x000008, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Room_Name1' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Password) == 0x000018, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Password' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckCreateRoom) == 0x000028, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckCreateRoom' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckCreateRoom_OutData) == 0x0000D8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckCreateRoom_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckCreateRoom_ReturnValue) == 0x0000E8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckCreateRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_SendMessageToServer_ReturnValue) == 0x0000E9, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_SendMessageToServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData) == 0x0000F0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Page) == 0x000108, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Page' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Page_Size) == 0x00010C, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Page_Size' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeArray_Array) == 0x000110, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckRoomList) == 0x000120, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckRoomList' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomList_OutData) == 0x000140, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomList_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomList_ReturnValue) == 0x000150, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData1) == 0x000158, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData1' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Room_Name) == 0x000170, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Room_Name' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Team) == 0x000180, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Position) == 0x000184, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Position' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckEnterRoom) == 0x000188, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckEnterRoom' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckEnterRoom_OutData) == 0x0001C8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckEnterRoom_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckEnterRoom_ReturnValue) == 0x0001D8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckEnterRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomInfo_OutData) == 0x0001E0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomInfo_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomInfo_ReturnValue) == 0x0001F0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData2) == 0x0001F8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData2' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData3) == 0x000210, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData3' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_RoomName) == 0x000228, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_RoomName' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_Event_Message) == 0x000238, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckQuickEnter_OutUE4Data) == 0x000250, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckQuickEnter_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckQuickEnter_ReturnValue) == 0x0002E0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckQuickEnter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomStart_OutUE4Data) == 0x0002E8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomStart_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomStart_ReturnValue) == 0x000390, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckEnterRoom_OutUE4Data) == 0x000398, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckEnterRoom_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckEnterRoom_ReturnValue) == 0x0003D8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckEnterRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckCreateRoom_OutUE4Data) == 0x0003E0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckCreateRoom_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckCreateRoom_ReturnValue) == 0x000490, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckCreateRoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomList_OutUE4Data) == 0x000498, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomList_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomList_ReturnValue) == 0x0004B8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomList_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0004B9, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomInfo_OutUE4Data) == 0x0004C0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomInfo_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckRoomInfo_ReturnValue) == 0x000540, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckRoomInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckLogin_OutUE4Data) == 0x000548, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckLogin_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_UnpackReqAckLogin_ReturnValue) == 0x0005A0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_UnpackReqAckLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005A1, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x0005A2, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0005A3, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0005A4, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x0005A5, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x0005A6, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue6) == 0x0005A7, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_EqualEqual_ByteByte_ReturnValue7) == 0x0005A8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_EqualEqual_ByteByte_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckRoomStart) == 0x0005B0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckRoomStart' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomStart_OutData) == 0x000658, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomStart_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomStart_ReturnValue) == 0x000668, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_RoomInfo) == 0x000670, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_RoomInfo' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomInfo_OutData1) == 0x0006F0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomInfo_OutData1' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckRoomInfo_ReturnValue1) == 0x000700, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckRoomInfo_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData4) == 0x000708, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData4' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData5) == 0x000720, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData5' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_CustomEvent_Player_ID) == 0x000738, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_CustomEvent_Player_ID' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckQuickEnter) == 0x000748, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckQuickEnter' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckQuickEnter_OutData) == 0x0007D8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckQuickEnter_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckQuickEnter_ReturnValue) == 0x0007E8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckQuickEnter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData6) == 0x0007F0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData6' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_Event_DeltaSeconds) == 0x000808, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_GetChannelID_ReturnValue) == 0x000810, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_GetChannelID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_GetViveportHeadUrl_ReturnValue) == 0x000820, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_GetViveportHeadUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_Conv_StringToInt_ReturnValue) == 0x000830, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_GetViveportNickName_ReturnValue) == 0x000838, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_GetViveportNickName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_GetViveportID_ReturnValue) == 0x000848, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_GetViveportID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgReqAckLogin) == 0x000858, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgReqAckLogin' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckLogin_OutData) == 0x0008B0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckLogin_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_PackReqAckLogin_ReturnValue) == 0x0008C0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_PackReqAckLogin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, K2Node_MakeStruct_YYMsgData7) == 0x0008C8, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::K2Node_MakeStruct_YYMsgData7' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection, CallFunc_SendMessageToServer_ReturnValue1) == 0x0008E0, "Member 'BP_PVP_FrontServerConnection_C_ExecuteUbergraph_BP_PVP_FrontServerConnection::CallFunc_SendMessageToServer_ReturnValue1' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PVP_FrontServerConnection_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PVP_FrontServerConnection_C_ReceiveTick");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_ReceiveTick) == 0x000004, "Wrong size on BP_PVP_FrontServerConnection_C_ReceiveTick");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqQuickEnter
// 0x0010 (0x0010 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqQuickEnter final
{
public:
	struct FYYMsgIdent                            Player_ID;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqQuickEnter) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqQuickEnter");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqQuickEnter) == 0x000010, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqQuickEnter");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqQuickEnter, Player_ID) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqQuickEnter::Player_ID' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqRoomInfo
// 0x0080 (0x0080 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqRoomInfo final
{
public:
	struct FYYMsgReqAckRoomInfo                   RoomInfo;                                          // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqRoomInfo) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqRoomInfo");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqRoomInfo) == 0x000080, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqRoomInfo");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqRoomInfo, RoomInfo) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqRoomInfo::RoomInfo' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.Evt_ReceiveMessage
// 0x0018 (0x0018 - 0x0000)
struct BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage final
{
public:
	struct FYYMsgData                             Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage) == 0x000018, "Wrong size on BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage, Message) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_Evt_ReceiveMessage::Message' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqRoomStart
// 0x0010 (0x0010 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqRoomStart final
{
public:
	class FString                                 RoomName;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqRoomStart) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqRoomStart");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqRoomStart) == 0x000010, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqRoomStart");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqRoomStart, RoomName) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqRoomStart::RoomName' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqEnterRoom
// 0x0018 (0x0018 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqEnterRoom final
{
public:
	class FString                                 Room_Name;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Position;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqEnterRoom) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqEnterRoom");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqEnterRoom) == 0x000018, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqEnterRoom");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqEnterRoom, Room_Name) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqEnterRoom::Room_Name' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqEnterRoom, Team) == 0x000010, "Member 'BP_PVP_FrontServerConnection_C_SendReqEnterRoom::Team' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqEnterRoom, Position) == 0x000014, "Member 'BP_PVP_FrontServerConnection_C_SendReqEnterRoom::Position' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqRoomList
// 0x0008 (0x0008 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqRoomList final
{
public:
	int32                                         page;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Page_Size;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqRoomList) == 0x000004, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqRoomList");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqRoomList) == 0x000008, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqRoomList");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqRoomList, page) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqRoomList::page' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqRoomList, Page_Size) == 0x000004, "Member 'BP_PVP_FrontServerConnection_C_SendReqRoomList::Page_Size' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.SendReqCreateRoom
// 0x0020 (0x0020 - 0x0000)
struct BP_PVP_FrontServerConnection_C_SendReqCreateRoom final
{
public:
	class FString                                 Room_Name;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Password;                                          // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_SendReqCreateRoom) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_SendReqCreateRoom");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_SendReqCreateRoom) == 0x000020, "Wrong size on BP_PVP_FrontServerConnection_C_SendReqCreateRoom");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqCreateRoom, Room_Name) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_SendReqCreateRoom::Room_Name' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_SendReqCreateRoom, Password) == 0x000010, "Member 'BP_PVP_FrontServerConnection_C_SendReqCreateRoom::Password' has a wrong offset!");

// Function BP_PVP_FrontServerConnection.BP_PVP_FrontServerConnection_C.CountPlayers
// 0x0280 (0x0280 - 0x0000)
struct BP_PVP_FrontServerConnection_C_CountPlayers final
{
public:
	struct FYYMsgReqAckRoomInfo                   RoomInfo;                                          // 0x0000(0x0080)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Count;                                             // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         nCount;                                            // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item;                           // 0x0090(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue;                // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item1;                          // 0x0100(0x0048)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue1;               // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue1;            // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue1;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16E[0x2];                                      // 0x016E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item2;                          // 0x0180(0x0048)()
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue2;               // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue2;            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue2;                     // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item3;                          // 0x0210(0x0048)()
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue3;               // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue3;            // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue3;                     // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_FrontServerConnection_C_CountPlayers) == 0x000008, "Wrong alignment on BP_PVP_FrontServerConnection_C_CountPlayers");
static_assert(sizeof(BP_PVP_FrontServerConnection_C_CountPlayers) == 0x000280, "Wrong size on BP_PVP_FrontServerConnection_C_CountPlayers");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_CountPlayers, RoomInfo) == 0x000000, "Member 'BP_PVP_FrontServerConnection_C_CountPlayers::RoomInfo' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_CountPlayers, Count) == 0x000080, "Member 'BP_PVP_FrontServerConnection_C_CountPlayers::Count' has a wrong offset!");
static_assert(offsetof(BP_PVP_FrontServerConnection_C_CountPlayers, nCount) == 0x000084, "Member 'BP_PVP_FrontServerConnection_C_CountPlayers::nCount' has a wrong offset!");
