#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_LoaderServerConnection

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.ExecuteUbergraph_BP_PVP_LoaderServerConnection
// 0x02B8 (0x02B8 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOriginalCommandLine_ReturnValue;       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_Event_Message;                              // 0x0020(0x0018)()
	struct FYYMsgReqAckPVPServerRegister          CallFunc_UnpackReqAckPVPServerRegister_OutUE4Data; // 0x0038(0x00A0)()
	bool                                          CallFunc_UnpackReqAckPVPServerRegister_ReturnValue; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetServerRunPort_ReturnValue;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CommandLineArgValue_value;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommandLineArgValue_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_CommandLineArgValue_value1;               // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommandLineArgValue_ReturnValue1;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Trim_ReturnValue;                         // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Trim_ReturnValue1;                        // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue;                // 0x0180(0x0008)(NoDestructor)
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue1;               // 0x0188(0x0008)(NoDestructor)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgIdent                            K2Node_MakeStruct_YYMsgIdent;                      // 0x01A0(0x0010)(NoDestructor)
	struct FYYMsgReqAckPVPServerRegister          K2Node_MakeStruct_YYMsgReqAckPVPServerRegister;    // 0x01B0(0x00A0)()
	class FString                                 CallFunc_CommandLineArgValue_value2;               // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommandLineArgValue_ReturnValue2;         // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CallFunc_PackReqAckPVPServerRegister_OutData;      // 0x0268(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_PackReqAckPVPServerRegister_ReturnValue;  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgData                             K2Node_MakeStruct_YYMsgData;                       // 0x0280(0x0018)()
	class FString                                 CallFunc_Trim_ReturnValue2;                        // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendMessageToServer_ReturnValue;          // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartConnectToServer_bIsAlreadyConnected; // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartConnectToServer_ReturnValue;         // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection) == 0x000008, "Wrong alignment on BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection");
static_assert(sizeof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection) == 0x0002B8, "Wrong size on BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, EntryPoint) == 0x000000, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_GetOriginalCommandLine_ReturnValue) == 0x000008, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_GetOriginalCommandLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_IsPlayInEditor_ReturnValue) == 0x000019, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, K2Node_Event_Message) == 0x000020, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_UnpackReqAckPVPServerRegister_OutUE4Data) == 0x000038, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_UnpackReqAckPVPServerRegister_OutUE4Data' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_UnpackReqAckPVPServerRegister_ReturnValue) == 0x0000D8, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_UnpackReqAckPVPServerRegister_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, K2Node_SwitchEnum_CmpSuccess) == 0x0000D9, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_GetServerRunPort_ReturnValue) == 0x0000DC, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_GetServerRunPort_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_value) == 0x0000E8, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_value' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_ReturnValue) == 0x0000F8, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_value1) == 0x000100, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_value1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_ReturnValue1) == 0x000110, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Trim_ReturnValue) == 0x000118, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Trim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Trim_ReturnValue1) == 0x000128, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Trim_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Replace_ReturnValue) == 0x000138, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Concat_StrStr_ReturnValue) == 0x000148, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Split_LeftS) == 0x000158, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Split_RightS) == 0x000168, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Split_ReturnValue) == 0x000178, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_StringToInt64_ReturnValue) == 0x000180, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_StringToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_StringToInt64_ReturnValue1) == 0x000188, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_StringToInt64_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Concat_StrStr_ReturnValue1) == 0x000190, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, K2Node_MakeStruct_YYMsgIdent) == 0x0001A0, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::K2Node_MakeStruct_YYMsgIdent' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, K2Node_MakeStruct_YYMsgReqAckPVPServerRegister) == 0x0001B0, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::K2Node_MakeStruct_YYMsgReqAckPVPServerRegister' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_value2) == 0x000250, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_value2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_CommandLineArgValue_ReturnValue2) == 0x000260, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_CommandLineArgValue_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_PackReqAckPVPServerRegister_OutData) == 0x000268, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_PackReqAckPVPServerRegister_OutData' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_PackReqAckPVPServerRegister_ReturnValue) == 0x000278, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_PackReqAckPVPServerRegister_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, K2Node_MakeStruct_YYMsgData) == 0x000280, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::K2Node_MakeStruct_YYMsgData' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Trim_ReturnValue2) == 0x000298, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Trim_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_SendMessageToServer_ReturnValue) == 0x0002A8, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_SendMessageToServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_Conv_StringToInt_ReturnValue) == 0x0002AC, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_StartConnectToServer_bIsAlreadyConnected) == 0x0002B0, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_StartConnectToServer_bIsAlreadyConnected' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection, CallFunc_StartConnectToServer_ReturnValue) == 0x0002B1, "Member 'BP_PVP_LoaderServerConnection_C_ExecuteUbergraph_BP_PVP_LoaderServerConnection::CallFunc_StartConnectToServer_ReturnValue' has a wrong offset!");

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.Evt_ReceiveMessage
// 0x0018 (0x0018 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage final
{
public:
	struct FYYMsgData                             Message;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage) == 0x000008, "Wrong alignment on BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage");
static_assert(sizeof(BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage) == 0x000018, "Wrong size on BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage, Message) == 0x000000, "Member 'BP_PVP_LoaderServerConnection_C_Evt_ReceiveMessage::Message' has a wrong offset!");

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.StringToFBIdent
// 0x0090 (0x0090 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_StringToFBIdent final
{
public:
	class FString                                 In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgIdent                            Out;                                               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
	bool                                          Success;                                           // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue;                // 0x0028(0x0008)(NoDestructor)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue1;               // 0x0058(0x0008)(NoDestructor)
	struct FYYMsgIdent                            K2Node_MakeStruct_YYMsgIdent;                      // 0x0060(0x0010)(NoDestructor)
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue2;               // 0x0070(0x0008)(NoDestructor)
	struct FYYMsgInt64                            CallFunc_StringToInt64_ReturnValue3;               // 0x0078(0x0008)(NoDestructor)
	struct FYYMsgIdent                            K2Node_MakeStruct_YYMsgIdent1;                     // 0x0080(0x0010)(NoDestructor)
};
static_assert(alignof(BP_PVP_LoaderServerConnection_C_StringToFBIdent) == 0x000008, "Wrong alignment on BP_PVP_LoaderServerConnection_C_StringToFBIdent");
static_assert(sizeof(BP_PVP_LoaderServerConnection_C_StringToFBIdent) == 0x000090, "Wrong size on BP_PVP_LoaderServerConnection_C_StringToFBIdent");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, In) == 0x000000, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::In' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, Out) == 0x000010, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::Out' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, Success) == 0x000020, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::Success' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_StringToInt64_ReturnValue) == 0x000028, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_StringToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_Split_LeftS) == 0x000030, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_Split_RightS) == 0x000040, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_Split_ReturnValue) == 0x000050, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_StringToInt64_ReturnValue1) == 0x000058, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_StringToInt64_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, K2Node_MakeStruct_YYMsgIdent) == 0x000060, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::K2Node_MakeStruct_YYMsgIdent' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_StringToInt64_ReturnValue2) == 0x000070, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_StringToInt64_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, CallFunc_StringToInt64_ReturnValue3) == 0x000078, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::CallFunc_StringToInt64_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_StringToFBIdent, K2Node_MakeStruct_YYMsgIdent1) == 0x000080, "Member 'BP_PVP_LoaderServerConnection_C_StringToFBIdent::K2Node_MakeStruct_YYMsgIdent1' has a wrong offset!");

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.FBIdentToString
// 0x0060 (0x0060 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_FBIdentToString final
{
public:
	struct FYYMsgIdent                            In;                                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FString                                 Out;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue1;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_LoaderServerConnection_C_FBIdentToString) == 0x000008, "Wrong alignment on BP_PVP_LoaderServerConnection_C_FBIdentToString");
static_assert(sizeof(BP_PVP_LoaderServerConnection_C_FBIdentToString) == 0x000060, "Wrong size on BP_PVP_LoaderServerConnection_C_FBIdentToString");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, In) == 0x000000, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::In' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, Out) == 0x000010, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::Out' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, CallFunc_Int64ToString_ReturnValue) == 0x000020, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::CallFunc_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, CallFunc_Int64ToString_ReturnValue1) == 0x000030, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::CallFunc_Int64ToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_FBIdentToString, CallFunc_Concat_StrStr_ReturnValue1) == 0x000050, "Member 'BP_PVP_LoaderServerConnection_C_FBIdentToString::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.IsPlayerInRoom
// 0x03E8 (0x03E8 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_IsPlayerInRoom final
{
public:
	class FString                                 PlayerID;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomInfo                   RoomInfo_0;                                        // 0x0010(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsInRoom;                                          // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Team;                                              // 0x0094(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 PlayerInfo;                                        // 0x0098(0x0048)(Parm, OutParm)
	struct FYYMsgReqAckRoomMember                 TmpInfo;                                           // 0x00E0(0x0048)(Edit, BlueprintVisible)
	int32                                         TeamID;                                            // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsIn;                                              // 0x012C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_145[0x3];                                      // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item;                           // 0x0168(0x0048)()
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item1;                          // 0x01B0(0x0048)()
	class FString                                 CallFunc_FBIdentToString_Out;                      // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FBIdentToString_Out1;                     // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FBIdentToString_Out2;                     // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue;                // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue1;               // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue1;            // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue1;                     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FBIdentToString_Out3;                     // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue1;           // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A2[0x2];                                      // 0x02A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item2;                          // 0x02A8(0x0048)()
	class FString                                 CallFunc_FBIdentToString_Out4;                     // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue2;               // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue2;           // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue2;            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue2;                     // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_323[0x1];                                      // 0x0323(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FBIdentToString_Out5;                     // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item3;                          // 0x0340(0x0048)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_FBIdentToString_Out6;                     // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Int64ToString_ReturnValue3;               // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue3;            // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_FBIdentToString_Out7;                     // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue3;                     // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue3;           // 0x03E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x03E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x03E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom) == 0x000008, "Wrong alignment on BP_PVP_LoaderServerConnection_C_IsPlayerInRoom");
static_assert(sizeof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom) == 0x0003E8, "Wrong size on BP_PVP_LoaderServerConnection_C_IsPlayerInRoom");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, PlayerID) == 0x000000, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::PlayerID' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, RoomInfo_0) == 0x000010, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::RoomInfo_0' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, IsInRoom) == 0x000090, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::IsInRoom' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Team) == 0x000094, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Team' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, PlayerInfo) == 0x000098, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::PlayerInfo' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, TmpInfo) == 0x0000E0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::TmpInfo' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, TeamID) == 0x000128, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::TeamID' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, IsIn) == 0x00012C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::IsIn' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Loop_Counter_Variable) == 0x000130, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Add_IntInt_ReturnValue) == 0x000134, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Length_ReturnValue) == 0x000138, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Length_ReturnValue1) == 0x00013C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Length_ReturnValue2) == 0x000140, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Less_IntInt_ReturnValue) == 0x000144, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Length_ReturnValue3) == 0x000148, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Loop_Counter_Variable1) == 0x00014C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Loop_Counter_Variable2) == 0x000150, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Less_IntInt_ReturnValue1) == 0x000154, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Less_IntInt_ReturnValue2) == 0x000155, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Add_IntInt_ReturnValue1) == 0x000158, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Add_IntInt_ReturnValue2) == 0x00015C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Array_Index_Variable) == 0x000160, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Array_Index_Variable1) == 0x000164, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Get_Item) == 0x000168, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Get_Item1) == 0x0001B0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out) == 0x0001F8, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out1) == 0x000208, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Concat_StrStr_ReturnValue) == 0x000218, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Concat_StrStr_ReturnValue1) == 0x000228, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out2) == 0x000238, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Int64ToString_ReturnValue) == 0x000248, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Int64ToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000258, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Conv_StringToInt_ReturnValue) == 0x00025C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Abs_Int_ReturnValue) == 0x000260, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Int64ToString_ReturnValue1) == 0x000268, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Int64ToString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Greater_IntInt_ReturnValue) == 0x000278, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Conv_StringToInt_ReturnValue1) == 0x00027C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Conv_StringToInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_BooleanAND_ReturnValue) == 0x000280, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Abs_Int_ReturnValue1) == 0x000284, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Abs_Int_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Greater_IntInt_ReturnValue1) == 0x000288, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out3) == 0x000290, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_EqualEqual_StrStr_ReturnValue1) == 0x0002A0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_EqualEqual_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_BooleanAND_ReturnValue1) == 0x0002A1, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Array_Index_Variable2) == 0x0002A4, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Get_Item2) == 0x0002A8, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out4) == 0x0002F0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out4' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Int64ToString_ReturnValue2) == 0x000300, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Int64ToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_EqualEqual_StrStr_ReturnValue2) == 0x000310, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_EqualEqual_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Conv_StringToInt_ReturnValue2) == 0x000314, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Conv_StringToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Loop_Counter_Variable3) == 0x000318, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Abs_Int_ReturnValue2) == 0x00031C, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Abs_Int_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Less_IntInt_ReturnValue3) == 0x000320, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Greater_IntInt_ReturnValue2) == 0x000321, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_BooleanAND_ReturnValue2) == 0x000322, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Add_IntInt_ReturnValue3) == 0x000324, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, Temp_int_Array_Index_Variable3) == 0x000328, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out5) == 0x000330, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out5' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Array_Get_Item3) == 0x000340, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Concat_StrStr_ReturnValue2) == 0x000388, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out6) == 0x000398, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out6' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Concat_StrStr_ReturnValue3) == 0x0003A8, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Int64ToString_ReturnValue3) == 0x0003B8, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Int64ToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Conv_StringToInt_ReturnValue3) == 0x0003C8, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Conv_StringToInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_FBIdentToString_Out7) == 0x0003D0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_FBIdentToString_Out7' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Abs_Int_ReturnValue3) == 0x0003E0, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Abs_Int_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_EqualEqual_StrStr_ReturnValue3) == 0x0003E4, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_EqualEqual_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_Greater_IntInt_ReturnValue3) == 0x0003E5, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_LoaderServerConnection_C_IsPlayerInRoom, CallFunc_BooleanAND_ReturnValue3) == 0x0003E6, "Member 'BP_PVP_LoaderServerConnection_C_IsPlayerInRoom::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");

// Function BP_PVP_LoaderServerConnection.BP_PVP_LoaderServerConnection_C.CountPlayers
// 0x0280 (0x0280 - 0x0000)
struct BP_PVP_LoaderServerConnection_C_CountPlayers final
{
public:
	struct FYYMsgReqAckRoomInfo                   RoomInfo_0;                                        // 0x0000(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Count;                                             // 0x0080(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         nCount;                                            // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item;                           // 0x0090(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Int64ToString_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FYYMsgReqAckRoomMember                 CallFunc_Array_Get_Item1;                          // 0x0100(0x0048)()
