#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pawn_UnCrouch

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Pawn_UnCrouch.BP_Pawn_UnCrouch_C.ExecuteUbergraph_BP_Pawn_UnCrouch
// 0x0038 (0x0038 - 0x0000)
struct BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch) == 0x000008, "Wrong alignment on BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch");
static_assert(sizeof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch) == 0x000038, "Wrong size on BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, EntryPoint) == 0x000000, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, K2Node_Event_ControlledPawn) == 0x000008, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, K2Node_DynamicCast_AsCharacter) == 0x000010, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, K2Node_DynamicCast_AsBP_AIC) == 0x000028, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch, CallFunc_IsCrouching_ReturnValue) == 0x000031, "Member 'BP_Pawn_UnCrouch_C_ExecuteUbergraph_BP_Pawn_UnCrouch::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");

// Function BP_Pawn_UnCrouch.BP_Pawn_UnCrouch_C.ActionStart
// 0x0008 (0x0008 - 0x0000)
struct BP_Pawn_UnCrouch_C_ActionStart final
{
public:
	class APawn*                                  ControlledPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Pawn_UnCrouch_C_ActionStart) == 0x000008, "Wrong alignment on BP_Pawn_UnCrouch_C_ActionStart");
static_assert(sizeof(BP_Pawn_UnCrouch_C_ActionStart) == 0x000008, "Wrong size on BP_Pawn_UnCrouch_C_ActionStart");
static_assert(offsetof(BP_Pawn_UnCrouch_C_ActionStart, ControlledPawn) == 0x000000, "Member 'BP_Pawn_UnCrouch_C_ActionStart::ControlledPawn' has a wrong offset!");

}

