#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prop_Slide

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_Winner_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Prop_Slide.BP_Prop_Slide_C.ExecuteUbergraph_BP_Prop_Slide
// 0x0580 (0x0580 - 0x0000)
struct BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable2;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProp_Slide_Skeleton_AnimBlueprint_C*   K2Node_DynamicCast_AsProp_Slide_Skeleton_Anim_Blueprint; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PVP_Center_Prop_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_PVP_Center_Prop_C*                  CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsLeft;                         // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue1;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base1;       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue2;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base2;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue3;                 // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base3;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x019C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue1;                   // 0x01AC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item1;                          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	Enum_Winner                                   CallFunc_GetCharEnumFromInt_Char;                  // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsA;                            // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue1;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue2;                 // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue2; // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Time;                           // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalNum_Out_1;                             // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalNum_Out_2;                             // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalNum_Out_3;                             // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue4;                 // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base4;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue1;             // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue5;                 // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base5;       // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x0289(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28A[0x6];                                      // 0x028A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item2;                          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x029D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29E[0x2];                                      // 0x029E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_RunawayShow_C*                  K2Node_DynamicCast_AsBP_PVP_Runaway_Show;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x02B0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue1;      // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue3;          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue4;          // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0xE];                                      // 0x0312(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Select2_Default;                            // 0x0320(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class ABP_PVP_BGM_C*>                  CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0350(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_BGM_C*                          CallFunc_Array_Get_Item3;                          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable1;                             // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select3_Default;                            // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue1;           // 0x03B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue1;        // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x03C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue2;        // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue3;           // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue3;        // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue4;           // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue4;        // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue7;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_412[0x2];                                      // 0x0412(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue5;           // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue5;        // 0x0420(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue6;           // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue6;        // 0x0438(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue7;           // 0x0440(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0450(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue2;                   // 0x04D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue3;                   // 0x04E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue6;                 // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base6;       // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select4_Default;                            // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item4;                          // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base7;       // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item5;                          // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x0548(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                CallFunc_Array_Get_Item6;                          // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x0559(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55A[0x6];                                      // 0x055A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_PVP_StartPosition_C*>        CallFunc_GetAllActorsOfClass_OutActors2;           // 0x0560(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_PVP_StartPosition_C*                CallFunc_Array_Get_Item7;                          // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide) == 0x000010, "Wrong alignment on BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide");
static_assert(sizeof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide) == 0x000580, "Wrong size on BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, EntryPoint) == 0x000000, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Variable) == 0x000004, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Variable1) == 0x000005, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_float_Variable) == 0x000008, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_float_Variable1) == 0x00000C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_string_Variable) == 0x000018, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Variable2) == 0x000028, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable1) == 0x000034, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue1) == 0x000038, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable1) == 0x00003C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable2) == 0x000040, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue2) == 0x000044, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Variable3) == 0x000048, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_IsClosed_Variable) == 0x000049, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Has_Been_Initd_Variable) == 0x00004A, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_HasAuthority_ReturnValue) == 0x000060, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Abs_ReturnValue) == 0x000064, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable3) == 0x00006C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue3) == 0x000070, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable2) == 0x000074, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_bool_Variable4) == 0x000078, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_HasAuthority_ReturnValue1) == 0x000079, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable3) == 0x00007C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable4) == 0x000080, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue4) == 0x000084, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable4) == 0x000088, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_HasAuthority_ReturnValue2) == 0x00008C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable5) == 0x000090, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Loop_Counter_Variable6) == 0x000094, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue5) == 0x000098, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_IntInt_ReturnValue6) == 0x00009C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, Temp_int_Array_Index_Variable5) == 0x0000A0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x0000A4, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x0000A8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_Event_DeltaSeconds) == 0x0000AC, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetAnimInstance_ReturnValue) == 0x0000B0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_AsProp_Slide_Skeleton_Anim_Blueprint) == 0x0000B8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_AsProp_Slide_Skeleton_Anim_Blueprint' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_HasAuthority_ReturnValue3) == 0x0000E8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Greater_IntInt_ReturnValue) == 0x0000E9, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_CustomEvent_IsLeft) == 0x0000EA, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_CustomEvent_IsLeft' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_IsValid_ReturnValue) == 0x0000EB, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000F4, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000F8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x0000FC, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000100, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetGameMode_ReturnValue) == 0x000108, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base) == 0x000110, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetGameMode_ReturnValue1) == 0x000120, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetGameMode_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base1) == 0x000128, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_bSuccess2) == 0x000130, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetGameMode_ReturnValue2) == 0x000138, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetGameMode_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetTransform_ReturnValue) == 0x000140, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base2) == 0x000170, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_bSuccess3) == 0x000178, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Length_ReturnValue1) == 0x00017C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Less_IntInt_ReturnValue) == 0x000180, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000181, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetGameMode_ReturnValue3) == 0x000188, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetGameMode_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base3) == 0x000190, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base3' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_DynamicCast_bSuccess4) == 0x000198, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_MakeColor_ReturnValue) == 0x00019C, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_MakeColor_ReturnValue1) == 0x0001AC, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_MakeColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Get_Item1) == 0x0001C0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Length_ReturnValue2) == 0x0001C8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Less_IntInt_ReturnValue1) == 0x0001CC, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetCharEnumFromInt_Char) == 0x0001CD, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetCharEnumFromInt_Char' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Array_Add_ReturnValue) == 0x0001D0, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_CustomEvent_IsA) == 0x0001D4, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_CustomEvent_IsA' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_Select_Default) == 0x0001D8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, K2Node_Select1_Default) == 0x0001E8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001F8, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetMaterial_ReturnValue) == 0x000200, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetMaterial_ReturnValue1) == 0x000208, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetMaterial_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000210, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_CreateDynamicMaterialInstance_ReturnValue1) == 0x000218, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_CreateDynamicMaterialInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_GetMaterial_ReturnValue2) == 0x000220, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_GetMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_CreateDynamicMaterialInstance_ReturnValue2) == 0x000228, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_CreateDynamicMaterialInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_IsValid_ReturnValue1) == 0x000230, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide, CallFunc_IsValid_ReturnValue2) == 0x000231, "Member 'BP_Prop_Slide_C_ExecuteUbergraph_BP_Prop_Slide::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
