#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_Drone

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function BP_PVP_Drone.BP_PVP_Drone_C.ExecuteUbergraph_BP_PVP_Drone
// 0x03A0 (0x03A0 - 0x0000)
struct BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0xE];                                       // 0x0012(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue; // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent1;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp1;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse1;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit1;                   // 0x0088(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_Variable;                                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_113[0x1];                                      // 0x0113(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerProjectile_C*                    K2Node_DynamicCast_AsPlayer_Projectile;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Base_C*                K2Node_DynamicCast_AsBP_Character_PVP_Base;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1; // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWpn_GunAy_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWPN_Revolver_C*                        CallFunc_FinishSpawningActor_ReturnValue1;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWPN_M32_C*                             CallFunc_FinishSpawningActor_ReturnValue2;         // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWPN_RPG_C*                             CallFunc_FinishSpawningActor_ReturnValue3;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWpn_SMG_C*                             CallFunc_FinishSpawningActor_ReturnValue4;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0xF];                                      // 0x0271(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0280(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPWeaponBase_C*                        CallFunc_FinishSpawningActor_ReturnValue5;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x02F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0300(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USkeletalMeshComponent*                 K2Node_Select_Default;                             // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemTypes                                    CallFunc_GetDroneWeaponType_WeaponType;            // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone) == 0x000010, "Wrong alignment on BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone");
static_assert(sizeof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone) == 0x0003A0, "Wrong size on BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, EntryPoint) == 0x000000, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_HasAuthority_ReturnValue) == 0x000007, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, Temp_bool_IsClosed_Variable1) == 0x000008, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, Temp_bool_Has_Been_Initd_Variable1) == 0x000009, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_HasAuthority_ReturnValue1) == 0x00000A, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_HasAuthority_ReturnValue2) == 0x000010, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue) == 0x000020, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetTransformAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetSplineLength_ReturnValue) == 0x000058, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_HitComponent1) == 0x000060, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_HitComponent1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_OtherActor1) == 0x000068, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_OtherActor1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_OtherComp1) == 0x000070, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_OtherComp1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_NormalImpulse1) == 0x000078, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_NormalImpulse1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_Hit1) == 0x000088, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_Hit1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, Temp_bool_Variable) == 0x000110, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_bBlockingHit) == 0x000111, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_bInitialOverlap) == 0x000112, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_Time) == 0x000114, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_Distance) == 0x000118, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_Location) == 0x00011C, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_ImpactPoint) == 0x000128, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_Normal) == 0x000134, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_ImpactNormal) == 0x000140, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_PhysMat) == 0x000150, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_HitActor) == 0x000158, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_HitComponent) == 0x000160, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_HitBoneName) == 0x000168, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_HitItem) == 0x000170, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_FaceIndex) == 0x000174, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_TraceStart) == 0x000178, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BreakHitResult_TraceEnd) == 0x000184, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_CustomEvent_Location) == 0x000190, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_CustomEvent_Actor) == 0x0001A0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_AsPlayer_Projectile) == 0x0001A8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_AsPlayer_Projectile' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_bSuccess) == 0x0001B0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetInstigator_ReturnValue) == 0x0001B8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_AsBP_Character_PVP_Base) == 0x0001C0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_AsBP_Character_PVP_Base' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_bSuccess1) == 0x0001C8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0001D0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_HasAuthority_ReturnValue3) == 0x0001D8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0001E0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000210, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1) == 0x000218, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue) == 0x000220, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue1) == 0x000228, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2) == 0x000230, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3) == 0x000238, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue2) == 0x000240, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue3) == 0x000248, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4) == 0x000250, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue4) == 0x000258, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_IsValid_ReturnValue1) == 0x000260, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_IsValid_ReturnValue2) == 0x000261, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_AsBPWeapon_Base) == 0x000268, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_AsBPWeapon_Base' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_DynamicCast_bSuccess2) == 0x000270, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetTransform_ReturnValue) == 0x000280, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetObjectClass_ReturnValue) == 0x0002B0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5) == 0x0002B8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_HasAuthority_ReturnValue4) == 0x0002C0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_FinishSpawningActor_ReturnValue5) == 0x0002C8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_FinishSpawningActor_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_IsValid_ReturnValue3) == 0x0002D0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_HitComponent) == 0x0002D8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_OtherActor) == 0x0002E0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_OtherComp) == 0x0002E8, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0002F0, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_ComponentBoundEvent_Hit) == 0x000300, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, K2Node_Select_Default) == 0x000388, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000390, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_IsValid_ReturnValue4) == 0x00039C, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone, CallFunc_GetDroneWeaponType_WeaponType) == 0x00039D, "Member 'BP_PVP_Drone_C_ExecuteUbergraph_BP_PVP_Drone::CallFunc_GetDroneWeaponType_WeaponType' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature, Hit) == 0x000028, "Member 'BP_PVP_Drone_C_BndEvt__Prop_Airfreighter_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.PlayDestroyEffect
// 0x0018 (0x0018 - 0x0000)
struct BP_PVP_Drone_C_PlayDestroyEffect final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_Drone_C_PlayDestroyEffect) == 0x000008, "Wrong alignment on BP_PVP_Drone_C_PlayDestroyEffect");
static_assert(sizeof(BP_PVP_Drone_C_PlayDestroyEffect) == 0x000018, "Wrong size on BP_PVP_Drone_C_PlayDestroyEffect");
static_assert(offsetof(BP_PVP_Drone_C_PlayDestroyEffect, Location) == 0x000000, "Member 'BP_PVP_Drone_C_PlayDestroyEffect::Location' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_PlayDestroyEffect, Actor) == 0x000010, "Member 'BP_PVP_Drone_C_PlayDestroyEffect::Actor' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000028, "Member 'BP_PVP_Drone_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PVP_Drone_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PVP_Drone_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PVP_Drone_C_ReceiveTick");
static_assert(sizeof(BP_PVP_Drone_C_ReceiveTick) == 0x000004, "Wrong size on BP_PVP_Drone_C_ReceiveTick");
static_assert(offsetof(BP_PVP_Drone_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PVP_Drone_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.OnRep_Transform
// 0x0100 (0x0100 - 0x0000)
struct BP_PVP_Drone_C_OnRep_Transform final
{
public:
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_TInterpTo_ReturnValue;                    // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_Drone_C_OnRep_Transform) == 0x000010, "Wrong alignment on BP_PVP_Drone_C_OnRep_Transform");
static_assert(sizeof(BP_PVP_Drone_C_OnRep_Transform) == 0x000100, "Wrong size on BP_PVP_Drone_C_OnRep_Transform");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_Transform, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000000, "Member 'BP_PVP_Drone_C_OnRep_Transform::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_Transform, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_PVP_Drone_C_OnRep_Transform::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_Transform, CallFunc_TInterpTo_ReturnValue) == 0x000040, "Member 'BP_PVP_Drone_C_OnRep_Transform::CallFunc_TInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_Transform, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000070, "Member 'BP_PVP_Drone_C_OnRep_Transform::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_Transform, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000F8, "Member 'BP_PVP_Drone_C_OnRep_Transform::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function BP_PVP_Drone.BP_PVP_Drone_C.OnRep_HangItem
// 0x0088 (0x0088 - 0x0000)
struct BP_PVP_Drone_C_OnRep_HangItem final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPWeaponBase_C*                        K2Node_DynamicCast_AsBPWeapon_Base;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByClass_ReturnValue;         // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumMaterials_ReturnValue1;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue1;            // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_Drone_C_OnRep_HangItem) == 0x000008, "Wrong alignment on BP_PVP_Drone_C_OnRep_HangItem");
static_assert(sizeof(BP_PVP_Drone_C_OnRep_HangItem) == 0x000088, "Wrong size on BP_PVP_Drone_C_OnRep_HangItem");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_HangItem, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_PVP_Drone_C_OnRep_HangItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_HangItem, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PVP_Drone_C_OnRep_HangItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Drone_C_OnRep_HangItem, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_PVP_Drone_C_OnRep_HangItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
