#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PVP_Center_Prop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PVP_Center_Prop.BP_PVP_Center_Prop_C.ExecuteUbergraph_BP_PVP_Center_Prop
// 0x06C0 (0x06C0 - 0x0000)
struct BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue2;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue1;                   // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsA;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue3;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select1_Default;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent3;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor3;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp3;             // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse3;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit3;                   // 0x00C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_152[0x2];                                      // 0x0152(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue1;                  // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x020C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPPrjBase_C*                           K2Node_DynamicCast_AsBPPrj_Base;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue1;                      // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent2;          // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor2;            // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp2;             // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse2;         // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit2;                   // 0x02A0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x032E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue4;                // 0x032F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x034C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x035C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue1;                         // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0395(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0396(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_397[0x1];                                      // 0x0397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsBlue;                         // 0x039D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_AddScore;                       // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent1;          // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor1;            // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp1;             // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse1;         // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit1;                   // 0x03F0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit1;             // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap1;          // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47A[0x2];                                      // 0x047A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time1;                     // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance1;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location1;                 // 0x0484(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint1;              // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal1;                   // 0x049C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal1;             // 0x04A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B4[0x4];                                      // 0x04B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat1;                  // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor1;                 // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent1;             // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName1;              // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem1;                  // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex1;                // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart1;               // 0x04E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd1;                 // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPPrjBase_C*                           K2Node_DynamicCast_AsBPPrj_Base1;                  // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52C[0x4];                                      // 0x052C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0530(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPDefaultHand_C*                       K2Node_DynamicCast_AsBPDefault_Hand;               // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue1;                    // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue1;                      // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DC[0x4];                                      // 0x05DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                K2Node_DynamicCast_AsBP_Character_PVP_Base;        // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Base_C*                K2Node_DynamicCast_AsBP_Character_PVP_Base1;       // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString1_CmpSuccess;                   // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0608(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0610(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61C[0x4];                                      // 0x061C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UProp_Rotatingtarget_SK_Skeleton_AnimBlueprint_C* K2Node_DynamicCast_AsProp_Rotatingtarget_SK_Skeleton_Anim_Blueprint; // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0629(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62A[0x2];                                      // 0x062A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x062C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0638(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue2;        // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63D[0x3];                                      // 0x063D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x3];                                      // 0x0659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue1;             // 0x065C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue5;                // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66D[0x3];                                      // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue4;         // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue1;                 // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_GameModePVP_Base_C*                 K2Node_DynamicCast_AsBP_Game_Mode_PVP_Base1;       // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue6;                // 0x068B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x068C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0698(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue2;     // 0x06A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue1;        // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop) == 0x000010, "Wrong alignment on BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop");
static_assert(sizeof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop) == 0x0006C0, "Wrong size on BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, EntryPoint) == 0x000000, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_HasAuthority_ReturnValue1) == 0x000005, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, Temp_bool_Variable) == 0x000006, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_HasAuthority_ReturnValue2) == 0x000007, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_HasAuthority_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, Temp_bool_Variable1) == 0x000008, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeColor_ReturnValue) == 0x000010, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeColor_ReturnValue1) == 0x000020, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeColor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_CustomEvent_IsA) == 0x000030, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_CustomEvent_IsA' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_Select_Default) == 0x000034, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_HasAuthority_ReturnValue3) == 0x000058, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_HasAuthority_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000059, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_Select1_Default) == 0x00005C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_HitComponent3) == 0x0000A0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_HitComponent3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_OtherActor3) == 0x0000A8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_OtherActor3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_OtherComp3) == 0x0000B0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_OtherComp3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_NormalImpulse3) == 0x0000B8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_NormalImpulse3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_Hit3) == 0x0000C8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_Hit3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_bBlockingHit) == 0x000150, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_bInitialOverlap) == 0x000151, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_Time) == 0x000154, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_Distance) == 0x000158, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_Location) == 0x00015C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_ImpactPoint) == 0x000168, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_Normal) == 0x000174, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_ImpactNormal) == 0x000180, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_PhysMat) == 0x000190, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_HitActor) == 0x000198, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_HitComponent) == 0x0001A0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_HitBoneName) == 0x0001A8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_HitItem) == 0x0001B0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_FaceIndex) == 0x0001B4, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_TraceStart) == 0x0001B8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakHitResult_TraceEnd) == 0x0001C4, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0001D0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_X) == 0x0001DC, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Y) == 0x0001E0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Z) == 0x0001E4, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_X1) == 0x0001E8, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Y1) == 0x0001EC, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Z1) == 0x0001F0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeVector_ReturnValue) == 0x0001F4, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeVector_ReturnValue1) == 0x000200, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Normal_ReturnValue) == 0x00020C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_X2) == 0x000218, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Y2) == 0x00021C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Z2) == 0x000220, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_DynamicCast_AsBPPrj_Base) == 0x000228, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_DynamicCast_AsBPPrj_Base' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_DynamicCast_bSuccess) == 0x000230, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeVector_ReturnValue2) == 0x000234, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000240, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Normal_ReturnValue1) == 0x00024C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Normal_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Cross_VectorVector_ReturnValue) == 0x000258, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_X3) == 0x000264, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Y3) == 0x000268, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakVector_Z3) == 0x00026C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000270, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_HitComponent2) == 0x000278, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_HitComponent2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_OtherActor2) == 0x000280, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_OtherActor2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_OtherComp2) == 0x000288, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_OtherComp2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_NormalImpulse2) == 0x000290, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_NormalImpulse2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_ComponentBoundEvent_Hit2) == 0x0002A0, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_ComponentBoundEvent_Hit2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000328, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_IsValid_ReturnValue) == 0x00032C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00032D, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Not_PreBool_ReturnValue) == 0x00032E, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_HasAuthority_ReturnValue4) == 0x00032F, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_HasAuthority_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, Temp_bool_Variable2) == 0x000330, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Roll) == 0x000334, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Pitch) == 0x000338, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Yaw) == 0x00033C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000340, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000344, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Add_FloatFloat_ReturnValue) == 0x000348, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00034C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Abs_ReturnValue) == 0x000350, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, K2Node_Select2_Default) == 0x000354, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000358, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_MakeRotator_ReturnValue) == 0x00035C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Roll1) == 0x000368, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Pitch1) == 0x00036C, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop, CallFunc_BreakRotator_Yaw1) == 0x000370, "Member 'BP_PVP_Center_Prop_C_ExecuteUbergraph_BP_PVP_Center_Prop::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
