#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prop_Slide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_Winner_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prop_Slide.BP_Prop_Slide_C
// 0x0128 (0x0450 - 0x0328)
class ABP_Prop_Slide_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Right;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Left;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 RecruitingBall;                                    // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PoliceBall;                                        // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Three;                                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Two;                                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   One;                                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TimerRoot;                                         // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 mainmesh;                                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FlashTimeLine_NewTrack_0_ED3D6E494A9E643F15F9F4B6365D8928; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            FlashTimeLine__Direction_ED3D6E494A9E643F15F9F4B6365D8928; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     FlashTimeLine;                                     // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_1_1381101049807A087753C39ED2BF1D0B; // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Value_1381101049807A087753C39ED2BF1D0B; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1381101049807A087753C39ED2BF1D0B; // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProp_Slide_Skeleton_AnimBlueprint_C*   AnimBP;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftRight;                                         // 0x03B8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_Center_Prop_C*                  CenterPip;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinish;                                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PVP_WinnerShow_C*                   WinnerShow;                                        // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<Enum_Winner>                           Char;                                              // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               Mat1;                                              // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat2;                                              // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CenterColor;                                       // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0408(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               MI_1;                                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_2;                                              // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_3;                                              // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftRight_Final;                                   // 0x0428(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         Flash;                                             // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 RunawayShow;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Winner_UI_C*                        WinnerUI;                                          // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        RollingSound;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRight;                                           // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Prop_Slide(int32 EntryPoint);
	void OnFadeInOut();
	void OnBallHitBroadcast();
	void OnBallHit();
	void OnSlideMove();
	void StartFlash();
	void UpdateTimer(float Time);
	void OnCenterColor(bool IsA);
	void Init();
	void Finish(bool IsLeft);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void FlashTimeLine__UpdateFunc();
	void FlashTimeLine__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();
	void OnRep_LeftRight();
	void CalNum(float In, float* Out_1, float* Out_2, float* Out_3);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prop_Slide_C">();
	}
	static class ABP_Prop_Slide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prop_Slide_C>();
	}
};
static_assert(alignof(ABP_Prop_Slide_C) == 0x000008, "Wrong alignment on ABP_Prop_Slide_C");
static_assert(sizeof(ABP_Prop_Slide_C) == 0x000450, "Wrong size on ABP_Prop_Slide_C");
static_assert(offsetof(ABP_Prop_Slide_C, UberGraphFrame) == 0x000328, "Member 'ABP_Prop_Slide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Right) == 0x000330, "Member 'ABP_Prop_Slide_C::Right' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Left) == 0x000338, "Member 'ABP_Prop_Slide_C::Left' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, RecruitingBall) == 0x000340, "Member 'ABP_Prop_Slide_C::RecruitingBall' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, PoliceBall) == 0x000348, "Member 'ABP_Prop_Slide_C::PoliceBall' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Box) == 0x000350, "Member 'ABP_Prop_Slide_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Three) == 0x000358, "Member 'ABP_Prop_Slide_C::Three' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Two) == 0x000360, "Member 'ABP_Prop_Slide_C::Two' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, One) == 0x000368, "Member 'ABP_Prop_Slide_C::One' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, TimerRoot) == 0x000370, "Member 'ABP_Prop_Slide_C::TimerRoot' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, mainmesh) == 0x000378, "Member 'ABP_Prop_Slide_C::mainmesh' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, DefaultSceneRoot) == 0x000380, "Member 'ABP_Prop_Slide_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, FlashTimeLine_NewTrack_0_ED3D6E494A9E643F15F9F4B6365D8928) == 0x000388, "Member 'ABP_Prop_Slide_C::FlashTimeLine_NewTrack_0_ED3D6E494A9E643F15F9F4B6365D8928' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, FlashTimeLine__Direction_ED3D6E494A9E643F15F9F4B6365D8928) == 0x00038C, "Member 'ABP_Prop_Slide_C::FlashTimeLine__Direction_ED3D6E494A9E643F15F9F4B6365D8928' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, FlashTimeLine) == 0x000390, "Member 'ABP_Prop_Slide_C::FlashTimeLine' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Timeline_0_NewTrack_1_1381101049807A087753C39ED2BF1D0B) == 0x000398, "Member 'ABP_Prop_Slide_C::Timeline_0_NewTrack_1_1381101049807A087753C39ED2BF1D0B' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Timeline_0_Value_1381101049807A087753C39ED2BF1D0B) == 0x00039C, "Member 'ABP_Prop_Slide_C::Timeline_0_Value_1381101049807A087753C39ED2BF1D0B' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Timeline_0__Direction_1381101049807A087753C39ED2BF1D0B) == 0x0003A0, "Member 'ABP_Prop_Slide_C::Timeline_0__Direction_1381101049807A087753C39ED2BF1D0B' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Timeline_0) == 0x0003A8, "Member 'ABP_Prop_Slide_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, AnimBP) == 0x0003B0, "Member 'ABP_Prop_Slide_C::AnimBP' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, LeftRight) == 0x0003B8, "Member 'ABP_Prop_Slide_C::LeftRight' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, CenterPip) == 0x0003C0, "Member 'ABP_Prop_Slide_C::CenterPip' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, IsFinish) == 0x0003C8, "Member 'ABP_Prop_Slide_C::IsFinish' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, WinnerShow) == 0x0003D0, "Member 'ABP_Prop_Slide_C::WinnerShow' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Char) == 0x0003D8, "Member 'ABP_Prop_Slide_C::Char' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Mat1) == 0x0003E8, "Member 'ABP_Prop_Slide_C::Mat1' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Mat2) == 0x0003F0, "Member 'ABP_Prop_Slide_C::Mat2' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, CenterColor) == 0x0003F8, "Member 'ABP_Prop_Slide_C::CenterColor' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Timer) == 0x000408, "Member 'ABP_Prop_Slide_C::Timer' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, MI_1) == 0x000410, "Member 'ABP_Prop_Slide_C::MI_1' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, MI_2) == 0x000418, "Member 'ABP_Prop_Slide_C::MI_2' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, MI_3) == 0x000420, "Member 'ABP_Prop_Slide_C::MI_3' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, LeftRight_Final) == 0x000428, "Member 'ABP_Prop_Slide_C::LeftRight_Final' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, Flash) == 0x00042C, "Member 'ABP_Prop_Slide_C::Flash' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, RunawayShow) == 0x000430, "Member 'ABP_Prop_Slide_C::RunawayShow' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, WinnerUI) == 0x000438, "Member 'ABP_Prop_Slide_C::WinnerUI' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, RollingSound) == 0x000440, "Member 'ABP_Prop_Slide_C::RollingSound' has a wrong offset!");
static_assert(offsetof(ABP_Prop_Slide_C, IsRight) == 0x000448, "Member 'ABP_Prop_Slide_C::IsRight' has a wrong offset!");

}

