#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RightHandFuzhu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RightHandFuzhu.BP_RightHandFuzhu_C
// 0x0020 (0x0348 - 0x0328)
class ABP_RightHandFuzhu_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_characterBase_C*                Character;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         xishu;                                             // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_RightHandFuzhu(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RightHandFuzhu_C">();
	}
	static class ABP_RightHandFuzhu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RightHandFuzhu_C>();
	}
};
static_assert(alignof(ABP_RightHandFuzhu_C) == 0x000008, "Wrong alignment on ABP_RightHandFuzhu_C");
static_assert(sizeof(ABP_RightHandFuzhu_C) == 0x000348, "Wrong size on ABP_RightHandFuzhu_C");
static_assert(offsetof(ABP_RightHandFuzhu_C, UberGraphFrame) == 0x000328, "Member 'ABP_RightHandFuzhu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RightHandFuzhu_C, Sphere) == 0x000330, "Member 'ABP_RightHandFuzhu_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_RightHandFuzhu_C, Character) == 0x000338, "Member 'ABP_RightHandFuzhu_C::Character' has a wrong offset!");
static_assert(offsetof(ABP_RightHandFuzhu_C, xishu) == 0x000340, "Member 'ABP_RightHandFuzhu_C::xishu' has a wrong offset!");

}

