#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RestrictWall

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RestrictWall.BP_RestrictWall_C.ExecuteUbergraph_BP_RestrictWall
// 0x0098 (0x0098 - 0x0000)
struct BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Active;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue1;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Locations_2D_Distance;   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindClosestPointOnLine_ReturnValue;       // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Locations_Distance;      // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall) == 0x000008, "Wrong alignment on BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall");
static_assert(sizeof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall) == 0x000098, "Wrong size on BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, EntryPoint) == 0x000000, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, K2Node_CustomEvent_Active) == 0x000010, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::K2Node_CustomEvent_Active' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_K2_GetComponentLocation_ReturnValue1) == 0x000044, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_K2_GetComponentLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_GetUpVector_ReturnValue) == 0x000050, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Distance_Between_Locations_2D_Distance) == 0x00005C, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Distance_Between_Locations_2D_Distance' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_FindClosestPointOnLine_ReturnValue) == 0x000060, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_FindClosestPointOnLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Distance_Between_Locations_Distance) == 0x00006C, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Distance_Between_Locations_Distance' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000070, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_BreakVector_Y) == 0x000084, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_BreakVector_Z) == 0x000088, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_Add_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x000094, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall, CallFunc_BooleanAND_ReturnValue) == 0x000095, "Member 'BP_RestrictWall_C_ExecuteUbergraph_BP_RestrictWall::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_RestrictWall.BP_RestrictWall_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_RestrictWall_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RestrictWall_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_RestrictWall_C_ReceiveTick");
static_assert(sizeof(BP_RestrictWall_C_ReceiveTick) == 0x000004, "Wrong size on BP_RestrictWall_C_ReceiveTick");
static_assert(offsetof(BP_RestrictWall_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_RestrictWall_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_RestrictWall.BP_RestrictWall_C.ActiveCollision
// 0x0001 (0x0001 - 0x0000)
struct BP_RestrictWall_C_ActiveCollision final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RestrictWall_C_ActiveCollision) == 0x000001, "Wrong alignment on BP_RestrictWall_C_ActiveCollision");
static_assert(sizeof(BP_RestrictWall_C_ActiveCollision) == 0x000001, "Wrong size on BP_RestrictWall_C_ActiveCollision");
static_assert(offsetof(BP_RestrictWall_C_ActiveCollision, Active) == 0x000000, "Member 'BP_RestrictWall_C_ActiveCollision::Active' has a wrong offset!");

}

