#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StartSpline

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StartSpline.BP_StartSpline_C.ExecuteUbergraph_BP_StartSpline
// 0x0004 (0x0004 - 0x0000)
struct BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline) == 0x000004, "Wrong alignment on BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline");
static_assert(sizeof(BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline) == 0x000004, "Wrong size on BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline");
static_assert(offsetof(BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline, EntryPoint) == 0x000000, "Member 'BP_StartSpline_C_ExecuteUbergraph_BP_StartSpline::EntryPoint' has a wrong offset!");

// Function BP_StartSpline.BP_StartSpline_C.UserConstructionScript
// 0x02D8 (0x02D8 - 0x0000)
struct BP_StartSpline_C_UserConstructionScript final
{
public:
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0000(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult1;  // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult2;  // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult3;  // 0x0198(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0228(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02C0(0x0018)()
};
static_assert(alignof(BP_StartSpline_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_StartSpline_C_UserConstructionScript");
static_assert(sizeof(BP_StartSpline_C_UserConstructionScript) == 0x0002D8, "Wrong size on BP_StartSpline_C_UserConstructionScript");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000000, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult1) == 0x000088, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult1' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult2) == 0x000110, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult2' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult3) == 0x000198, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult3' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_BooleanOR_ReturnValue) == 0x000220, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000228, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x0002B0, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StartSpline_C_UserConstructionScript, CallFunc_Conv_StringToText_ReturnValue) == 0x0002C0, "Member 'BP_StartSpline_C_UserConstructionScript::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

