#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TriggerAllure

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Struct_AllureTriggerData_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TriggerAllure.BP_TriggerAllure_C.ExecuteUbergraph_BP_TriggerAllure
// 0x0120 (0x0120 - 0x0000)
struct BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_lsGameINP1__flag;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_AllureTriggerData              CallFunc_Array_Get_Item;                           // 0x0038(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0088(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayerProjectile_C*                    K2Node_DynamicCast_AsPlayer_Projectile;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure) == 0x000008, "Wrong alignment on BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure");
static_assert(sizeof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure) == 0x000120, "Wrong size on BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, EntryPoint) == 0x000000, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000010, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_lsGameINP1__flag) == 0x000020, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_lsGameINP1__flag' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, Temp_int_Variable) == 0x000024, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000068, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_OtherActor) == 0x000070, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_OtherComp) == 0x000078, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000080, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_bFromSweep) == 0x000084, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_ComponentBoundEvent_SweepResult) == 0x000088, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_DynamicCast_AsPlayer_Projectile) == 0x000110, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_DynamicCast_AsPlayer_Projectile' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure, K2Node_DynamicCast_bSuccess1) == 0x000118, "Member 'BP_TriggerAllure_C_ExecuteUbergraph_BP_TriggerAllure::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function BP_TriggerAllure.BP_TriggerAllure_C.BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_TriggerAllure_C_BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_TriggerAllure.BP_TriggerAllure_C.SetAlluredActorAndPos
// 0x0048 (0x0048 - 0x0000)
struct BP_TriggerAllure_C_SetAlluredActorAndPos final
{
public:
	class ABP_NPC_Plunger_C*                      _actor;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                _pos;                                              // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           _anim;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_AllureTriggerData              K2Node_MakeStruct_Struct_AllureTriggerData;        // 0x0020(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TriggerAllure_C_SetAlluredActorAndPos) == 0x000008, "Wrong alignment on BP_TriggerAllure_C_SetAlluredActorAndPos");
static_assert(sizeof(BP_TriggerAllure_C_SetAlluredActorAndPos) == 0x000048, "Wrong size on BP_TriggerAllure_C_SetAlluredActorAndPos");
static_assert(offsetof(BP_TriggerAllure_C_SetAlluredActorAndPos, _actor) == 0x000000, "Member 'BP_TriggerAllure_C_SetAlluredActorAndPos::_actor' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_SetAlluredActorAndPos, _pos) == 0x000008, "Member 'BP_TriggerAllure_C_SetAlluredActorAndPos::_pos' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_SetAlluredActorAndPos, _anim) == 0x000018, "Member 'BP_TriggerAllure_C_SetAlluredActorAndPos::_anim' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_SetAlluredActorAndPos, K2Node_MakeStruct_Struct_AllureTriggerData) == 0x000020, "Member 'BP_TriggerAllure_C_SetAlluredActorAndPos::K2Node_MakeStruct_Struct_AllureTriggerData' has a wrong offset!");
static_assert(offsetof(BP_TriggerAllure_C_SetAlluredActorAndPos, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'BP_TriggerAllure_C_SetAlluredActorAndPos::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

}

