#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Winner_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Winner_UI.BP_Winner_UI_C
// 0x0028 (0x0350 - 0x0328)
class ABP_Winner_UI_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x0348(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_BP_Winner_UI(int32 EntryPoint);
	void OnShowWinnerUI(bool RedWin);
	void OnShowWinnerUIBroadcast(bool RedWin);
	void OnRep_IsShow();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Winner_UI_C">();
	}
	static class ABP_Winner_UI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Winner_UI_C>();
	}
};
static_assert(alignof(ABP_Winner_UI_C) == 0x000008, "Wrong alignment on ABP_Winner_UI_C");
static_assert(sizeof(ABP_Winner_UI_C) == 0x000350, "Wrong size on ABP_Winner_UI_C");
static_assert(offsetof(ABP_Winner_UI_C, UberGraphFrame) == 0x000328, "Member 'ABP_Winner_UI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Winner_UI_C, Plane) == 0x000330, "Member 'ABP_Winner_UI_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_Winner_UI_C, Widget) == 0x000338, "Member 'ABP_Winner_UI_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_Winner_UI_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_Winner_UI_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Winner_UI_C, IsShow) == 0x000348, "Member 'ABP_Winner_UI_C::IsShow' has a wrong offset!");

}

