#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCommonFunctions

#include "Basic.hpp"

#include "Enum_Language_structs.hpp"
#include "Enum_TurnMode_structs.hpp"
#include "Enum_PlayMode_structs.hpp"
#include "SiliconRising_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Enum_ControllerType_structs.hpp"
#include "EnumDifficuty_structs.hpp"
#include "Engine_structs.hpp"
#include "EnumSDKType_structs.hpp"
#include "Struct_LanguageText_structs.hpp"
#include "HeadMountedDisplay_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPCommonFunctions.BPCommonFunctions_C.Towards
// 0x0040 (0x0040 - 0x0000)
struct BPCommonFunctions_C_Towards final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Result;                                            // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_Towards) == 0x000008, "Wrong alignment on BPCommonFunctions_C_Towards");
static_assert(sizeof(BPCommonFunctions_C_Towards) == 0x000040, "Wrong size on BPCommonFunctions_C_Towards");
static_assert(offsetof(BPCommonFunctions_C_Towards, Current) == 0x000000, "Member 'BPCommonFunctions_C_Towards::Current' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, Target) == 0x000004, "Member 'BPCommonFunctions_C_Towards::Target' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, Speed) == 0x000008, "Member 'BPCommonFunctions_C_Towards::Speed' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, DeltaTime) == 0x00000C, "Member 'BPCommonFunctions_C_Towards::DeltaTime' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, __WorldContext) == 0x000010, "Member 'BPCommonFunctions_C_Towards::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, Result) == 0x000018, "Member 'BPCommonFunctions_C_Towards::Result' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'BPCommonFunctions_C_Towards::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001D, "Member 'BPCommonFunctions_C_Towards::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BPCommonFunctions_C_Towards::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Add_FloatFloat_ReturnValue) == 0x000024, "Member 'BPCommonFunctions_C_Towards::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000028, "Member 'BPCommonFunctions_C_Towards::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00002C, "Member 'BPCommonFunctions_C_Towards::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000030, "Member 'BPCommonFunctions_C_Towards::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Subtract_FloatFloat_ReturnValue1) == 0x000034, "Member 'BPCommonFunctions_C_Towards::CallFunc_Subtract_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Abs_ReturnValue) == 0x000038, "Member 'BPCommonFunctions_C_Towards::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_Towards, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x00003C, "Member 'BPCommonFunctions_C_Towards::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.SpawnParticle
// 0x0090 (0x0090 - 0x0000)
struct BPCommonFunctions_C_SpawnParticle final
{
public:
	class UParticleSystem*                        EmitterTemplete;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachToComponent;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttachToName;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0024(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttachLocation                               LocationType;                                      // 0x003C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDestroy;                                         // 0x003D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsAttach;                                          // 0x003E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        Particle;                                          // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue1;      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue1;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_SpawnParticle) == 0x000008, "Wrong alignment on BPCommonFunctions_C_SpawnParticle");
static_assert(sizeof(BPCommonFunctions_C_SpawnParticle) == 0x000090, "Wrong size on BPCommonFunctions_C_SpawnParticle");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, EmitterTemplete) == 0x000000, "Member 'BPCommonFunctions_C_SpawnParticle::EmitterTemplete' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, AttachToComponent) == 0x000008, "Member 'BPCommonFunctions_C_SpawnParticle::AttachToComponent' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, AttachToName) == 0x000010, "Member 'BPCommonFunctions_C_SpawnParticle::AttachToName' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, Location) == 0x000018, "Member 'BPCommonFunctions_C_SpawnParticle::Location' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, Rotation) == 0x000024, "Member 'BPCommonFunctions_C_SpawnParticle::Rotation' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, Scale) == 0x000030, "Member 'BPCommonFunctions_C_SpawnParticle::Scale' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, LocationType) == 0x00003C, "Member 'BPCommonFunctions_C_SpawnParticle::LocationType' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, IsDestroy) == 0x00003D, "Member 'BPCommonFunctions_C_SpawnParticle::IsDestroy' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, IsAttach) == 0x00003E, "Member 'BPCommonFunctions_C_SpawnParticle::IsAttach' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, __WorldContext) == 0x000040, "Member 'BPCommonFunctions_C_SpawnParticle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, ReturnValue) == 0x000048, "Member 'BPCommonFunctions_C_SpawnParticle::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, Particle) == 0x000050, "Member 'BPCommonFunctions_C_SpawnParticle::Particle' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'BPCommonFunctions_C_SpawnParticle::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000060, "Member 'BPCommonFunctions_C_SpawnParticle::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000068, "Member 'BPCommonFunctions_C_SpawnParticle::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BPCommonFunctions_C_SpawnParticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000078, "Member 'BPCommonFunctions_C_SpawnParticle::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, CallFunc_SpawnEmitterAtLocation_ReturnValue1) == 0x000080, "Member 'BPCommonFunctions_C_SpawnParticle::CallFunc_SpawnEmitterAtLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_SpawnParticle, CallFunc_SpawnEmitterAttached_ReturnValue1) == 0x000088, "Member 'BPCommonFunctions_C_SpawnParticle::CallFunc_SpawnEmitterAttached_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.ResetHMDRotationAndLocation
// 0x0040 (0x0040 - 0x0000)
struct BPCommonFunctions_C_ResetHMDRotationAndLocation final
{
public:
	float                                         Yaw;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOrientPositionSelector                       Options;                                           // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_CommandLineArgValue_value;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CommandLineArgValue_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_ResetHMDRotationAndLocation) == 0x000008, "Wrong alignment on BPCommonFunctions_C_ResetHMDRotationAndLocation");
static_assert(sizeof(BPCommonFunctions_C_ResetHMDRotationAndLocation) == 0x000040, "Wrong size on BPCommonFunctions_C_ResetHMDRotationAndLocation");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, Yaw) == 0x000000, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::Yaw' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, Options) == 0x000004, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::Options' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, __WorldContext) == 0x000008, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, CallFunc_CommandLineArgValue_value) == 0x000010, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::CallFunc_CommandLineArgValue_value' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, CallFunc_CommandLineArgValue_ReturnValue) == 0x000020, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::CallFunc_CommandLineArgValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, CallFunc_GetGameInstance_ReturnValue) == 0x000028, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000030, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ResetHMDRotationAndLocation, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000039, "Member 'BPCommonFunctions_C_ResetHMDRotationAndLocation::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetLanguageText
// 0x01D0 (0x01D0 - 0x0000)
struct BPCommonFunctions_C_GetLanguageText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Lan_Text;                                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable1;                               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_LanguageText                   CallFunc_GetDataTableRowFromName_OutRow;           // 0x0078(0x00F0)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select1_Default;                            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_LeftS;                              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Split_RightS;                             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Split_ReturnValue;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetLanguageText) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetLanguageText");
static_assert(sizeof(BPCommonFunctions_C_GetLanguageText) == 0x0001D0, "Wrong size on BPCommonFunctions_C_GetLanguageText");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Text) == 0x000000, "Member 'BPCommonFunctions_C_GetLanguageText::Text' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, __WorldContext) == 0x000010, "Member 'BPCommonFunctions_C_GetLanguageText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Found) == 0x000018, "Member 'BPCommonFunctions_C_GetLanguageText::Found' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Lan_Text) == 0x000020, "Member 'BPCommonFunctions_C_GetLanguageText::Lan_Text' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, FontSize) == 0x000030, "Member 'BPCommonFunctions_C_GetLanguageText::FontSize' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Temp_byte_Variable) == 0x000034, "Member 'BPCommonFunctions_C_GetLanguageText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Temp_int_Array_Index_Variable) == 0x000038, "Member 'BPCommonFunctions_C_GetLanguageText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BPCommonFunctions_C_GetLanguageText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, Temp_byte_Variable1) == 0x000044, "Member 'BPCommonFunctions_C_GetLanguageText::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_GetGameInstance_ReturnValue) == 0x000058, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Array_Get_Item) == 0x000060, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000068, "Member 'BPCommonFunctions_C_GetLanguageText::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'BPCommonFunctions_C_GetLanguageText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000078, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000168, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Array_Length_ReturnValue) == 0x00016C, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, K2Node_Select_Default) == 0x000170, "Member 'BPCommonFunctions_C_GetLanguageText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, K2Node_Select1_Default) == 0x000178, "Member 'BPCommonFunctions_C_GetLanguageText::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Split_LeftS) == 0x000188, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Split_LeftS' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Split_RightS) == 0x000198, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Split_RightS' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Split_ReturnValue) == 0x0001A8, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Split_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0001A9, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Concat_StrStr_ReturnValue) == 0x0001B0, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetLanguageText, CallFunc_Concat_StrStr_ReturnValue1) == 0x0001C0, "Member 'BPCommonFunctions_C_GetLanguageText::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetMer2MatchLogUrl
// 0x0058 (0x0058 - 0x0000)
struct BPCommonFunctions_C_GetMer2MatchLogUrl final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebDomain_Domain;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebProtocol_Protocol;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetMer2MatchLogUrl) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetMer2MatchLogUrl");
static_assert(sizeof(BPCommonFunctions_C_GetMer2MatchLogUrl) == 0x000058, "Wrong size on BPCommonFunctions_C_GetMer2MatchLogUrl");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, URL) == 0x000008, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::URL' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, CallFunc_GetWebDomain_Domain) == 0x000018, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::CallFunc_GetWebDomain_Domain' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, CallFunc_GetWebProtocol_Protocol) == 0x000028, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::CallFunc_GetWebProtocol_Protocol' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2MatchLogUrl, CallFunc_Concat_StrStr_ReturnValue1) == 0x000048, "Member 'BPCommonFunctions_C_GetMer2MatchLogUrl::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetMer2LoginUrl
// 0x0058 (0x0058 - 0x0000)
struct BPCommonFunctions_C_GetMer2LoginUrl final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebDomain_Domain;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebProtocol_Protocol;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetMer2LoginUrl) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetMer2LoginUrl");
static_assert(sizeof(BPCommonFunctions_C_GetMer2LoginUrl) == 0x000058, "Wrong size on BPCommonFunctions_C_GetMer2LoginUrl");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, URL) == 0x000008, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::URL' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, CallFunc_GetWebDomain_Domain) == 0x000018, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::CallFunc_GetWebDomain_Domain' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, CallFunc_GetWebProtocol_Protocol) == 0x000028, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::CallFunc_GetWebProtocol_Protocol' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2LoginUrl, CallFunc_Concat_StrStr_ReturnValue1) == 0x000048, "Member 'BPCommonFunctions_C_GetMer2LoginUrl::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetMer2VerifyGameUrl
// 0x0058 (0x0058 - 0x0000)
struct BPCommonFunctions_C_GetMer2VerifyGameUrl final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebDomain_Domain;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebProtocol_Protocol;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetMer2VerifyGameUrl) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetMer2VerifyGameUrl");
static_assert(sizeof(BPCommonFunctions_C_GetMer2VerifyGameUrl) == 0x000058, "Wrong size on BPCommonFunctions_C_GetMer2VerifyGameUrl");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, URL) == 0x000008, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::URL' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, CallFunc_GetWebDomain_Domain) == 0x000018, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::CallFunc_GetWebDomain_Domain' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, CallFunc_GetWebProtocol_Protocol) == 0x000028, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::CallFunc_GetWebProtocol_Protocol' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetMer2VerifyGameUrl, CallFunc_Concat_StrStr_ReturnValue1) == 0x000048, "Member 'BPCommonFunctions_C_GetMer2VerifyGameUrl::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetWebDomain
// 0x0020 (0x0020 - 0x0000)
struct BPCommonFunctions_C_GetWebDomain final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Domain;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDevelopmentMode_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_GetWebDomain) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetWebDomain");
static_assert(sizeof(BPCommonFunctions_C_GetWebDomain) == 0x000020, "Wrong size on BPCommonFunctions_C_GetWebDomain");
static_assert(offsetof(BPCommonFunctions_C_GetWebDomain, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetWebDomain::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebDomain, Domain) == 0x000008, "Member 'BPCommonFunctions_C_GetWebDomain::Domain' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebDomain, CallFunc_IsPlayInEditor_ReturnValue) == 0x000018, "Member 'BPCommonFunctions_C_GetWebDomain::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebDomain, CallFunc_IsDevelopmentMode_ReturnValue) == 0x000019, "Member 'BPCommonFunctions_C_GetWebDomain::CallFunc_IsDevelopmentMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebDomain, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'BPCommonFunctions_C_GetWebDomain::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetNeedOnlyVerify
// 0x0010 (0x0010 - 0x0000)
struct BPCommonFunctions_C_GetNeedOnlyVerify final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeed;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_GetNeedOnlyVerify) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetNeedOnlyVerify");
static_assert(sizeof(BPCommonFunctions_C_GetNeedOnlyVerify) == 0x000010, "Wrong size on BPCommonFunctions_C_GetNeedOnlyVerify");
static_assert(offsetof(BPCommonFunctions_C_GetNeedOnlyVerify, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetNeedOnlyVerify::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetNeedOnlyVerify, IsNeed) == 0x000008, "Member 'BPCommonFunctions_C_GetNeedOnlyVerify::IsNeed' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetWebConfig
// 0x0088 (0x0088 - 0x0000)
struct BPCommonFunctions_C_GetWebConfig final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 GameID;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ChannelID;                                         // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 strGameID;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 strChannelID;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevelopmentMode_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetWebConfig) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetWebConfig");
static_assert(sizeof(BPCommonFunctions_C_GetWebConfig) == 0x000088, "Wrong size on BPCommonFunctions_C_GetWebConfig");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetWebConfig::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, GameID) == 0x000008, "Member 'BPCommonFunctions_C_GetWebConfig::GameID' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, ChannelID) == 0x000018, "Member 'BPCommonFunctions_C_GetWebConfig::ChannelID' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, strGameID) == 0x000028, "Member 'BPCommonFunctions_C_GetWebConfig::strGameID' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, strChannelID) == 0x000038, "Member 'BPCommonFunctions_C_GetWebConfig::strChannelID' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, Temp_bool_Variable) == 0x000048, "Member 'BPCommonFunctions_C_GetWebConfig::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, Temp_string_Variable) == 0x000050, "Member 'BPCommonFunctions_C_GetWebConfig::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, Temp_string_Variable1) == 0x000060, "Member 'BPCommonFunctions_C_GetWebConfig::Temp_string_Variable1' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, CallFunc_IsDevelopmentMode_ReturnValue) == 0x000070, "Member 'BPCommonFunctions_C_GetWebConfig::CallFunc_IsDevelopmentMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebConfig, K2Node_Select_Default) == 0x000078, "Member 'BPCommonFunctions_C_GetWebConfig::K2Node_Select_Default' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetWebRankUrl
// 0x0058 (0x0058 - 0x0000)
struct BPCommonFunctions_C_GetWebRankUrl final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 URL;                                               // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebDomain_Domain;                      // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWebProtocol_Protocol;                  // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetWebRankUrl) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetWebRankUrl");
static_assert(sizeof(BPCommonFunctions_C_GetWebRankUrl) == 0x000058, "Wrong size on BPCommonFunctions_C_GetWebRankUrl");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetWebRankUrl::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, URL) == 0x000008, "Member 'BPCommonFunctions_C_GetWebRankUrl::URL' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, CallFunc_GetWebDomain_Domain) == 0x000018, "Member 'BPCommonFunctions_C_GetWebRankUrl::CallFunc_GetWebDomain_Domain' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, CallFunc_GetWebProtocol_Protocol) == 0x000028, "Member 'BPCommonFunctions_C_GetWebRankUrl::CallFunc_GetWebProtocol_Protocol' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BPCommonFunctions_C_GetWebRankUrl::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetWebRankUrl, CallFunc_Concat_StrStr_ReturnValue1) == 0x000048, "Member 'BPCommonFunctions_C_GetWebRankUrl::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.ApplyText
// 0x00D0 (0x00D0 - 0x0000)
struct BPCommonFunctions_C_ApplyText final
{
public:
	class UTextBlock*                             Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ApplySize;                                         // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetLanguageText_Found;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLanguageText_Lan_Text;                 // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLanguageText_FontSize;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0058(0x0058)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_ApplyText) == 0x000008, "Wrong alignment on BPCommonFunctions_C_ApplyText");
static_assert(sizeof(BPCommonFunctions_C_ApplyText) == 0x0000D0, "Wrong size on BPCommonFunctions_C_ApplyText");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, Target) == 0x000000, "Member 'BPCommonFunctions_C_ApplyText::Target' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, Text) == 0x000008, "Member 'BPCommonFunctions_C_ApplyText::Text' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, ApplySize) == 0x000018, "Member 'BPCommonFunctions_C_ApplyText::ApplySize' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, __WorldContext) == 0x000020, "Member 'BPCommonFunctions_C_ApplyText::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, Temp_bool_Variable) == 0x000028, "Member 'BPCommonFunctions_C_ApplyText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, CallFunc_GetLanguageText_Found) == 0x000029, "Member 'BPCommonFunctions_C_ApplyText::CallFunc_GetLanguageText_Found' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, CallFunc_GetLanguageText_Lan_Text) == 0x000030, "Member 'BPCommonFunctions_C_ApplyText::CallFunc_GetLanguageText_Lan_Text' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, CallFunc_GetLanguageText_FontSize) == 0x000040, "Member 'BPCommonFunctions_C_ApplyText::CallFunc_GetLanguageText_FontSize' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, K2Node_Select_Default) == 0x000048, "Member 'BPCommonFunctions_C_ApplyText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, K2Node_MakeStruct_SlateFontInfo) == 0x000058, "Member 'BPCommonFunctions_C_ApplyText::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'BPCommonFunctions_C_ApplyText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_ApplyText, CallFunc_BooleanAND_ReturnValue) == 0x0000C8, "Member 'BPCommonFunctions_C_ApplyText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetSDKType
// 0x0010 (0x0010 - 0x0000)
struct BPCommonFunctions_C_GetSDKType final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumSDKType                                   SDKType;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPCommonFunctions_C_GetSDKType) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetSDKType");
static_assert(sizeof(BPCommonFunctions_C_GetSDKType) == 0x000010, "Wrong size on BPCommonFunctions_C_GetSDKType");
static_assert(offsetof(BPCommonFunctions_C_GetSDKType, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetSDKType::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSDKType, SDKType) == 0x000008, "Member 'BPCommonFunctions_C_GetSDKType::SDKType' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.GetSettingsFromDisk
// 0x0038 (0x0038 - 0x0000)
struct BPCommonFunctions_C_GetSettingsFromDisk final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2OnlineSave_C*                      AsMer_2Online_Save;                                // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsExist;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2OnlineSave_C*                      CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2OnlineSave_C*                      K2Node_DynamicCast_AsMer_2Online_Save;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPCommonFunctions_C_GetSettingsFromDisk) == 0x000008, "Wrong alignment on BPCommonFunctions_C_GetSettingsFromDisk");
static_assert(sizeof(BPCommonFunctions_C_GetSettingsFromDisk) == 0x000038, "Wrong size on BPCommonFunctions_C_GetSettingsFromDisk");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, __WorldContext) == 0x000000, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, AsMer_2Online_Save) == 0x000008, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::AsMer_2Online_Save' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, IsExist) == 0x000010, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::IsExist' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000018, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000020, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, K2Node_DynamicCast_AsMer_2Online_Save) == 0x000028, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::K2Node_DynamicCast_AsMer_2Online_Save' has a wrong offset!");
static_assert(offsetof(BPCommonFunctions_C_GetSettingsFromDisk, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPCommonFunctions_C_GetSettingsFromDisk::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPCommonFunctions.BPCommonFunctions_C.SaveSettingsToDisk
// 0x0040 (0x0040 - 0x0000)
struct BPCommonFunctions_C_SaveSettingsToDisk final
{
public:
	int32                                         StartLevel;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SoundLevel;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumDifficuty                                 Difficulty;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
