#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPHttpUtilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HttpWebBase_classes.hpp"
#include "EnumDifficuty_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPHttpUtilities.BPHttpUtilities_C
// 0x0110 (0x0570 - 0x0460)
class ABPHttpUtilities_C final : public ABP_HttpWebBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BPHttpUtilities_C;                  // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               QRCodeInstance;                                    // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      RepTexture;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartCheck;                                        // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserID;                                            // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RefreshTime;                                       // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Timer;                                             // 0x04A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            mapData;                                           // 0x04A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMer2GameInstance_C*                    Mer2Instance;                                      // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         currentPage_0;                                     // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                LeaderboardUIWidget;                               // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 postPage;                                          // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnScoreLeaderboard;                                // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USendScore_C*                           ScoreBoard;                                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnRestart;                                         // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExit;                                            // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnContinue;                                        // 0x0558(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSend;                                            // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPHttpUtilities(int32 EntryPoint);
	void CustomEvent_2();
	void CustomEvent_1();
	void CustomEvent_0();
	void FindME();
	void PageUp(bool lsUp);
	void PostResponse(bool Success);
	void OnSendScore(bool IsPass, int32 LevelNumber, bool Is2P);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void CreateData(bool IsPass, int32 LevelNumber, bool Is2P, class FString* _data, TArray<class FString>* DataArray);
	void CreateGetLeaderBoardPage(const class FString& page, bool lsmePage, class FString* _Params);
	void GetPageData(TDelegate<void(bool Success)>& Callback, const class FString& page);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPHttpUtilities_C">();
	}
	static class ABPHttpUtilities_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPHttpUtilities_C>();
	}
};
static_assert(alignof(ABPHttpUtilities_C) == 0x000008, "Wrong alignment on ABPHttpUtilities_C");
static_assert(sizeof(ABPHttpUtilities_C) == 0x000570, "Wrong size on ABPHttpUtilities_C");
static_assert(offsetof(ABPHttpUtilities_C, UberGraphFrame_BPHttpUtilities_C) == 0x000460, "Member 'ABPHttpUtilities_C::UberGraphFrame_BPHttpUtilities_C' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, Widget) == 0x000468, "Member 'ABPHttpUtilities_C::Widget' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, QRCodeInstance) == 0x000470, "Member 'ABPHttpUtilities_C::QRCodeInstance' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, RepTexture) == 0x000478, "Member 'ABPHttpUtilities_C::RepTexture' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, StartCheck) == 0x000480, "Member 'ABPHttpUtilities_C::StartCheck' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, UserID) == 0x000488, "Member 'ABPHttpUtilities_C::UserID' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, Count) == 0x000498, "Member 'ABPHttpUtilities_C::Count' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, RefreshTime) == 0x00049C, "Member 'ABPHttpUtilities_C::RefreshTime' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, Timer) == 0x0004A0, "Member 'ABPHttpUtilities_C::Timer' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, mapData) == 0x0004A8, "Member 'ABPHttpUtilities_C::mapData' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, Mer2Instance) == 0x0004F8, "Member 'ABPHttpUtilities_C::Mer2Instance' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, currentPage_0) == 0x000500, "Member 'ABPHttpUtilities_C::currentPage_0' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, LeaderboardUIWidget) == 0x000508, "Member 'ABPHttpUtilities_C::LeaderboardUIWidget' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, postPage) == 0x000510, "Member 'ABPHttpUtilities_C::postPage' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, OnScoreLeaderboard) == 0x000520, "Member 'ABPHttpUtilities_C::OnScoreLeaderboard' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, ScoreBoard) == 0x000530, "Member 'ABPHttpUtilities_C::ScoreBoard' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, OnRestart) == 0x000538, "Member 'ABPHttpUtilities_C::OnRestart' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, OnExit) == 0x000548, "Member 'ABPHttpUtilities_C::OnExit' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, OnContinue) == 0x000558, "Member 'ABPHttpUtilities_C::OnContinue' has a wrong offset!");
static_assert(offsetof(ABPHttpUtilities_C, IsSend) == 0x000568, "Member 'ABPHttpUtilities_C::IsSend' has a wrong offset!");

}

