#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EnumMenuState_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPMainMenu.BPMainMenu_C
// 0x0128 (0x0450 - 0x0328)
class ABPMainMenu_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       LobbyUI;                                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Lobby;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LobbyButton;                                       // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       tips;                                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        steamTip;                                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       meButton;                                          // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        backPosition;                                      // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULeaderboardComponent_C*                LeaderboardComponent;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeaderboardMenu;                                   // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       BackButton;                                        // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       menu;                                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        languageMenu;                                      // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       normalButton;                                      // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       bg;                                                // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       leaderboardUI;                                     // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       leaderboardButton;                                 // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       optionButton;                                      // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       StartButton;                                       // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        mainmenu;                                          // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       zombieWarButton;                                   // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       blindButton;                                       // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       hardButton;                                        // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       easyButton;                                        // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       DifficultyTip;                                     // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        diffcultySelect;                                   // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EnumMenuState                                 lastMenuState;                                     // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumMenuState                                 curMenuState;                                      // 0x0401(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_402[0xE];                                      // 0x0402(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OrgTransform_BT;                                   // 0x0410(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          lsMeIntop9;                                        // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitTime;                                          // 0x0444(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StartCount;                                        // 0x0448(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPMainMenu(int32 EntryPoint);
	void ClearList();
	void AddList(const struct FBlueprintSessionResult& Session);
	void ReceiveTick(float DeltaSeconds);
	void CheckLogin();
	void mePage(bool Success);
	void GetMePage();
	void getFristPage(bool Success);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetMMVisible(bool _visible);
	void setDifficultySelectVisible(bool _visible);
	void EnterGame();
	void setLanguageMenuVisible(bool _visible);
	void setBackButtonVisible(bool _visible);
	void switchMenu();
	void setLeaderboardMebuVisible(bool _visible);
	void ShowLogo(bool _visible);
	void setMeButtonVisible(bool _visible);
	void setSteamTips(bool _visible);
	void SetLobbyVisible(bool _visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPMainMenu_C">();
	}
	static class ABPMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPMainMenu_C>();
	}
};
static_assert(alignof(ABPMainMenu_C) == 0x000010, "Wrong alignment on ABPMainMenu_C");
static_assert(sizeof(ABPMainMenu_C) == 0x000450, "Wrong size on ABPMainMenu_C");
static_assert(offsetof(ABPMainMenu_C, UberGraphFrame) == 0x000328, "Member 'ABPMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, LobbyUI) == 0x000330, "Member 'ABPMainMenu_C::LobbyUI' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, Lobby) == 0x000338, "Member 'ABPMainMenu_C::Lobby' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, LobbyButton) == 0x000340, "Member 'ABPMainMenu_C::LobbyButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, tips) == 0x000348, "Member 'ABPMainMenu_C::tips' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, steamTip) == 0x000350, "Member 'ABPMainMenu_C::steamTip' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, meButton) == 0x000358, "Member 'ABPMainMenu_C::meButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, backPosition) == 0x000360, "Member 'ABPMainMenu_C::backPosition' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, LeaderboardComponent) == 0x000368, "Member 'ABPMainMenu_C::LeaderboardComponent' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, LeaderboardMenu) == 0x000370, "Member 'ABPMainMenu_C::LeaderboardMenu' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, BackButton) == 0x000378, "Member 'ABPMainMenu_C::BackButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, menu) == 0x000380, "Member 'ABPMainMenu_C::menu' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, languageMenu) == 0x000388, "Member 'ABPMainMenu_C::languageMenu' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, normalButton) == 0x000390, "Member 'ABPMainMenu_C::normalButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, bg) == 0x000398, "Member 'ABPMainMenu_C::bg' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, leaderboardUI) == 0x0003A0, "Member 'ABPMainMenu_C::leaderboardUI' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, leaderboardButton) == 0x0003A8, "Member 'ABPMainMenu_C::leaderboardButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, optionButton) == 0x0003B0, "Member 'ABPMainMenu_C::optionButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, StartButton) == 0x0003B8, "Member 'ABPMainMenu_C::StartButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, mainmenu) == 0x0003C0, "Member 'ABPMainMenu_C::mainmenu' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, zombieWarButton) == 0x0003C8, "Member 'ABPMainMenu_C::zombieWarButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, blindButton) == 0x0003D0, "Member 'ABPMainMenu_C::blindButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, hardButton) == 0x0003D8, "Member 'ABPMainMenu_C::hardButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, easyButton) == 0x0003E0, "Member 'ABPMainMenu_C::easyButton' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, DifficultyTip) == 0x0003E8, "Member 'ABPMainMenu_C::DifficultyTip' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, diffcultySelect) == 0x0003F0, "Member 'ABPMainMenu_C::diffcultySelect' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, DefaultSceneRoot) == 0x0003F8, "Member 'ABPMainMenu_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, lastMenuState) == 0x000400, "Member 'ABPMainMenu_C::lastMenuState' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, curMenuState) == 0x000401, "Member 'ABPMainMenu_C::curMenuState' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, OrgTransform_BT) == 0x000410, "Member 'ABPMainMenu_C::OrgTransform_BT' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, lsMeIntop9) == 0x000440, "Member 'ABPMainMenu_C::lsMeIntop9' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, WaitTime) == 0x000444, "Member 'ABPMainMenu_C::WaitTime' has a wrong offset!");
static_assert(offsetof(ABPMainMenu_C, StartCount) == 0x000448, "Member 'ABPMainMenu_C::StartCount' has a wrong offset!");

}

