#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPMainMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function BPMainMenu.BPMainMenu_C.ExecuteUbergraph_BPMainMenu
// 0x0400 (0x0400 - 0x0000)
struct BPMainMenu_C_ExecuteUbergraph_BPMainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UleaderboardButton_C*                   K2Node_DynamicCast_AsLeaderboard_Button;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue1;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStartButton_C*                         K2Node_DynamicCast_AsStart_Button;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue2;         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDifficultyBack_C*                      K2Node_DynamicCast_AsDifficulty_Back;              // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue3;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue4;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue5;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent1;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent2;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue6;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue7;         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent3;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent4;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess7;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess8;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue8;         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULeaderboardMM_C*                       K2Node_DynamicCast_AsLeaderboard_MM;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess9;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue9;         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent5;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess10;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0xF];                                      // 0x0121(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0130(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Success1;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue10;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent6;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess11;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue1;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base1;           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess12;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Success;                        // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPageID_ReturnValue;                    // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue11;        // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBPUniqueNetId                         CallFunc_GetUniqueNetID_UniqueNetId;               // 0x01B8(0x0020)()
	class UbuttonParent_C*                        K2Node_DynamicCast_AsButton_Parent7;               // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess13;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBPLoginStatus                                CallFunc_GetLoginStatus_LoginStatus;               // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlueprintResultSwitch                        CallFunc_GetLoginStatus_Result;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue12;        // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMultiPlayerButton_C*                   K2Node_DynamicCast_AsMulti_Player_Button;          // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess14;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool Success)>                 K2Node_CreateDelegate_OutputDelegate1;             // 0x0200(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers;  // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess15;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_232[0x2];                                      // 0x0232(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers1; // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess16;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers2; // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25B[0x5];                                      // 0x025B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue2;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance2;          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess17;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue13;        // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI;               // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess18;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue14;        // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI1;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess19;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue15;        // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI2;              // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess20;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI3;              // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess21;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                K2Node_CustomEvent_Session;                        // 0x02E0(0x00B8)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x3];                                      // 0x0399(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers3; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue3;             // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue16;        // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance3;          // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess22;                     // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI4;              // 0x03C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess23;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue17;        // 0x03D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMultiplayerUI_C*                       K2Node_DynamicCast_AsMultiplayer_UI5;              // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess24;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers4; // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x03F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F2[0x2];                                      // 0x03F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu) == 0x000010, "Wrong alignment on BPMainMenu_C_ExecuteUbergraph_BPMainMenu");
static_assert(sizeof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu) == 0x000400, "Wrong size on BPMainMenu_C_ExecuteUbergraph_BPMainMenu");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, EntryPoint) == 0x000000, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, Temp_bool_Has_Been_Initd_Variable) == 0x000018, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_HasAuthority_ReturnValue) == 0x000019, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000020, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsLeaderboard_Button) == 0x000028, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsLeaderboard_Button' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue1) == 0x000038, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsStart_Button) == 0x000040, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsStart_Button' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess1) == 0x000048, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue2) == 0x000050, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsDifficulty_Back) == 0x000058, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsDifficulty_Back' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess2) == 0x000060, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue3) == 0x000068, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent) == 0x000070, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess3) == 0x000078, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue4) == 0x000080, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue5) == 0x000088, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent1) == 0x000090, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess4) == 0x000098, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent2) == 0x0000A0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess5) == 0x0000A8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue6) == 0x0000B0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue7) == 0x0000B8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent3) == 0x0000C0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess6) == 0x0000C8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent4) == 0x0000D0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent4' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess7) == 0x0000D8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess7' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetPlayerCharacter_ReturnValue) == 0x0000E0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsBP_Character_Base) == 0x0000E8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess8) == 0x0000F0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess8' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, Temp_bool_IsClosed_Variable1) == 0x0000F1, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue8) == 0x0000F8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsLeaderboard_MM) == 0x000100, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsLeaderboard_MM' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess9) == 0x000108, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess9' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue9) == 0x000110, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent5) == 0x000118, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent5' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess10) == 0x000120, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess10' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000130, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_CustomEvent_Success1) == 0x000160, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_CustomEvent_Success1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue10) == 0x000168, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent6) == 0x000170, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent6' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess11) == 0x000178, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess11' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetPlayerCharacter_ReturnValue1) == 0x000180, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetPlayerCharacter_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsBP_Character_Base1) == 0x000188, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsBP_Character_Base1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess12) == 0x000190, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess12' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_CustomEvent_Success) == 0x000191, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_CustomEvent_Success' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetPageID_ReturnValue) == 0x000198, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetPageID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetPlayerController_ReturnValue) == 0x0001A8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue11) == 0x0001B0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUniqueNetID_UniqueNetId) == 0x0001B8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUniqueNetID_UniqueNetId' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsButton_Parent7) == 0x0001D8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsButton_Parent7' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess13) == 0x0001E0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess13' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetLoginStatus_LoginStatus) == 0x0001E1, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetLoginStatus_LoginStatus' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetLoginStatus_Result) == 0x0001E2, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetLoginStatus_Result' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_SwitchEnum_CmpSuccess) == 0x0001E3, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue12) == 0x0001E8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMulti_Player_Button) == 0x0001F0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMulti_Player_Button' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess14) == 0x0001F8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess14' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_CreateDelegate_OutputDelegate1) == 0x000200, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers) == 0x000210, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000218, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000220, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000228, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess15) == 0x000230, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess15' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_HasAuthority_ReturnValue1) == 0x000231, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers1) == 0x000234, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000238, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetGameInstance_ReturnValue1) == 0x000240, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000248, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess16) == 0x000250, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess16' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers2) == 0x000254, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000258, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000259, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_BooleanOR_ReturnValue) == 0x00025A, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetGameInstance_ReturnValue2) == 0x000260, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetGameInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_IsServer_ReturnValue) == 0x000268, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMer_2Game_Instance2) == 0x000270, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMer_2Game_Instance2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess17) == 0x000278, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess17' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_Event_DeltaSeconds) == 0x00027C, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000280, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue13) == 0x000288, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI) == 0x000290, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess18) == 0x000298, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess18' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue14) == 0x0002A0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI1) == 0x0002A8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess19) == 0x0002B0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess19' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue15) == 0x0002B8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI2) == 0x0002C0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI2' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess20) == 0x0002C8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess20' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI3) == 0x0002D0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess21) == 0x0002D8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess21' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_CustomEvent_Session) == 0x0002E0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_CustomEvent_Session' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000398, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers3) == 0x00039C, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, Temp_bool_Has_Been_Initd_Variable1) == 0x0003A0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GreaterEqual_IntInt_ReturnValue1) == 0x0003A1, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GreaterEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetGameInstance_ReturnValue3) == 0x0003A8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetGameInstance_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue16) == 0x0003B0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMer_2Game_Instance3) == 0x0003B8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMer_2Game_Instance3' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess22) == 0x0003C0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess22' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI4) == 0x0003C8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI4' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess23) == 0x0003D0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess23' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetUserWidgetObject_ReturnValue17) == 0x0003D8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetUserWidgetObject_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_AsMultiplayer_UI5) == 0x0003E0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_AsMultiplayer_UI5' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, K2Node_DynamicCast_bSuccess24) == 0x0003E8, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::K2Node_DynamicCast_bSuccess24' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers4) == 0x0003EC, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers4' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_Greater_IntInt_ReturnValue) == 0x0003F0, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_BooleanOR_ReturnValue1) == 0x0003F1, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_BooleanOR_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_ExecuteUbergraph_BPMainMenu, CallFunc_FTrunc_ReturnValue) == 0x0003F4, "Member 'BPMainMenu_C_ExecuteUbergraph_BPMainMenu::CallFunc_FTrunc_ReturnValue' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.AddList
// 0x00B8 (0x00B8 - 0x0000)
struct BPMainMenu_C_AddList final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BPMainMenu_C_AddList) == 0x000008, "Wrong alignment on BPMainMenu_C_AddList");
static_assert(sizeof(BPMainMenu_C_AddList) == 0x0000B8, "Wrong size on BPMainMenu_C_AddList");
static_assert(offsetof(BPMainMenu_C_AddList, Session) == 0x000000, "Member 'BPMainMenu_C_AddList::Session' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BPMainMenu_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPMainMenu_C_ReceiveTick) == 0x000004, "Wrong alignment on BPMainMenu_C_ReceiveTick");
static_assert(sizeof(BPMainMenu_C_ReceiveTick) == 0x000004, "Wrong size on BPMainMenu_C_ReceiveTick");
static_assert(offsetof(BPMainMenu_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BPMainMenu_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.mePage
// 0x0001 (0x0001 - 0x0000)
struct BPMainMenu_C_mePage final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPMainMenu_C_mePage) == 0x000001, "Wrong alignment on BPMainMenu_C_mePage");
static_assert(sizeof(BPMainMenu_C_mePage) == 0x000001, "Wrong size on BPMainMenu_C_mePage");
static_assert(offsetof(BPMainMenu_C_mePage, Success) == 0x000000, "Member 'BPMainMenu_C_mePage::Success' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.getFristPage
// 0x0001 (0x0001 - 0x0000)
struct BPMainMenu_C_getFristPage final
{
public:
	bool                                          Success;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPMainMenu_C_getFristPage) == 0x000001, "Wrong alignment on BPMainMenu_C_getFristPage");
static_assert(sizeof(BPMainMenu_C_getFristPage) == 0x000001, "Wrong size on BPMainMenu_C_getFristPage");
static_assert(offsetof(BPMainMenu_C_getFristPage, Success) == 0x000000, "Member 'BPMainMenu_C_getFristPage::Success' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.SetMMVisible
// 0x0048 (0x0048 - 0x0000)
struct BPMainMenu_C_SetMMVisible final
{
public:
	bool                                          _visible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetComponent*                       K2Node_DynamicCast_AsWidget_Component;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPMainMenu_C_SetMMVisible) == 0x000008, "Wrong alignment on BPMainMenu_C_SetMMVisible");
static_assert(sizeof(BPMainMenu_C_SetMMVisible) == 0x000048, "Wrong size on BPMainMenu_C_SetMMVisible");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, _visible) == 0x000000, "Member 'BPMainMenu_C_SetMMVisible::_visible' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BPMainMenu_C_SetMMVisible::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BPMainMenu_C_SetMMVisible::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BPMainMenu_C_SetMMVisible::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'BPMainMenu_C_SetMMVisible::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BPMainMenu_C_SetMMVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, CallFunc_Array_Get_Item) == 0x000028, "Member 'BPMainMenu_C_SetMMVisible::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'BPMainMenu_C_SetMMVisible::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, K2Node_DynamicCast_AsWidget_Component) == 0x000038, "Member 'BPMainMenu_C_SetMMVisible::K2Node_DynamicCast_AsWidget_Component' has a wrong offset!");
static_assert(offsetof(BPMainMenu_C_SetMMVisible, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BPMainMenu_C_SetMMVisible::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPMainMenu.BPMainMenu_C.setDifficultySelectVisible
// 0x0048 (0x0048 - 0x0000)
struct BPMainMenu_C_setDifficultySelectVisible final
{
public:
	bool                                          _visible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
