#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPViveportApi

#include "Basic.hpp"

#include "EnumSDKType_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function BPViveportApi.BPViveportApi_C.ExecuteUbergraph_BPViveportApi
// 0x0068 (0x0068 - 0x0000)
struct BPViveportApi_C_ExecuteUbergraph_BPViveportApi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetNeedOnlyVerify_IsNeed;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumSDKType                                   CallFunc_GetSDKType_SDKType;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasOnlineSubsystem_ReturnValue;           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_PlayerName;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayInEditor_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBPUniqueNetId                         CallFunc_GetLocalSteamIDFromSteam_ReturnValue;     // 0x0028(0x0020)()
	bool                                          CallFunc_IsPlayInEditor_ReturnValue1;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidUniqueNetID_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_UniqueNetIdToString_String;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi) == 0x000008, "Wrong alignment on BPViveportApi_C_ExecuteUbergraph_BPViveportApi");
static_assert(sizeof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi) == 0x000068, "Wrong size on BPViveportApi_C_ExecuteUbergraph_BPViveportApi");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, EntryPoint) == 0x000000, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_GetNeedOnlyVerify_IsNeed) == 0x000004, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_GetNeedOnlyVerify_IsNeed' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_GetSDKType_SDKType) == 0x000005, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_GetSDKType_SDKType' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_HasOnlineSubsystem_ReturnValue) == 0x000006, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_HasOnlineSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_GetPlayerName_PlayerName) == 0x000010, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_GetPlayerName_PlayerName' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_IsPlayInEditor_ReturnValue) == 0x000020, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_IsPlayInEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_GetLocalSteamIDFromSteam_ReturnValue) == 0x000028, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_GetLocalSteamIDFromSteam_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_IsPlayInEditor_ReturnValue1) == 0x000048, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_IsPlayInEditor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_IsValidUniqueNetID_ReturnValue) == 0x000049, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_IsValidUniqueNetID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_UniqueNetIdToString_String) == 0x000050, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_UniqueNetIdToString_String' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_Len_ReturnValue) == 0x000060, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPViveportApi_C_ExecuteUbergraph_BPViveportApi, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'BPViveportApi_C_ExecuteUbergraph_BPViveportApi::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

