#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPViveportApi

#include "Basic.hpp"

#include "EnumSDKType_structs.hpp"
#include "Engine_structs.hpp"
#include "SiliconRising_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPViveportApi.BPViveportApi_C
// 0x0020 (0x0388 - 0x0368)
class ABPViveportApi_C final : public AViveportSDK
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             HeadIcon;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSteam;                                           // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsHasSteam;                                        // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPViveportApi(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPViveportApi_C">();
	}
	static class ABPViveportApi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPViveportApi_C>();
	}
};
static_assert(alignof(ABPViveportApi_C) == 0x000008, "Wrong alignment on ABPViveportApi_C");
static_assert(sizeof(ABPViveportApi_C) == 0x000388, "Wrong size on ABPViveportApi_C");
static_assert(offsetof(ABPViveportApi_C, UberGraphFrame) == 0x000368, "Member 'ABPViveportApi_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPViveportApi_C, DefaultSceneRoot) == 0x000370, "Member 'ABPViveportApi_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABPViveportApi_C, HeadIcon) == 0x000378, "Member 'ABPViveportApi_C::HeadIcon' has a wrong offset!");
static_assert(offsetof(ABPViveportApi_C, IsSteam) == 0x000380, "Member 'ABPViveportApi_C::IsSteam' has a wrong offset!");
static_assert(offsetof(ABPViveportApi_C, IsHasSteam) == 0x000381, "Member 'ABPViveportApi_C::IsHasSteam' has a wrong offset!");

}

