#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_CheckDistance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_OperationType_structs.hpp"


namespace SDK::Params
{

// Function BTD_CheckDistance.BTD_CheckDistance_C.PerformConditionCheck
// 0x0058 (0x0058 - 0x0000)
struct BTD_CheckDistance_C_PerformConditionCheck final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	Enum_OperationType                            Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_CheckDistance_C_PerformConditionCheck) == 0x000008, "Wrong alignment on BTD_CheckDistance_C_PerformConditionCheck");
static_assert(sizeof(BTD_CheckDistance_C_PerformConditionCheck) == 0x000058, "Wrong size on BTD_CheckDistance_C_PerformConditionCheck");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, OwnerActor) == 0x000000, "Member 'BTD_CheckDistance_C_PerformConditionCheck::OwnerActor' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, ReturnValue) == 0x000008, "Member 'BTD_CheckDistance_C_PerformConditionCheck::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, Temp_byte_Variable) == 0x000009, "Member 'BTD_CheckDistance_C_PerformConditionCheck::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x00000C, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000010, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_GetBlackboardValueAsActor_ReturnValue1) == 0x000018, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_GetBlackboardValueAsActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_IsValid_ReturnValue1) == 0x000021, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000034, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_VSize_ReturnValue) == 0x00004C, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000051, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000052, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000053, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_Less_FloatFloat_ReturnValue) == 0x000054, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000055, "Member 'BTD_CheckDistance_C_PerformConditionCheck::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_CheckDistance_C_PerformConditionCheck, K2Node_Select_Default) == 0x000056, "Member 'BTD_CheckDistance_C_PerformConditionCheck::K2Node_Select_Default' has a wrong offset!");

}

