#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_DistanceTo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTD_DistanceTo.BTD_DistanceTo_C.PerformConditionCheckAI
// 0x0058 (0x0058 - 0x0000)
struct BTD_DistanceTo_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Lv2_Gia_C*                          K2Node_DynamicCast_AsBP_Lv_2_Gia;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTD_DistanceTo_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTD_DistanceTo_C_PerformConditionCheckAI");
static_assert(sizeof(BTD_DistanceTo_C_PerformConditionCheckAI) == 0x000058, "Wrong size on BTD_DistanceTo_C_PerformConditionCheckAI");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, K2Node_DynamicCast_AsBP_Lv_2_Gia) == 0x000018, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::K2Node_DynamicCast_AsBP_Lv_2_Gia' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000034, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_VSize_ReturnValue) == 0x00004C, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_Abs_ReturnValue) == 0x000050, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000054, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTD_DistanceTo_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'BTD_DistanceTo_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

