#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_NAVTest

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTDecorator_NAVTest.BTDecorator_NAVTest_C.ExecuteUbergraph_BTDecorator_NAVTest
// 0x0004 (0x0004 - 0x0000)
struct BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest) == 0x000004, "Wrong alignment on BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest");
static_assert(sizeof(BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest) == 0x000004, "Wrong size on BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest");
static_assert(offsetof(BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest, EntryPoint) == 0x000000, "Member 'BTDecorator_NAVTest_C_ExecuteUbergraph_BTDecorator_NAVTest::EntryPoint' has a wrong offset!");

// Function BTDecorator_NAVTest.BTDecorator_NAVTest_C.PerformConditionCheckAI
// 0x0018 (0x0018 - 0x0000)
struct BTDecorator_NAVTest_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTDecorator_NAVTest_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_NAVTest_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_NAVTest_C_PerformConditionCheckAI) == 0x000018, "Wrong size on BTDecorator_NAVTest_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_NAVTest_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_NAVTest_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_NAVTest_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_NAVTest_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_NAVTest_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_NAVTest_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");

}

