#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTDecorator_JumpCone

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTDecorator_JumpCone.BTDecorator_JumpCone_C.PerformConditionCheckAI
// 0x0030 (0x0030 - 0x0000)
struct BTDecorator_JumpCone_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEnemy_Climber_C*                       K2Node_DynamicCast_AsEnemy_Climber;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTDecorator_JumpCone_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BTDecorator_JumpCone_C_PerformConditionCheckAI");
static_assert(sizeof(BTDecorator_JumpCone_C_PerformConditionCheckAI) == 0x000030, "Wrong size on BTDecorator_JumpCone_C_PerformConditionCheckAI");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, K2Node_DynamicCast_AsEnemy_Climber) == 0x000018, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::K2Node_DynamicCast_AsEnemy_Climber' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000021, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_Abs_ReturnValue) == 0x000024, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_Less_FloatFloat_ReturnValue) == 0x000028, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x000029, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x00002A, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTDecorator_JumpCone_C_PerformConditionCheckAI, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BTDecorator_JumpCone_C_PerformConditionCheckAI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

