#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_MatchSpeed

#include "Basic.hpp"

#include "Struct_BasicBehavior_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTS_MatchSpeed.BTS_MatchSpeed_C.ExecuteUbergraph_BTS_MatchSpeed
// 0x01D0 (0x01D0 - 0x0000)
struct BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor1;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBBKeyTargetActor_RetActor;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCharacterMovementComponent*>    CallFunc_GetComponentsByClass_ReturnValue;         // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UCharacterMovementComponent*            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_BasicBehavior                  CallFunc_GetCurrentBehaviorConfig_Config;          // 0x0060(0x00B0)(HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetEQSContextActor_RetActor;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0138(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed) == 0x000008, "Wrong alignment on BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed");
static_assert(sizeof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed) == 0x0001D0, "Wrong size on BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, EntryPoint) == 0x000000, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_Event_OwnerActor1) == 0x000008, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_Event_OwnerActor1' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_DynamicCast_AsBP_AIC) == 0x000010, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_Event_OwnerActor) == 0x000020, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetOwningCharacter_RetCharacter) == 0x000030, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetBBKeyTargetActor_RetActor) == 0x000038, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetBBKeyTargetActor_RetActor' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetComponentsByClass_ReturnValue) == 0x000040, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_Array_Get_Item) == 0x000050, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetCurrentBehaviorConfig_Config) == 0x000060, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetCurrentBehaviorConfig_Config' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000110, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000114, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_GetEQSContextActor_RetActor) == 0x000120, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_GetEQSContextActor_RetActor' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000128, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000138, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0001C0, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_VSize_ReturnValue) == 0x0001C4, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0001C8, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001C9, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed, CallFunc_BooleanAND_ReturnValue1) == 0x0001CA, "Member 'BTS_MatchSpeed_C_ExecuteUbergraph_BTS_MatchSpeed::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BTS_MatchSpeed.BTS_MatchSpeed_C.ReceiveTick
// 0x0010 (0x0010 - 0x0000)
struct BTS_MatchSpeed_C_ReceiveTick final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_MatchSpeed_C_ReceiveTick) == 0x000008, "Wrong alignment on BTS_MatchSpeed_C_ReceiveTick");
static_assert(sizeof(BTS_MatchSpeed_C_ReceiveTick) == 0x000010, "Wrong size on BTS_MatchSpeed_C_ReceiveTick");
static_assert(offsetof(BTS_MatchSpeed_C_ReceiveTick, OwnerActor) == 0x000000, "Member 'BTS_MatchSpeed_C_ReceiveTick::OwnerActor' has a wrong offset!");
static_assert(offsetof(BTS_MatchSpeed_C_ReceiveTick, DeltaSeconds) == 0x000008, "Member 'BTS_MatchSpeed_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BTS_MatchSpeed.BTS_MatchSpeed_C.ReceiveActivation
// 0x0008 (0x0008 - 0x0000)
struct BTS_MatchSpeed_C_ReceiveActivation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTS_MatchSpeed_C_ReceiveActivation) == 0x000008, "Wrong alignment on BTS_MatchSpeed_C_ReceiveActivation");
static_assert(sizeof(BTS_MatchSpeed_C_ReceiveActivation) == 0x000008, "Wrong size on BTS_MatchSpeed_C_ReceiveActivation");
static_assert(offsetof(BTS_MatchSpeed_C_ReceiveActivation, OwnerActor) == 0x000000, "Member 'BTS_MatchSpeed_C_ReceiveActivation::OwnerActor' has a wrong offset!");

}

