#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Lv3NPCService

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_Lv3NPCService.BTS_Lv3NPCService_C
// 0x00A8 (0x0140 - 0x0098)
class UBTS_Lv3NPCService_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 BehaviorState;                                     // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TargetActor;                                       // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 Distance;                                          // 0x00F0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 AttackDistance;                                    // 0x0118(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTS_Lv3NPCService(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_Lv3NPCService_C">();
	}
	static class UBTS_Lv3NPCService_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_Lv3NPCService_C>();
	}
};
static_assert(alignof(UBTS_Lv3NPCService_C) == 0x000008, "Wrong alignment on UBTS_Lv3NPCService_C");
static_assert(sizeof(UBTS_Lv3NPCService_C) == 0x000140, "Wrong size on UBTS_Lv3NPCService_C");
static_assert(offsetof(UBTS_Lv3NPCService_C, UberGraphFrame) == 0x000098, "Member 'UBTS_Lv3NPCService_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3NPCService_C, BehaviorState) == 0x0000A0, "Member 'UBTS_Lv3NPCService_C::BehaviorState' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3NPCService_C, TargetActor) == 0x0000C8, "Member 'UBTS_Lv3NPCService_C::TargetActor' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3NPCService_C, Distance) == 0x0000F0, "Member 'UBTS_Lv3NPCService_C::Distance' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3NPCService_C, AttackDistance) == 0x000118, "Member 'UBTS_Lv3NPCService_C::AttackDistance' has a wrong offset!");

}

