#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_Lv3Car

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTS_Lv3Car.BTS_Lv3Car_C
// 0x0080 (0x0118 - 0x0098)
class UBTS_Lv3Car_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 CarState;                                          // 0x00A0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 FrontTrace;                                        // 0x00C8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 RightTrace;                                        // 0x00F0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTS_Lv3Car(int32 EntryPoint);
	void ReceiveActivationAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTS_Lv3Car_C">();
	}
	static class UBTS_Lv3Car_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_Lv3Car_C>();
	}
};
static_assert(alignof(UBTS_Lv3Car_C) == 0x000008, "Wrong alignment on UBTS_Lv3Car_C");
static_assert(sizeof(UBTS_Lv3Car_C) == 0x000118, "Wrong size on UBTS_Lv3Car_C");
static_assert(offsetof(UBTS_Lv3Car_C, UberGraphFrame) == 0x000098, "Member 'UBTS_Lv3Car_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3Car_C, CarState) == 0x0000A0, "Member 'UBTS_Lv3Car_C::CarState' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3Car_C, FrontTrace) == 0x0000C8, "Member 'UBTS_Lv3Car_C::FrontTrace' has a wrong offset!");
static_assert(offsetof(UBTS_Lv3Car_C, RightTrace) == 0x0000F0, "Member 'UBTS_Lv3Car_C::RightTrace' has a wrong offset!");

}

