#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_MoveToBlackboard

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.ExecuteUbergraph_BTT_MoveToBlackboard
// 0x00D8 (0x00D8 - 0x0000)
struct BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_Event_Result;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      K2Node_CustomEvent_QueryInstance;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               K2Node_CustomEvent_QueryStatus;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        CallFunc_GetResultsAsLocations_ReturnValue;        // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValue_ActorValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValue_VectorValue;           // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor1;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingRequestResult                   CallFunc_MoveToLocation_ReturnValue;               // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnvQueryInstanceBlueprintWrapper*      CallFunc_RunEQSQuery_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingRequestResult                   CallFunc_MoveToLocation_ReturnValue1;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingRequestResult                   CallFunc_MoveToActor_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValue_ActorValue1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValue_VectorValue1;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus)> K2Node_CreateDelegate_OutputDelegate; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LineOfSightTo_ReturnValue;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard) == 0x000008, "Wrong alignment on BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard");
static_assert(sizeof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard) == 0x0000D8, "Wrong size on BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, EntryPoint) == 0x000000, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_Event_Result) == 0x000004, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_SwitchEnum1_CmpSuccess) == 0x000006, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_CustomEvent_QueryInstance) == 0x000008, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_CustomEvent_QueryInstance' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_CustomEvent_QueryStatus) == 0x000010, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_CustomEvent_QueryStatus' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000014, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetResultsAsLocations_ReturnValue) == 0x000018, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetResultsAsLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_Array_Get_Item) == 0x000028, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetBlackboardValue_ActorValue) == 0x000038, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetBlackboardValue_ActorValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetBlackboardValue_VectorValue) == 0x000040, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetBlackboardValue_VectorValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_Not_PreBool_ReturnValue) == 0x00004C, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_IsValid_ReturnValue) == 0x00004D, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_Event_OwnerActor1) == 0x000050, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_Event_OwnerActor1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_DynamicCast_AsBP_AIC) == 0x000058, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_IsValid_ReturnValue1) == 0x000061, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_MoveToLocation_ReturnValue) == 0x000062, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_MoveToLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_IsValid_ReturnValue2) == 0x000063, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_RunEQSQuery_ReturnValue) == 0x000068, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_RunEQSQuery_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_MoveToLocation_ReturnValue1) == 0x000070, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_MoveToLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_MoveToActor_ReturnValue) == 0x000071, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_MoveToActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_K2_GetPawn_ReturnValue) == 0x000078, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_DynamicCast_AsCharacter) == 0x000080, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_DynamicCast_bSuccess1) == 0x000088, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_Event_OwnerActor) == 0x000090, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_IsValid_ReturnValue3) == 0x000098, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetBlackboardValue_ActorValue1) == 0x0000A0, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetBlackboardValue_ActorValue1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetBlackboardValue_VectorValue1) == 0x0000A8, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetBlackboardValue_VectorValue1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_IsValid_ReturnValue4) == 0x0000B4, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_GetController_ReturnValue) == 0x0000B8, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard, CallFunc_LineOfSightTo_ReturnValue) == 0x0000D0, "Member 'BTT_MoveToBlackboard_C_ExecuteUbergraph_BTT_MoveToBlackboard::CallFunc_LineOfSightTo_ReturnValue' has a wrong offset!");

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.ReceiveMoveCompleted
// 0x0001 (0x0001 - 0x0000)
struct BTT_MoveToBlackboard_C_ReceiveMoveCompleted final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToBlackboard_C_ReceiveMoveCompleted) == 0x000001, "Wrong alignment on BTT_MoveToBlackboard_C_ReceiveMoveCompleted");
static_assert(sizeof(BTT_MoveToBlackboard_C_ReceiveMoveCompleted) == 0x000001, "Wrong size on BTT_MoveToBlackboard_C_ReceiveMoveCompleted");
static_assert(offsetof(BTT_MoveToBlackboard_C_ReceiveMoveCompleted, Result) == 0x000000, "Member 'BTT_MoveToBlackboard_C_ReceiveMoveCompleted::Result' has a wrong offset!");

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.ReceiveAbort
// 0x0008 (0x0008 - 0x0000)
struct BTT_MoveToBlackboard_C_ReceiveAbort final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToBlackboard_C_ReceiveAbort) == 0x000008, "Wrong alignment on BTT_MoveToBlackboard_C_ReceiveAbort");
static_assert(sizeof(BTT_MoveToBlackboard_C_ReceiveAbort) == 0x000008, "Wrong size on BTT_MoveToBlackboard_C_ReceiveAbort");
static_assert(offsetof(BTT_MoveToBlackboard_C_ReceiveAbort, OwnerActor) == 0x000000, "Member 'BTT_MoveToBlackboard_C_ReceiveAbort::OwnerActor' has a wrong offset!");

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_MoveToBlackboard_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToBlackboard_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_MoveToBlackboard_C_ReceiveExecute");
static_assert(sizeof(BTT_MoveToBlackboard_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_MoveToBlackboard_C_ReceiveExecute");
static_assert(offsetof(BTT_MoveToBlackboard_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_MoveToBlackboard_C_ReceiveExecute::OwnerActor' has a wrong offset!");

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.OnQueryFinishedEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0 final
{
public:
	class UEnvQueryInstanceBlueprintWrapper*      QueryInstance;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnvQueryStatus                               QueryStatus;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0) == 0x000008, "Wrong alignment on BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0");
static_assert(sizeof(BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0) == 0x000010, "Wrong size on BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0");
static_assert(offsetof(BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0, QueryInstance) == 0x000000, "Member 'BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0::QueryInstance' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0, QueryStatus) == 0x000008, "Member 'BTT_MoveToBlackboard_C_OnQueryFinishedEvent_Event_0::QueryStatus' has a wrong offset!");

// Function BTT_MoveToBlackboard.BTT_MoveToBlackboard_C.GetBlackboardValue
// 0x0060 (0x0060 - 0x0000)
struct BTT_MoveToBlackboard_C_GetBlackboardValue final
{
public:
	struct FBlackboardKeySelector                 Key;                                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	class AActor*                                 ActorValue;                                        // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorValue;                                       // 0x0030(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue;    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetBlackboardValueAsActor_ReturnValue1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_MoveToBlackboard_C_GetBlackboardValue) == 0x000008, "Wrong alignment on BTT_MoveToBlackboard_C_GetBlackboardValue");
static_assert(sizeof(BTT_MoveToBlackboard_C_GetBlackboardValue) == 0x000060, "Wrong size on BTT_MoveToBlackboard_C_GetBlackboardValue");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, Key) == 0x000000, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::Key' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, ActorValue) == 0x000028, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::ActorValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, VectorValue) == 0x000030, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::VectorValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, CallFunc_GetBlackboardValueAsActor_ReturnValue) == 0x000040, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::CallFunc_GetBlackboardValueAsActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, CallFunc_GetBlackboardValueAsActor_ReturnValue1) == 0x000048, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::CallFunc_GetBlackboardValueAsActor_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_MoveToBlackboard_C_GetBlackboardValue, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000054, "Member 'BTT_MoveToBlackboard_C_GetBlackboardValue::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");

}

