#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_PlayBehaviorAnim

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_PlayBehaviorAnim.BTT_PlayBehaviorAnim_C.ExecuteUbergraph_BTT_PlayBehaviorAnim
// 0x0020 (0x0020 - 0x0000)
struct BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimation_AnimLength;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim) == 0x000008, "Wrong alignment on BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim");
static_assert(sizeof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim) == 0x000020, "Wrong size on BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim, EntryPoint) == 0x000000, "Member 'BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim, K2Node_DynamicCast_AsBP_AIC) == 0x000010, "Member 'BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim, CallFunc_PlayAnimation_AnimLength) == 0x00001C, "Member 'BTT_PlayBehaviorAnim_C_ExecuteUbergraph_BTT_PlayBehaviorAnim::CallFunc_PlayAnimation_AnimLength' has a wrong offset!");

// Function BTT_PlayBehaviorAnim.BTT_PlayBehaviorAnim_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_PlayBehaviorAnim_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_PlayBehaviorAnim_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_PlayBehaviorAnim_C_ReceiveExecute");
static_assert(sizeof(BTT_PlayBehaviorAnim_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_PlayBehaviorAnim_C_ReceiveExecute");
static_assert(offsetof(BTT_PlayBehaviorAnim_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_PlayBehaviorAnim_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

