#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Lv4_InterceptPlayer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTT_Lv4_InterceptPlayer.BTT_Lv4_InterceptPlayer_C.ExecuteUbergraph_BTT_Lv4_InterceptPlayer
// 0x0040 (0x0040 - 0x0000)
struct BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALv4_NormalCarBase_C*                   K2Node_DynamicCast_AsLv_4_Normal_Car_Base;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Distance_Between_Actors_Distance;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer) == 0x000008, "Wrong alignment on BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer");
static_assert(sizeof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer) == 0x000040, "Wrong size on BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, EntryPoint) == 0x000000, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, Temp_float_Variable) == 0x000004, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, K2Node_Event_OwnerController) == 0x000008, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, K2Node_DynamicCast_AsLv_4_Normal_Car_Base) == 0x000018, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::K2Node_DynamicCast_AsLv_4_Normal_Car_Base' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_BreakVector2D_X) == 0x000028, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_Distance_Between_Actors_Distance) == 0x000030, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_Distance_Between_Actors_Distance' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_MakeVector2D_ReturnValue) == 0x000034, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003D, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer, CallFunc_BooleanAND_ReturnValue1) == 0x00003F, "Member 'BTT_Lv4_InterceptPlayer_C_ExecuteUbergraph_BTT_Lv4_InterceptPlayer::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BTT_Lv4_InterceptPlayer.BTT_Lv4_InterceptPlayer_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI");
static_assert(sizeof(BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTT_Lv4_InterceptPlayer_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

