#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_CircleStrafe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_CircleStrafe.BTT_CircleStrafe_C
// 0x0018 (0x00B8 - 0x00A0)
class UBTT_CircleStrafe_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APawn*                                  PawnRef;                                           // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Direction;                                         // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_CircleStrafe(int32 EntryPoint);
	void ReceiveExecute(class AActor* OwnerActor);
	void ReceiveTick(class AActor* OwnerActor, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_CircleStrafe_C">();
	}
	static class UBTT_CircleStrafe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_CircleStrafe_C>();
	}
};
static_assert(alignof(UBTT_CircleStrafe_C) == 0x000008, "Wrong alignment on UBTT_CircleStrafe_C");
static_assert(sizeof(UBTT_CircleStrafe_C) == 0x0000B8, "Wrong size on UBTT_CircleStrafe_C");
static_assert(offsetof(UBTT_CircleStrafe_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_CircleStrafe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_CircleStrafe_C, PawnRef) == 0x0000A8, "Member 'UBTT_CircleStrafe_C::PawnRef' has a wrong offset!");
static_assert(offsetof(UBTT_CircleStrafe_C, Direction) == 0x0000B0, "Member 'UBTT_CircleStrafe_C::Direction' has a wrong offset!");

}

