#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DoPatrolWait

#include "Basic.hpp"

#include "Struct_PatrolParam_structs.hpp"


namespace SDK::Params
{

// Function BTT_DoPatrolWait.BTT_DoPatrolWait_C.ExecuteUbergraph_BTT_DoPatrolWait
// 0x0070 (0x0070 - 0x0000)
struct BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue1;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPatrolIndex__index;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_PatrolParam                    CallFunc_Array_Get_Item;                           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait) == 0x000008, "Wrong alignment on BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait");
static_assert(sizeof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait) == 0x000070, "Wrong size on BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, EntryPoint) == 0x000000, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, Temp_bool_True_if_break_was_hit_Variable) == 0x000014, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_Not_PreBool_ReturnValue) == 0x000015, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, K2Node_Event_OwnerActor) == 0x000018, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, K2Node_DynamicCast_AsBP_AIC) == 0x000020, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_MakeLiteralName_ReturnValue1) == 0x000038, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_MakeLiteralName_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_GetOwningCharacter_RetCharacter) == 0x000040, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_GetPatrolIndex__index) == 0x000048, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_GetPatrolIndex__index' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_Array_Get_Item) == 0x000050, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_PlayAnimMontage_ReturnValue) == 0x000068, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006D, "Member 'BTT_DoPatrolWait_C_ExecuteUbergraph_BTT_DoPatrolWait::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BTT_DoPatrolWait.BTT_DoPatrolWait_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_DoPatrolWait_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoPatrolWait_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_DoPatrolWait_C_ReceiveExecute");
static_assert(sizeof(BTT_DoPatrolWait_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_DoPatrolWait_C_ReceiveExecute");
static_assert(offsetof(BTT_DoPatrolWait_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_DoPatrolWait_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

