#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DoGotoTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_DoGotoTarget.BTT_DoGotoTarget_C.ExecuteUbergraph_BTT_DoGotoTarget
// 0x0038 (0x0038 - 0x0000)
struct BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget) == 0x000008, "Wrong alignment on BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget");
static_assert(sizeof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget) == 0x000038, "Wrong size on BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, EntryPoint) == 0x000000, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, CallFunc_MakeLiteralName_ReturnValue) == 0x000008, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, K2Node_Event_OwnerActor) == 0x000010, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, K2Node_DynamicCast_AsBP_AIC) == 0x000018, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, CallFunc_GetOwningCharacter_RetCharacter) == 0x000028, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, CallFunc_PlayAnimMontage_ReturnValue) == 0x000030, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BTT_DoGotoTarget_C_ExecuteUbergraph_BTT_DoGotoTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTT_DoGotoTarget.BTT_DoGotoTarget_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_DoGotoTarget_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoGotoTarget_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_DoGotoTarget_C_ReceiveExecute");
static_assert(sizeof(BTT_DoGotoTarget_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_DoGotoTarget_C_ReceiveExecute");
static_assert(offsetof(BTT_DoGotoTarget_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_DoGotoTarget_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

