#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_MoveTo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_MoveTo.BTT_MoveTo_C
// 0x0058 (0x00F8 - 0x00A0)
class UBTT_MoveTo_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x00A8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 HideLocation;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_MoveTo(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnSuccess_DFF0D11A4B88AFE12CC9A7866381C1C8(EPathFollowingResult MovementResult);
	void OnFail_DFF0D11A4B88AFE12CC9A7866381C1C8(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_MoveTo_C">();
	}
	static class UBTT_MoveTo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_MoveTo_C>();
	}
};
static_assert(alignof(UBTT_MoveTo_C) == 0x000008, "Wrong alignment on UBTT_MoveTo_C");
static_assert(sizeof(UBTT_MoveTo_C) == 0x0000F8, "Wrong size on UBTT_MoveTo_C");
static_assert(offsetof(UBTT_MoveTo_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_MoveTo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_MoveTo_C, TargetLocation) == 0x0000A8, "Member 'UBTT_MoveTo_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UBTT_MoveTo_C, HideLocation) == 0x0000D0, "Member 'UBTT_MoveTo_C::HideLocation' has a wrong offset!");

}

