#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DoAlert

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_DoAlert.BTT_DoAlert_C.ExecuteUbergraph_BTT_DoAlert
// 0x0060 (0x0060 - 0x0000)
struct BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_lsGameINP1__flag;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC1;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Plunger_C*                      K2Node_DynamicCast_AsBP_NPC_Plunger;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert) == 0x000008, "Wrong alignment on BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert");
static_assert(sizeof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert) == 0x000060, "Wrong size on BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, EntryPoint) == 0x000000, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_Event_OwnerActor) == 0x000010, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000018, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_AsBP_AIC) == 0x000028, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_bSuccess1) == 0x000030, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, CallFunc_lsGameINP1__flag) == 0x000031, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::CallFunc_lsGameINP1__flag' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_AsBP_AIC1) == 0x000038, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_AsBP_AIC1' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_bSuccess2) == 0x000040, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_AsBP_NPC_Plunger) == 0x000050, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_AsBP_NPC_Plunger' has a wrong offset!");
static_assert(offsetof(BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert, K2Node_DynamicCast_bSuccess3) == 0x000058, "Member 'BTT_DoAlert_C_ExecuteUbergraph_BTT_DoAlert::K2Node_DynamicCast_bSuccess3' has a wrong offset!");

// Function BTT_DoAlert.BTT_DoAlert_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_DoAlert_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoAlert_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_DoAlert_C_ReceiveExecute");
static_assert(sizeof(BTT_DoAlert_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_DoAlert_C_ReceiveExecute");
static_assert(offsetof(BTT_DoAlert_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_DoAlert_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

