#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DoInvestigate

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_DoInvestigate.BTT_DoInvestigate_C.ExecuteUbergraph_BTT_DoInvestigate
// 0x0028 (0x0028 - 0x0000)
struct BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate) == 0x000008, "Wrong alignment on BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate");
static_assert(sizeof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate) == 0x000028, "Wrong size on BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, EntryPoint) == 0x000000, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, Temp_int_Variable) == 0x000010, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, K2Node_DynamicCast_AsBP_AIC) == 0x000018, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000021, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BTT_DoInvestigate_C_ExecuteUbergraph_BTT_DoInvestigate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BTT_DoInvestigate.BTT_DoInvestigate_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_DoInvestigate_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoInvestigate_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_DoInvestigate_C_ReceiveExecute");
static_assert(sizeof(BTT_DoInvestigate_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_DoInvestigate_C_ReceiveExecute");
static_assert(offsetof(BTT_DoInvestigate_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_DoInvestigate_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

