#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_HeavyRiotRangedAttack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Struct_BasicBehavior_structs.hpp"


namespace SDK::Params
{

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.ExecuteUbergraph_BTT_HeavyRiotRangedAttack
// 0x01A0 (0x01A0 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor1;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC1;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC2;                      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReloading_ret;                          // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstSeenPlayer_IsSeen;                 // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindAttackTarget_Success;                 // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReloading_ret1;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoRangedAttack_Success;                   // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate1;      // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue;   // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC3;                      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindCoverPoint_Success;                   // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindCoverPoint_Location;                  // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetBlackboardValueAsVector_ReturnValue1;  // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC4;                      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStruct_BasicBehavior                  CallFunc_GetCurrentBehaviorConfig_Config;          // 0x00E8(0x00B0)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack) == 0x0001A0, "Wrong size on BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, EntryPoint) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, Temp_byte_Variable) == 0x000004, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_Event_OwnerActor1) == 0x000008, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_Event_OwnerActor1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_Event_OwnerActor) == 0x000010, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_AsBP_AIC) == 0x000020, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_CustomEvent_MovementResult) == 0x000029, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x00002C, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_AsBP_AIC1) == 0x000038, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_AsBP_AIC1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_bSuccess1) == 0x000040, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_CustomEvent_MovementResult1) == 0x000058, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_CustomEvent_MovementResult1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_AsBP_AIC2) == 0x000060, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_AsBP_AIC2' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_bSuccess2) == 0x000068, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_IsReloading_ret) == 0x000069, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_IsReloading_ret' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_IsFirstSeenPlayer_IsSeen) == 0x00006A, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_IsFirstSeenPlayer_IsSeen' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_FindAttackTarget_Success) == 0x00006B, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_FindAttackTarget_Success' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_IsReloading_ret1) == 0x00006C, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_IsReloading_ret1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_DoRangedAttack_Success) == 0x00006D, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_DoRangedAttack_Success' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_CreateDelegate_OutputDelegate1) == 0x000078, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_GetBlackboardValueAsVector_ReturnValue) == 0x000088, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_GetBlackboardValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_AsBP_AIC3) == 0x000098, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_AsBP_AIC3' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_bSuccess3) == 0x0000A0, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_K2_GetPawn_ReturnValue) == 0x0000A8, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0000B0, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_FindCoverPoint_Success) == 0x0000B1, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_FindCoverPoint_Success' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_FindCoverPoint_Location) == 0x0000B4, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_FindCoverPoint_Location' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000C0, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_GetBlackboardValueAsVector_ReturnValue1) == 0x0000C4, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_GetBlackboardValueAsVector_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x0000D0, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_AsBP_AIC4) == 0x0000D8, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_AsBP_AIC4' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, K2Node_DynamicCast_bSuccess4) == 0x0000E0, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_GetCurrentBehaviorConfig_Config) == 0x0000E8, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_GetCurrentBehaviorConfig_Config' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000199, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack, CallFunc_Not_PreBool_ReturnValue) == 0x00019A, "Member 'BTT_HeavyRiotRangedAttack_C_ExecuteUbergraph_BTT_HeavyRiotRangedAttack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.ReceiveTick
// 0x0010 (0x0010 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_ReceiveTick final
{
public:
	class AActor*                                 OwnerActor_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_ReceiveTick) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_ReceiveTick");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_ReceiveTick) == 0x000010, "Wrong size on BTT_HeavyRiotRangedAttack_C_ReceiveTick");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ReceiveTick, OwnerActor_0) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_ReceiveTick::OwnerActor_0' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ReceiveTick, DeltaSeconds) == 0x000008, "Member 'BTT_HeavyRiotRangedAttack_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor_0;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_ReceiveExecute");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_HeavyRiotRangedAttack_C_ReceiveExecute");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ReceiveExecute, OwnerActor_0) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_ReceiveExecute::OwnerActor_0' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.OnSuccess_52778842480B53E3474263BE18C616B7
// 0x0001 (0x0001 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7) == 0x000001, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7) == 0x000001, "Wrong size on BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7, MovementResult) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_OnSuccess_52778842480B53E3474263BE18C616B7::MovementResult' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.OnFail_52778842480B53E3474263BE18C616B7
// 0x0001 (0x0001 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7) == 0x000001, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7) == 0x000001, "Wrong size on BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7, MovementResult) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_OnFail_52778842480B53E3474263BE18C616B7::MovementResult' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.FaceToViewTarget
// 0x0078 (0x0078 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_FaceToViewTarget final
{
public:
	class ABP_AIC_C*                              SelfController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SelfActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X1;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_FaceToViewTarget");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget) == 0x000078, "Wrong size on BTT_HeavyRiotRangedAttack_C_FaceToViewTarget");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, SelfController) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::SelfController' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, SelfActor) == 0x000008, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::SelfActor' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_GetViewTarget_ReturnValue) == 0x000020, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_X) == 0x000028, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_Y) == 0x00002C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_Z) == 0x000030, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000038, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_X1) == 0x000044, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_Y1) == 0x000048, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_BreakVector_Z1) == 0x00004C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_MakeVector_ReturnValue) == 0x000050, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00005C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000068, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToViewTarget, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000074, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToViewTarget::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.FaceToTarget
// 0x00C8 (0x00C8 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_FaceToTarget final
{
public:
	class ABP_AIC_C*                              SelfController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCurrentAttackTarget_TargetRef;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X1;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y1;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z1;                           // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll1;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch1;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw1;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_FaceToTarget) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_FaceToTarget");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_FaceToTarget) == 0x0000C8, "Wrong size on BTT_HeavyRiotRangedAttack_C_FaceToTarget");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, SelfController) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::SelfController' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000018, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Roll) == 0x000024, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Pitch) == 0x000028, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Yaw) == 0x00002C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_MakeRotator_ReturnValue) == 0x00003C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_X) == 0x000048, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_Y) == 0x00004C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_Z) == 0x000050, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_GetCurrentAttackTarget_TargetRef) == 0x000058, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_GetCurrentAttackTarget_TargetRef' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_K2_GetActorLocation_ReturnValue1) == 0x000060, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_K2_GetActorLocation_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_IsValid_ReturnValue1) == 0x00006C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_X1) == 0x000070, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_X1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_Y1) == 0x000074, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_Y1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakVector_Z1) == 0x000078, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakVector_Z1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_MakeVector_ReturnValue) == 0x00007C, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000094, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Roll1) == 0x0000A0, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Roll1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Pitch1) == 0x0000A4, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Pitch1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_BreakRotator_Yaw1) == 0x0000A8, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_BreakRotator_Yaw1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_MakeRotator_ReturnValue1) == 0x0000AC, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_RInterpTo_ReturnValue) == 0x0000B8, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_FaceToTarget, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000C4, "Member 'BTT_HeavyRiotRangedAttack_C_FaceToTarget::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.ChangeUseControllerRotation
// 0x0028 (0x0028 - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation final
{
public:
	class ABP_AIC_C*                              SelfController;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUse;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation) == 0x000008, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation) == 0x000028, "Wrong size on BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation, SelfController) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation::SelfController' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation, IsUse) == 0x000008, "Member 'BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation::IsUse' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation, K2Node_DynamicCast_AsCharacter) == 0x000018, "Member 'BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTT_HeavyRiotRangedAttack_C_ChangeUseControllerRotation::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_HeavyRiotRangedAttack.BTT_HeavyRiotRangedAttack_C.ResetRandomSettings
// 0x001C (0x001C - 0x0000)
struct BTT_HeavyRiotRangedAttack_C_ResetRandomSettings final
{
public:
	bool                                          IsAttackSpeed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue1;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue2;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBlackboardValueAsFloat_ReturnValue3;   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_HeavyRiotRangedAttack_C_ResetRandomSettings) == 0x000004, "Wrong alignment on BTT_HeavyRiotRangedAttack_C_ResetRandomSettings");
static_assert(sizeof(BTT_HeavyRiotRangedAttack_C_ResetRandomSettings) == 0x00001C, "Wrong size on BTT_HeavyRiotRangedAttack_C_ResetRandomSettings");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ResetRandomSettings, IsAttackSpeed) == 0x000000, "Member 'BTT_HeavyRiotRangedAttack_C_ResetRandomSettings::IsAttackSpeed' has a wrong offset!");
static_assert(offsetof(BTT_HeavyRiotRangedAttack_C_ResetRandomSettings, CallFunc_GetBlackboardValueAsFloat_ReturnValue) == 0x000004, "Member 'BTT_HeavyRiotRangedAttack_C_ResetRandomSettings::CallFunc_GetBlackboardValueAsFloat_ReturnValue' has a wrong offset!");
