#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AttackTargetRanged

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_AttackTargetRanged.BTT_AttackTargetRanged_C.ExecuteUbergraph_BTT_AttackTargetRanged
// 0x0040 (0x0040 - 0x0000)
struct BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReloading_ret;                          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFirstSeenPlayer_IsSeen;                 // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReloading_ret1;                         // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoRangedAttack_Success;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged) == 0x000008, "Wrong alignment on BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged");
static_assert(sizeof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged) == 0x000040, "Wrong size on BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, EntryPoint) == 0x000000, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, K2Node_DynamicCast_AsBP_AIC) == 0x000010, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_IsReloading_ret) == 0x000028, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_IsReloading_ret' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, K2Node_DynamicCast_AsCharacter) == 0x000030, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_IsCrouching_ReturnValue) == 0x000039, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_IsFirstSeenPlayer_IsSeen) == 0x00003A, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_IsFirstSeenPlayer_IsSeen' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_IsReloading_ret1) == 0x00003B, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_IsReloading_ret1' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged, CallFunc_DoRangedAttack_Success) == 0x00003D, "Member 'BTT_AttackTargetRanged_C_ExecuteUbergraph_BTT_AttackTargetRanged::CallFunc_DoRangedAttack_Success' has a wrong offset!");

// Function BTT_AttackTargetRanged.BTT_AttackTargetRanged_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_AttackTargetRanged_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_AttackTargetRanged_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_AttackTargetRanged_C_ReceiveExecute");
static_assert(sizeof(BTT_AttackTargetRanged_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_AttackTargetRanged_C_ReceiveExecute");
static_assert(offsetof(BTT_AttackTargetRanged_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_AttackTargetRanged_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

