#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_GetNextLocation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_GetNextLocation.BTT_GetNextLocation_C
// 0x0058 (0x00F8 - 0x00A0)
class UBTT_GetNextLocation_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x00A8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 WaitRotation;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_GetNextLocation(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTT_GetNextLocation_C">();
	}
	static class UBTT_GetNextLocation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_GetNextLocation_C>();
	}
};
static_assert(alignof(UBTT_GetNextLocation_C) == 0x000008, "Wrong alignment on UBTT_GetNextLocation_C");
static_assert(sizeof(UBTT_GetNextLocation_C) == 0x0000F8, "Wrong size on UBTT_GetNextLocation_C");
static_assert(offsetof(UBTT_GetNextLocation_C, UberGraphFrame) == 0x0000A0, "Member 'UBTT_GetNextLocation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTT_GetNextLocation_C, TargetLocation) == 0x0000A8, "Member 'UBTT_GetNextLocation_C::TargetLocation' has a wrong offset!");
static_assert(offsetof(UBTT_GetNextLocation_C, WaitRotation) == 0x0000D0, "Member 'UBTT_GetNextLocation_C::WaitRotation' has a wrong offset!");

}

