#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_DoTalking

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_DoTalking.BTT_DoTalking_C.ExecuteUbergraph_BTT_DoTalking
// 0x0058 (0x0058 - 0x0000)
struct BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetBBKeyTargetActor_RetActor;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_BehaviorComponent_C*>        CallFunc_GetComponentsByClass_ReturnValue;         // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	class UBP_BehaviorComponent_C*                CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetOwningCharacter_RetCharacter1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking) == 0x000008, "Wrong alignment on BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking");
static_assert(sizeof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking) == 0x000058, "Wrong size on BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, EntryPoint) == 0x000000, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, K2Node_DynamicCast_AsBP_AIC) == 0x000010, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_GetBBKeyTargetActor_RetActor) == 0x000020, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_GetBBKeyTargetActor_RetActor' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_GetComponentsByClass_ReturnValue) == 0x000028, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_Array_Get_Item) == 0x000038, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_GetOwningCharacter_RetCharacter) == 0x000040, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_GetOwningCharacter_RetCharacter' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_GetOwningCharacter_RetCharacter1) == 0x000048, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_GetOwningCharacter_RetCharacter1' has a wrong offset!");
static_assert(offsetof(BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BTT_DoTalking_C_ExecuteUbergraph_BTT_DoTalking::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BTT_DoTalking.BTT_DoTalking_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_DoTalking_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_DoTalking_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_DoTalking_C_ReceiveExecute");
static_assert(sizeof(BTT_DoTalking_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_DoTalking_C_ReceiveExecute");
static_assert(offsetof(BTT_DoTalking_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_DoTalking_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

