#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetStartPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_SetStartPoint.BTT_SetStartPoint_C.ExecuteUbergraph_BTT_SetStartPoint
// 0x0020 (0x0020 - 0x0000)
struct BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AIC_C*                              K2Node_DynamicCast_AsBP_AIC;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint) == 0x000008, "Wrong alignment on BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint");
static_assert(sizeof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint) == 0x000020, "Wrong size on BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint");
static_assert(offsetof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint, EntryPoint) == 0x000000, "Member 'BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint, K2Node_Event_OwnerActor) == 0x000008, "Member 'BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint, K2Node_DynamicCast_AsBP_AIC) == 0x000010, "Member 'BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint::K2Node_DynamicCast_AsBP_AIC' has a wrong offset!");
static_assert(offsetof(BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTT_SetStartPoint_C_ExecuteUbergraph_BTT_SetStartPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTT_SetStartPoint.BTT_SetStartPoint_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTT_SetStartPoint_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTT_SetStartPoint_C_ReceiveExecute) == 0x000008, "Wrong alignment on BTT_SetStartPoint_C_ReceiveExecute");
static_assert(sizeof(BTT_SetStartPoint_C_ReceiveExecute) == 0x000008, "Wrong size on BTT_SetStartPoint_C_ReceiveExecute");
static_assert(offsetof(BTT_SetStartPoint_C_ReceiveExecute, OwnerActor) == 0x000000, "Member 'BTT_SetStartPoint_C_ReceiveExecute::OwnerActor' has a wrong offset!");

}

