#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_CarBeginHit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_CarBeginHit.BTTask_CarBeginHit_C.ExecuteUbergraph_BTTask_CarBeginHit
// 0x0068 (0x0068 - 0x0000)
struct BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv3_BaseCar_C*                      K2Node_DynamicCast_AsBP_Lv_3_Base_Car;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Distance_Between_Locations_Distance;      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit) == 0x000008, "Wrong alignment on BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit");
static_assert(sizeof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit) == 0x000068, "Wrong size on BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, EntryPoint) == 0x000000, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, K2Node_DynamicCast_AsBP_Lv_3_Base_Car) == 0x000018, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::K2Node_DynamicCast_AsBP_Lv_3_Base_Car' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Greater_IntInt_ReturnValue) == 0x000021, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Distance_Between_Locations_Distance) == 0x000034, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Distance_Between_Locations_Distance' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_SelectFloat_ReturnValue) == 0x00003C, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_SelectFloat_ReturnValue1) == 0x000040, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_SelectFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_MakeVector2D_ReturnValue) == 0x000048, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Add_FloatFloat_ReturnValue1) == 0x000050, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_MakeVector2D_ReturnValue1) == 0x000054, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_BreakVector2D_X) == 0x00005C, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_BreakVector2D_Y) == 0x000060, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000064, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_Not_PreBool_ReturnValue) == 0x000065, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_BooleanAND_ReturnValue) == 0x000066, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit, CallFunc_BooleanAND_ReturnValue1) == 0x000067, "Member 'BTTask_CarBeginHit_C_ExecuteUbergraph_BTTask_CarBeginHit::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");

// Function BTTask_CarBeginHit.BTTask_CarBeginHit_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_CarBeginHit_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_CarBeginHit_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_CarBeginHit_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_CarBeginHit_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_CarBeginHit_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_CarBeginHit_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_CarBeginHit_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_CarBeginHit_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_CarBeginHit_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

