#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_Lv3NPCBehavior

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_Lv3NPCBehavior.BTTask_Lv3NPCBehavior_C
// 0x0038 (0x00D8 - 0x00A0)
class UBTTask_Lv3NPCBehavior_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 WaitTime;                                          // 0x00A8(0x0028)(Edit, BlueprintVisible)
	float                                         Delay;                                             // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_Lv3NPCBehavior(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTTask_Lv3NPCBehavior_C">();
	}
	static class UBTTask_Lv3NPCBehavior_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_Lv3NPCBehavior_C>();
	}
};
static_assert(alignof(UBTTask_Lv3NPCBehavior_C) == 0x000008, "Wrong alignment on UBTTask_Lv3NPCBehavior_C");
static_assert(sizeof(UBTTask_Lv3NPCBehavior_C) == 0x0000D8, "Wrong size on UBTTask_Lv3NPCBehavior_C");
static_assert(offsetof(UBTTask_Lv3NPCBehavior_C, UberGraphFrame) == 0x0000A0, "Member 'UBTTask_Lv3NPCBehavior_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTTask_Lv3NPCBehavior_C, WaitTime) == 0x0000A8, "Member 'UBTTask_Lv3NPCBehavior_C::WaitTime' has a wrong offset!");
static_assert(offsetof(UBTTask_Lv3NPCBehavior_C, Delay) == 0x0000D0, "Member 'UBTTask_Lv3NPCBehavior_C::Delay' has a wrong offset!");

}

