#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomDepthUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomDepthUI.CustomDepthUI_C
// 0x0020 (0x0228 - 0x0208)
class UCustomDepthUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_38;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CustomDepthUI(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomDepthUI_C">();
	}
	static class UCustomDepthUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomDepthUI_C>();
	}
};
static_assert(alignof(UCustomDepthUI_C) == 0x000008, "Wrong alignment on UCustomDepthUI_C");
static_assert(sizeof(UCustomDepthUI_C) == 0x000228, "Wrong size on UCustomDepthUI_C");
static_assert(offsetof(UCustomDepthUI_C, UberGraphFrame) == 0x000208, "Member 'UCustomDepthUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomDepthUI_C, TextBlock_38) == 0x000210, "Member 'UCustomDepthUI_C::TextBlock_38' has a wrong offset!");
static_assert(offsetof(UCustomDepthUI_C, Text) == 0x000218, "Member 'UCustomDepthUI_C::Text' has a wrong offset!");

}

