#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeathUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DeathUI.DeathUI_C
// 0x0020 (0x0228 - 0x0208)
class UDeathUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_24;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Time;                                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         TimeLeft;                                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DeathUI(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeathUI_C">();
	}
	static class UDeathUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathUI_C>();
	}
};
static_assert(alignof(UDeathUI_C) == 0x000008, "Wrong alignment on UDeathUI_C");
static_assert(sizeof(UDeathUI_C) == 0x000228, "Wrong size on UDeathUI_C");
static_assert(offsetof(UDeathUI_C, UberGraphFrame) == 0x000208, "Member 'UDeathUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDeathUI_C, TextBlock_24) == 0x000210, "Member 'UDeathUI_C::TextBlock_24' has a wrong offset!");
static_assert(offsetof(UDeathUI_C, Time) == 0x000218, "Member 'UDeathUI_C::Time' has a wrong offset!");
static_assert(offsetof(UDeathUI_C, TimeLeft) == 0x000220, "Member 'UDeathUI_C::TimeLeft' has a wrong offset!");

}

