#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DifficultyHard

#include "Basic.hpp"


namespace SDK::Params
{

// Function DifficultyHard.DifficultyHard_C.ExecuteUbergraph_DifficultyHard
// 0x0020 (0x0020 - 0x0000)
struct DifficultyHard_C_ExecuteUbergraph_DifficultyHard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard) == 0x000008, "Wrong alignment on DifficultyHard_C_ExecuteUbergraph_DifficultyHard");
static_assert(sizeof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard) == 0x000020, "Wrong size on DifficultyHard_C_ExecuteUbergraph_DifficultyHard");
static_assert(offsetof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard, EntryPoint) == 0x000000, "Member 'DifficultyHard_C_ExecuteUbergraph_DifficultyHard::EntryPoint' has a wrong offset!");
static_assert(offsetof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'DifficultyHard_C_ExecuteUbergraph_DifficultyHard::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000010, "Member 'DifficultyHard_C_ExecuteUbergraph_DifficultyHard::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(DifficultyHard_C_ExecuteUbergraph_DifficultyHard, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DifficultyHard_C_ExecuteUbergraph_DifficultyHard::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

