#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DifficultyBack

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "EnumMenuState_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DifficultyBack.DifficultyBack_C
// 0x0028 (0x0230 - 0x0208)
class UDifficultyBack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                BackButton;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bg;                                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABPMainMenu_C*                          parenterActor;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumMenuState                                 tmpState;                                          // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DifficultyBack(int32 EntryPoint);
	void BndEvt__backButton_K2Node_ComponentBoundEvent_346_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DifficultyBack_C">();
	}
	static class UDifficultyBack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDifficultyBack_C>();
	}
};
static_assert(alignof(UDifficultyBack_C) == 0x000008, "Wrong alignment on UDifficultyBack_C");
static_assert(sizeof(UDifficultyBack_C) == 0x000230, "Wrong size on UDifficultyBack_C");
static_assert(offsetof(UDifficultyBack_C, UberGraphFrame) == 0x000208, "Member 'UDifficultyBack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDifficultyBack_C, BackButton) == 0x000210, "Member 'UDifficultyBack_C::BackButton' has a wrong offset!");
static_assert(offsetof(UDifficultyBack_C, bg) == 0x000218, "Member 'UDifficultyBack_C::bg' has a wrong offset!");
static_assert(offsetof(UDifficultyBack_C, parenterActor) == 0x000220, "Member 'UDifficultyBack_C::parenterActor' has a wrong offset!");
static_assert(offsetof(UDifficultyBack_C, tmpState) == 0x000228, "Member 'UDifficultyBack_C::tmpState' has a wrong offset!");

}

