#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Enemy_Climber

#include "Basic.hpp"

#include "BE_Lv3_ClimberJumpDir_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Enemy_Climber.Enemy_Climber_C.ExecuteUbergraph_Enemy_Climber
// 0x0088 (0x0088 - 0x0000)
struct Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	EBE_Lv3_ClimberJumpDir                        Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable1;                              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable2;                              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable3;                              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv3_characterBase_C*                K2Node_DynamicCast_AsBP_Lv_3_Character_Base;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCanJump_Result;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EBE_Lv3_ClimberJumpDir                        CallFunc_CheckCanJump_NewParam1;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyRadialDamage_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber) == 0x000008, "Wrong alignment on Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber");
static_assert(sizeof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber) == 0x000088, "Wrong size on Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, EntryPoint) == 0x000000, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::EntryPoint' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_float_Variable) == 0x000004, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_object_Variable) == 0x000008, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_byte_Variable) == 0x000018, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_float_Variable1) == 0x00001C, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_float_Variable1' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_float_Variable2) == 0x000020, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_float_Variable2' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_float_Variable3) == 0x000030, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_float_Variable3' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, Temp_int_Variable) == 0x000034, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, K2Node_DynamicCast_AsBP_Lv_3_Character_Base) == 0x000038, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::K2Node_DynamicCast_AsBP_Lv_3_Character_Base' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_CheckCanJump_Result) == 0x000041, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_CheckCanJump_Result' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_CheckCanJump_NewParam1) == 0x000042, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_CheckCanJump_NewParam1' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_IsValid_ReturnValue) == 0x000043, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, K2Node_Select_Default) == 0x000044, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Array_Get_Item) == 0x000058, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Array_RemoveItem_ReturnValue) == 0x000060, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_Subtract_IntInt_ReturnValue) == 0x00006C, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000070, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_GetSocketLocation_ReturnValue) == 0x000074, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber, CallFunc_ApplyRadialDamage_ReturnValue) == 0x000080, "Member 'Enemy_Climber_C_ExecuteUbergraph_Enemy_Climber::CallFunc_ApplyRadialDamage_ReturnValue' has a wrong offset!");

}

