#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Enemy_Climber

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BE_Lv3_ClimberJumpDir_structs.hpp"
#include "BP_Lv3_NPCBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Enemy_Climber.Enemy_Climber_C
// 0x0010 (0x08C0 - 0x08B0)
class AEnemy_Climber_C final : public ABP_Lv3_NPCBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Enemy_Climber_C;                    // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Arrived;                                           // 0x08B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ReadyJump;                                         // 0x08B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BeginJump;                                         // 0x08B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EBE_Lv3_ClimberJumpDir                        JumpDir;                                           // 0x08B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Enemy_Climber(int32 EntryPoint);
	void OnDoAttack();
	void Dead();
	void JumpToCar();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Enemy_Climber_C">();
	}
	static class AEnemy_Climber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEnemy_Climber_C>();
	}
};
static_assert(alignof(AEnemy_Climber_C) == 0x000010, "Wrong alignment on AEnemy_Climber_C");
static_assert(sizeof(AEnemy_Climber_C) == 0x0008C0, "Wrong size on AEnemy_Climber_C");
static_assert(offsetof(AEnemy_Climber_C, UberGraphFrame_Enemy_Climber_C) == 0x0008A8, "Member 'AEnemy_Climber_C::UberGraphFrame_Enemy_Climber_C' has a wrong offset!");
static_assert(offsetof(AEnemy_Climber_C, Arrived) == 0x0008B0, "Member 'AEnemy_Climber_C::Arrived' has a wrong offset!");
static_assert(offsetof(AEnemy_Climber_C, ReadyJump) == 0x0008B1, "Member 'AEnemy_Climber_C::ReadyJump' has a wrong offset!");
static_assert(offsetof(AEnemy_Climber_C, BeginJump) == 0x0008B2, "Member 'AEnemy_Climber_C::BeginJump' has a wrong offset!");
static_assert(offsetof(AEnemy_Climber_C, JumpDir) == 0x0008B3, "Member 'AEnemy_Climber_C::JumpDir' has a wrong offset!");

}

