#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_ReturnStartLocation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_ReturnStartLocation.EQS_ReturnStartLocation_C.ProvideSingleLocation
// 0x0050 (0x0050 - 0x0000)
struct EQS_ReturnStartLocation_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_NPCBase_C*                      K2Node_DynamicCast_AsBP_Lv_2_NPCBase;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_ReturnStartLocation_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_ReturnStartLocation_C_ProvideSingleLocation");
static_assert(sizeof(EQS_ReturnStartLocation_C_ProvideSingleLocation) == 0x000050, "Wrong size on EQS_ReturnStartLocation_C_ProvideSingleLocation");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, CallFunc_GetBlackboard_ReturnValue) == 0x000028, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, CallFunc_GetValueAsObject_ReturnValue) == 0x000030, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, K2Node_DynamicCast_AsBP_Lv_2_NPCBase) == 0x000038, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::K2Node_DynamicCast_AsBP_Lv_2_NPCBase' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(EQS_ReturnStartLocation_C_ProvideSingleLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000044, "Member 'EQS_ReturnStartLocation_C_ProvideSingleLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

