#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EQS_GetStartLocationContext

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EQS_GetStartLocationContext.EQS_GetStartLocationContext_C.ProvideSingleLocation
// 0x0040 (0x0040 - 0x0000)
struct EQS_GetStartLocationContext_C_ProvideSingleLocation final
{
public:
	class UObject*                                QuerierObject;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 QuerierActor;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ResultingLocation;                                 // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EQS_GetStartLocationContext_C_ProvideSingleLocation) == 0x000008, "Wrong alignment on EQS_GetStartLocationContext_C_ProvideSingleLocation");
static_assert(sizeof(EQS_GetStartLocationContext_C_ProvideSingleLocation) == 0x000040, "Wrong size on EQS_GetStartLocationContext_C_ProvideSingleLocation");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, QuerierObject) == 0x000000, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::QuerierObject' has a wrong offset!");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, QuerierActor) == 0x000008, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::QuerierActor' has a wrong offset!");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, ResultingLocation) == 0x000010, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::ResultingLocation' has a wrong offset!");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, CallFunc_MakeLiteralName_ReturnValue) == 0x000020, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, CallFunc_GetAIController_ReturnValue) == 0x000028, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(EQS_GetStartLocationContext_C_ProvideSingleLocation, CallFunc_GetValueAsVector_ReturnValue) == 0x000030, "Member 'EQS_GetStartLocationContext_C_ProvideSingleLocation::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");

}

