#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPersonHUD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FirstPersonHUD.FirstPersonHUD_C.ExecuteUbergraph_FirstPersonHUD
// 0x0044 (0x0044 - 0x0000)
struct FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevelopmentMode_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeadMountedDisplayEnabled_ReturnValue;  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SizeX;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SizeY;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue2;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD) == 0x000004, "Wrong alignment on FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD");
static_assert(sizeof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD) == 0x000044, "Wrong size on FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, EntryPoint) == 0x000000, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_IsDevelopmentMode_ReturnValue) == 0x000004, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_IsDevelopmentMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, K2Node_MakeStruct_LinearColor) == 0x000008, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_IsHeadMountedDisplayEnabled_ReturnValue) == 0x000018, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_IsHeadMountedDisplayEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, K2Node_Event_SizeX) == 0x00001C, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::K2Node_Event_SizeX' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, K2Node_Event_SizeY) == 0x000020, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::K2Node_Event_SizeY' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Divide_IntInt_ReturnValue) == 0x000024, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Divide_IntInt_ReturnValue1) == 0x000028, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Divide_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Divide_IntInt_ReturnValue2) == 0x00002C, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Divide_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Add_IntInt_ReturnValue1) == 0x000038, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x00003C, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000040, "Member 'FirstPersonHUD_C_ExecuteUbergraph_FirstPersonHUD::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");

// Function FirstPersonHUD.FirstPersonHUD_C.ReceiveDrawHUD
// 0x0008 (0x0008 - 0x0000)
struct FirstPersonHUD_C_ReceiveDrawHUD final
{
public:
	int32                                         SizeX;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SizeY;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FirstPersonHUD_C_ReceiveDrawHUD) == 0x000004, "Wrong alignment on FirstPersonHUD_C_ReceiveDrawHUD");
static_assert(sizeof(FirstPersonHUD_C_ReceiveDrawHUD) == 0x000008, "Wrong size on FirstPersonHUD_C_ReceiveDrawHUD");
static_assert(offsetof(FirstPersonHUD_C_ReceiveDrawHUD, SizeX) == 0x000000, "Member 'FirstPersonHUD_C_ReceiveDrawHUD::SizeX' has a wrong offset!");
static_assert(offsetof(FirstPersonHUD_C_ReceiveDrawHUD, SizeY) == 0x000004, "Member 'FirstPersonHUD_C_ReceiveDrawHUD::SizeY' has a wrong offset!");

}

