#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPersonHUDWidget

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FirstPersonHUDWidget.FirstPersonHUDWidget_C
// 0x0018 (0x0220 - 0x0208)
class UFirstPersonHUDWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_30;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             missonFail;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FirstPersonHUDWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void ShowDead(bool IsShow);
	void ShowMissionFail(bool _show, const class FText& _text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FirstPersonHUDWidget_C">();
	}
	static class UFirstPersonHUDWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirstPersonHUDWidget_C>();
	}
};
static_assert(alignof(UFirstPersonHUDWidget_C) == 0x000008, "Wrong alignment on UFirstPersonHUDWidget_C");
static_assert(sizeof(UFirstPersonHUDWidget_C) == 0x000220, "Wrong size on UFirstPersonHUDWidget_C");
static_assert(offsetof(UFirstPersonHUDWidget_C, UberGraphFrame) == 0x000208, "Member 'UFirstPersonHUDWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFirstPersonHUDWidget_C, Border_30) == 0x000210, "Member 'UFirstPersonHUDWidget_C::Border_30' has a wrong offset!");
static_assert(offsetof(UFirstPersonHUDWidget_C, missonFail) == 0x000218, "Member 'UFirstPersonHUDWidget_C::missonFail' has a wrong offset!");

}

