#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FirstPersonLoading

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FirstPersonLoading.FirstPersonLoading_C
// 0x0018 (0x0220 - 0x0208)
class UFirstPersonLoading_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_1;                                           // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FirstPersonLoading(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FirstPersonLoading_C">();
	}
	static class UFirstPersonLoading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFirstPersonLoading_C>();
	}
};
static_assert(alignof(UFirstPersonLoading_C) == 0x000008, "Wrong alignment on UFirstPersonLoading_C");
static_assert(sizeof(UFirstPersonLoading_C) == 0x000220, "Wrong size on UFirstPersonLoading_C");
static_assert(offsetof(UFirstPersonLoading_C, UberGraphFrame) == 0x000208, "Member 'UFirstPersonLoading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFirstPersonLoading_C, Image_1) == 0x000210, "Member 'UFirstPersonLoading_C::Image_1' has a wrong offset!");
static_assert(offsetof(UFirstPersonLoading_C, CurrentTime) == 0x000218, "Member 'UFirstPersonLoading_C::CurrentTime' has a wrong offset!");

}

