#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameOverTips

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "Enum_ControllerType_structs.hpp"
#include "Enum_Language_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameOverTips.GameOverTips_C
// 0x0078 (0x0280 - 0x0208)
class UGameOverTips_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_Tips;                                 // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_30;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_176;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0b;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1f;                                          // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_B;                                           // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_F;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ZoomIn;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_38;                                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_100;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurTips;                                           // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   curSound;                                          // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GameOverTips(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ShowZoomInTips(bool Show);
	void 自定义事件_3();
	void 自定义事件_2();
	void 自定义事件_1();
	void 自定义事件_0();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void DisplayLv2Tips(int32 TipsIndex, int32 Time);
	void SetTips(const class FText& NewParam, int32 Time);
	void HiddenLv2Tips(int32 TipsIndex);
	void DisplayCaptions(class FName SoundID, const class FString& Caption);
	void DisplayTips(class FName SoundID, const class FString& tips, int32 Time);
	void HiddenAll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameOverTips_C">();
	}
	static class UGameOverTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameOverTips_C>();
	}
};
static_assert(alignof(UGameOverTips_C) == 0x000008, "Wrong alignment on UGameOverTips_C");
static_assert(sizeof(UGameOverTips_C) == 0x000280, "Wrong size on UGameOverTips_C");
static_assert(offsetof(UGameOverTips_C, UberGraphFrame) == 0x000208, "Member 'UGameOverTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, NewAnimation_Tips) == 0x000210, "Member 'UGameOverTips_C::NewAnimation_Tips' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, NewAnimation_1) == 0x000218, "Member 'UGameOverTips_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Border_30) == 0x000220, "Member 'UGameOverTips_C::Border_30' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_176) == 0x000228, "Member 'UGameOverTips_C::Image_176' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_0b) == 0x000230, "Member 'UGameOverTips_C::Image_0b' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_1f) == 0x000238, "Member 'UGameOverTips_C::Image_1f' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_B) == 0x000240, "Member 'UGameOverTips_C::Image_B' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_F) == 0x000248, "Member 'UGameOverTips_C::Image_F' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, Image_ZoomIn) == 0x000250, "Member 'UGameOverTips_C::Image_ZoomIn' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, TextBlock_1) == 0x000258, "Member 'UGameOverTips_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, TextBlock_38) == 0x000260, "Member 'UGameOverTips_C::TextBlock_38' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, TextBlock_100) == 0x000268, "Member 'UGameOverTips_C::TextBlock_100' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, CurTips) == 0x000270, "Member 'UGameOverTips_C::CurTips' has a wrong offset!");
static_assert(offsetof(UGameOverTips_C, curSound) == 0x000278, "Member 'UGameOverTips_C::curSound' has a wrong offset!");

}

