#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGM

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGM.IGM_C
// 0x00C0 (0x02C8 - 0x0208)
class UIGM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CheckPointAnim;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main;                                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          CheckPoint;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CheckPointBox;                                     // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          Exit;                                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_46;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainBox;                                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          NO;                                                // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Pause;                                             // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          RESTART;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Restart_;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          Resuse;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          SETTING;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIGM_Button_C*                          YES;                                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnResuse;                                          // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnCheckPoint;                                      // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnRestart;                                         // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnExit;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_IGM(int32 EntryPoint);
	void CustomEvent();
	void CustomEvent_0();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__CHECKPOINT_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__EXIT_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__NO_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();
	void BndEvt__RESTART_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__RESUSE_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__YES_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void Construct();
	void UpdateTxt();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGM_C">();
	}
	static class UIGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGM_C>();
	}
};
static_assert(alignof(UIGM_C) == 0x000008, "Wrong alignment on UIGM_C");
static_assert(sizeof(UIGM_C) == 0x0002C8, "Wrong size on UIGM_C");
static_assert(offsetof(UIGM_C, UberGraphFrame) == 0x000208, "Member 'UIGM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGM_C, CheckPointAnim) == 0x000210, "Member 'UIGM_C::CheckPointAnim' has a wrong offset!");
static_assert(offsetof(UIGM_C, Main) == 0x000218, "Member 'UIGM_C::Main' has a wrong offset!");
static_assert(offsetof(UIGM_C, CheckPoint) == 0x000220, "Member 'UIGM_C::CheckPoint' has a wrong offset!");
static_assert(offsetof(UIGM_C, CheckPointBox) == 0x000228, "Member 'UIGM_C::CheckPointBox' has a wrong offset!");
static_assert(offsetof(UIGM_C, Exit) == 0x000230, "Member 'UIGM_C::Exit' has a wrong offset!");
static_assert(offsetof(UIGM_C, Image_0) == 0x000238, "Member 'UIGM_C::Image_0' has a wrong offset!");
static_assert(offsetof(UIGM_C, Image_46) == 0x000240, "Member 'UIGM_C::Image_46' has a wrong offset!");
static_assert(offsetof(UIGM_C, MainBox) == 0x000248, "Member 'UIGM_C::MainBox' has a wrong offset!");
static_assert(offsetof(UIGM_C, NO) == 0x000250, "Member 'UIGM_C::NO' has a wrong offset!");
static_assert(offsetof(UIGM_C, Pause) == 0x000258, "Member 'UIGM_C::Pause' has a wrong offset!");
static_assert(offsetof(UIGM_C, RESTART) == 0x000260, "Member 'UIGM_C::RESTART' has a wrong offset!");
static_assert(offsetof(UIGM_C, Restart_) == 0x000268, "Member 'UIGM_C::Restart_' has a wrong offset!");
static_assert(offsetof(UIGM_C, Resuse) == 0x000270, "Member 'UIGM_C::Resuse' has a wrong offset!");
static_assert(offsetof(UIGM_C, SETTING) == 0x000278, "Member 'UIGM_C::SETTING' has a wrong offset!");
static_assert(offsetof(UIGM_C, YES) == 0x000280, "Member 'UIGM_C::YES' has a wrong offset!");
static_assert(offsetof(UIGM_C, OnResuse) == 0x000288, "Member 'UIGM_C::OnResuse' has a wrong offset!");
static_assert(offsetof(UIGM_C, OnCheckPoint) == 0x000298, "Member 'UIGM_C::OnCheckPoint' has a wrong offset!");
static_assert(offsetof(UIGM_C, OnRestart) == 0x0002A8, "Member 'UIGM_C::OnRestart' has a wrong offset!");
static_assert(offsetof(UIGM_C, OnExit) == 0x0002B8, "Member 'UIGM_C::OnExit' has a wrong offset!");

}

