#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IGM_Button

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass IGM_Button.IGM_Button_C
// 0x0040 (0x0248 - 0x0208)
class UIGM_Button_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_28;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_0;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_IGM_Button(int32 EntryPoint);
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void OnInitialized();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_28_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IGM_Button_C">();
	}
	static class UIGM_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIGM_Button_C>();
	}
};
static_assert(alignof(UIGM_Button_C) == 0x000008, "Wrong alignment on UIGM_Button_C");
static_assert(sizeof(UIGM_Button_C) == 0x000248, "Wrong size on UIGM_Button_C");
static_assert(offsetof(UIGM_Button_C, UberGraphFrame) == 0x000208, "Member 'UIGM_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UIGM_Button_C, NewAnimation_1) == 0x000210, "Member 'UIGM_Button_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UIGM_Button_C, Button_28) == 0x000218, "Member 'UIGM_Button_C::Button_28' has a wrong offset!");
static_assert(offsetof(UIGM_Button_C, TextBlock_0) == 0x000220, "Member 'UIGM_Button_C::TextBlock_0' has a wrong offset!");
static_assert(offsetof(UIGM_Button_C, Text) == 0x000228, "Member 'UIGM_Button_C::Text' has a wrong offset!");
static_assert(offsetof(UIGM_Button_C, OnClicked) == 0x000238, "Member 'UIGM_Button_C::OnClicked' has a wrong offset!");

}

