#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IK_AnimBP_Evan

#include "Basic.hpp"


namespace SDK::Params
{

// Function IK_AnimBP_Evan.IK_AnimBP_Evan_C.ExecuteUbergraph_IK_AnimBP_Evan
// 0x0028 (0x0028 - 0x0000)
struct IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterPVP_Base_C*                K2Node_DynamicCast_AsBP_Character_PVP_Base;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan) == 0x000008, "Wrong alignment on IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan");
static_assert(sizeof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan) == 0x000028, "Wrong size on IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, EntryPoint) == 0x000000, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::EntryPoint' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000010, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, K2Node_DynamicCast_AsBP_Character_PVP_Base) == 0x000018, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::K2Node_DynamicCast_AsBP_Character_PVP_Base' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, CallFunc_Less_FloatFloat_ReturnValue) == 0x000021, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan, CallFunc_IsValid_ReturnValue1) == 0x000023, "Member 'IK_AnimBP_Evan_C_ExecuteUbergraph_IK_AnimBP_Evan::CallFunc_IsValid_ReturnValue1' has a wrong offset!");

// Function IK_AnimBP_Evan.IK_AnimBP_Evan_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct IK_AnimBP_Evan_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IK_AnimBP_Evan_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on IK_AnimBP_Evan_C_BlueprintUpdateAnimation");
static_assert(sizeof(IK_AnimBP_Evan_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on IK_AnimBP_Evan_C_BlueprintUpdateAnimation");
static_assert(offsetof(IK_AnimBP_Evan_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'IK_AnimBP_Evan_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

