#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IK_Carl_AnimBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function IK_Carl_AnimBP.IK_Carl_AnimBP_C.ExecuteUbergraph_IK_Carl_AnimBP
// 0x0038 (0x0038 - 0x0000)
struct IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterPVP_Base_C*                K2Node_DynamicCast_AsBP_Character_PVP_Base;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Mer2Character_VR_Man_C*             K2Node_DynamicCast_AsBP_Mer_2Character_VR_Man;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP) == 0x000008, "Wrong alignment on IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP");
static_assert(sizeof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP) == 0x000038, "Wrong size on IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, EntryPoint) == 0x000000, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, K2Node_DynamicCast_AsBP_Character_PVP_Base) == 0x000010, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::K2Node_DynamicCast_AsBP_Character_PVP_Base' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, K2Node_DynamicCast_AsBP_Mer_2Character_VR_Man) == 0x000020, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::K2Node_DynamicCast_AsBP_Mer_2Character_VR_Man' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, K2Node_DynamicCast_bSuccess1) == 0x000028, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, CallFunc_IsValid_ReturnValue1) == 0x00002A, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x00002C, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000030, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP, K2Node_Event_DeltaTimeX) == 0x000034, "Member 'IK_Carl_AnimBP_C_ExecuteUbergraph_IK_Carl_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function IK_Carl_AnimBP.IK_Carl_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct IK_Carl_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(IK_Carl_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on IK_Carl_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(IK_Carl_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on IK_Carl_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(IK_Carl_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'IK_Carl_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

