#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IK_Carl_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimIK_structs.hpp"
#include "AnimIK_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass IK_Carl_AnimBP.IK_Carl_AnimBP_C
// 0x2EC0 (0x33E0 - 0x0520)
class UIK_Carl_AnimBP_C final : public UIKAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FE0B9C184DEE21805A14FE8811F96669; // 0x0528(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2E4828AA4F4AC74B9FA94CBEF14DA24A; // 0x0568(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F075648945A4962A1F4557BB3ECA72AC; // 0x05B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B96B5EA342C41CD54827869BC3EF5AF8; // 0x05F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3FC5A1EB42C83D700373E8A8D716E960; // 0x0640(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0CCF78134BF119EC996851B40792535D; // 0x0688(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DC013C50425E5A423DA8EABB99B2345C; // 0x06D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_535FCAB2475723F8D52709BCA366BA38; // 0x0718(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_618C48B2411E0F1559650D8F27DD121A; // 0x0760(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DCF1A73041728EE33DD57BBFE58D2E32; // 0x07A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7418FD06456BC1BE4D0CFC91FC9DDB58; // 0x07F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65C207974C90A7740C059585C19D91D1; // 0x0838(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_CE922CA342EBF6D437FD1FA1C60D1396; // 0x08D8(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9D7723244886E0A47A8B23BDAE3EDB98; // 0x0918(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_205E82D24DF99F09E41BE1BC745F65B0; // 0x0A40(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_E5A6DA2540341112709ECF97827CCC19; // 0x0A80(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9B12CE784CCBD0674CAB9A9EEC3C5255; // 0x0BA8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_CB1803F541A3E1816D833B82F137B165; // 0x0BE8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1D2758784FCA0B45AFC2E787FD2D067F; // 0x0C88(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6030E06142270FFC00B67EBB2000B693; // 0x0CC8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_255CB247408E4005E74EC1B838A840C6; // 0x0D68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5F9A9B1F41208EDED4CBDE842865DDEC; // 0x0DA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40B743D14064EEF5C90D5F881141E762; // 0x0E48(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FBCFFE2F4D5212A50B8234B8B3B4501D; // 0x0E88(0x00E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_AD8D39A74237ABF4259B4C8B77FA1D66; // 0x0F68(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_FF830081419B87F3E3C5D88845159D3C; // 0x0FA8(0x0040)()
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_FullBodyIK                   AnimGraphNode_FullBodyIK_16E65E4F4711BD73EAF239A955CD7569; // 0x0FF0(0x0530)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F5DF93F648A2F1233FFD83A4A0ADE65E; // 0x1520(0x00D8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_C5C77FF640088ECE5FEDEAA922F96F87; // 0x15F8(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8AE4334F4A9D41F3A59B9AB4530A4B1B; // 0x16F0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_FE10FFD3444DE5558FF63688D81D92F5; // 0x1738(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4E59D1CF42F7AE3B1EF55C9A869865CC; // 0x1808(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7D13EC0540B0CE76EA4FBEA5C09A1B4E; // 0x1850(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FBCF3F544997DCFE2D00E091A4FB9DE1; // 0x1898(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1C61F67647CBEF5C7F8C4C82FD6326FD; // 0x18E0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0A0CF3E547A218F4C8F22F93A97E63C7; // 0x1980(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4FE955D54E6053F08FE032AA97DEC61A; // 0x19C0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1E328BC14521FFFC577980B91DB6B2A3; // 0x1A60(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E414F8E74F7C68AC7743E899424B2F1E; // 0x1AA0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B22FF4CE4560C9674295DB82C346AD90; // 0x1B40(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1B70852A47B3B451B2AA388D3E7A5CC6; // 0x1B80(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_836653CF4A76D9442A900BB4DDFE3406; // 0x1C60(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7E7715F449F907CF292E40A11D3740FD; // 0x1CA8(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_58B03FF644D45FB094B2B9ACE7A85A8F; // 0x1D88(0x00D8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_47F72DBA46C1FF909BD9ACA2B9D96E94; // 0x1E60(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9B00E3714C63B5D26190448287F635FA; // 0x1F38(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_D1E5B6F847F4090DE1072EB0008AE193; // 0x1F80(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8CC18F6E48B852047BDD9BB6AE4B3E0E; // 0x2060(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_508B09054898772F219ACC9ED35DA83F; // 0x20A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118FBA3C482F4B9FFADD44AA37A94CD0; // 0x20F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A571EE4F440EC45A9B27269312A1B5D0; // 0x2138(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4DD8F65A432C33F24E57C28D9C02C012; // 0x21D8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E30086A04B75359B948EF193882F6DE3; // 0x2218(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4A25EC6F4EE7C03160045CB7EB5E3288; // 0x22B8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B2BA757349725784A97392A665C5387D; // 0x22F8(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DC1D318348443CCBC86C64A3D9C2B940; // 0x23D8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31F7D5A348E7FF6509DD2DA6705DE1C8; // 0x2420(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9D09D28C49E1AB3E0B30A793087306DE; // 0x2468(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_543E1AED47F2AACFF914688FE55AD47B; // 0x2508(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A0CEA0D345186BD4CBDB94BBA2960615; // 0x2548(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20BB5D634BF8D17138B1249FF84BE9EE; // 0x25E8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D0FEDAE24C04FC225DF9AEA948EE4624; // 0x2628(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0AC8D0EE479335193DD19EA81E928511; // 0x2708(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6C394B6B41FA43B8ECC5A997FBD31EA8; // 0x2750(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B0370ED54AA162ACC1AAA7B7F250FEFC; // 0x2798(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0C90F4F84D86931CA1E0DBA4F8F5BCFE; // 0x2838(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3B38B53B4B25D2822CFA83A8F6193AD3; // 0x2878(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21CD2E9C43C4DDAD20E5DCA6A1BE93CA; // 0x2918(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_70AAD51B487E7EF6AD2EDCB633A5E333; // 0x2958(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8054A8C545257CF1EEF0A18D4874D74C; // 0x2A38(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B3954822427DAA045D8B59A4022DBB17; // 0x2A80(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0485220741BAACEB1EBFCF87CF7A175C; // 0x2AC8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_770F49E24805086BFE929AB968389AF3; // 0x2B68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_902837034E868DA0328284B7482CAC8B; // 0x2BA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_BF290564458A1E98FE6040BFF6DBC9D6; // 0x2C48(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C513A0FD4E4AAEE3609BCDB69268A385; // 0x2C88(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16028B824DF6D9A5B360BE8254CF6BA1; // 0x2D68(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1EA9AF2F4A1590EE2DFDACB5B465DE2B; // 0x2DB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1943C72746BE34EEA730299B057ADA25; // 0x2DF8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8BEC46DA4C318158E1776584C97A9372; // 0x2E98(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_90A5571A4FE506901FA431AD0628FD2A; // 0x2ED8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B08EEEFD4F769915141505AEF1A52186; // 0x2F78(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_0247190448C33120FAF57E924B82DFB9; // 0x2FB8(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5A7658D642241376508001B6FC315227; // 0x3098(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7FC2B01742D19D7B847609BA8C3455F6; // 0x30E0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60DE154F4C2E02D172946BB4D33CAAA5; // 0x3128(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40C8D4F147BD2BB3195723A6415E1B3E; // 0x31C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA5B4C5C430BD19795A1DE898C40411C; // 0x3208(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3C23C3644B1F609D034DC78D18DD419E; // 0x32A8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D2443C77454AC29616B90296518B1E85; // 0x32E8(0x00E0)()
	float                                         HeadRotatorSpeed;                                  // 0x33C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTriggerRight;                                    // 0x33CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTriggerLeft;                                     // 0x33CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EItemTypes                                    RightHandType;                                     // 0x33CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    LeftHandType;                                      // 0x33CF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAIControlled;                                    // 0x33D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCrouch;                                          // 0x33D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D2[0x6];                                     // 0x33D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletonMesh;                                      // 0x33D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IK_Carl_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_IK_Carl_AnimBP_AnimGraphNode_TransitionResult_7D13EC0540B0CE76EA4FBEA5C09A1B4E();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IK_Carl_AnimBP_C">();
	}
	static class UIK_Carl_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIK_Carl_AnimBP_C>();
	}
};
static_assert(alignof(UIK_Carl_AnimBP_C) == 0x000010, "Wrong alignment on UIK_Carl_AnimBP_C");
static_assert(sizeof(UIK_Carl_AnimBP_C) == 0x0033E0, "Wrong size on UIK_Carl_AnimBP_C");
static_assert(offsetof(UIK_Carl_AnimBP_C, UberGraphFrame) == 0x000520, "Member 'UIK_Carl_AnimBP_C::UberGraphFrame' has a wrong offset!");
