#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IK_Leonard_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimIK_structs.hpp"
#include "AnimIK_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass IK_Leonard_AnimBP.IK_Leonard_AnimBP_C
// 0x2EC0 (0x33E0 - 0x0520)
class UIK_Leonard_AnimBP_C final : public UIKAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_3AFA70AF46A4AFF7AD1959BB6BC4E2C6; // 0x0528(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B408AB8C462594FC72058497C0ACE558; // 0x0568(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FB4DC9574B7B69EDE377FF9CA5206A54; // 0x05B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_754E13C8481D9DCB4F1BA39621D46B22; // 0x05F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_922176D649D065BDFCD02EA0BE471184; // 0x0640(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3B53B3D44726B2940025CBB72C5B1922; // 0x0688(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_717EADE34F2AE3E4E3DF51BC4DDC6FC6; // 0x06D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DD35C6934D6980D2A7E80088A45C5E7B; // 0x0718(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7849478445D162AD25FF04AB95626637; // 0x0760(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9E7B70E44920A1E73FA4E59D91A6FC43; // 0x07A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0CA3514849A018319038ADAB63305CBC; // 0x07F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F0ACC4D54E57901E94BFD69B194F4FF0; // 0x0838(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4B7B47904D7BACCBFDE035B74D2BB640; // 0x08D8(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_716EFA84454FFD3C70D381A5CD6A9A21; // 0x0918(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5B54736E497995C346F3D68DA9E03E21; // 0x0A40(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_05992A0D4F8BFF925CAD6DA8A4CC2AD2; // 0x0A80(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1BE412374C03362348548E836E4279E9; // 0x0BA8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_389CECEC4D77CF84C1D53F9D79DFDA36; // 0x0BE8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7F4BB95B41294E36A009F99A92DA0DE9; // 0x0C88(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50FF0B894B88AB8B28C8C7B59DDDA10F; // 0x0CC8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64F5DC644720E9FEC95005B67BE3CAA1; // 0x0D68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ADCEF8374FFE66DCE9F6E296DD06F1BD; // 0x0DA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8E87C76E45322A8774629BBBFC94CFDB; // 0x0E48(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_578F5F2E4C9D7E2ECCB6809290E7020B; // 0x0E88(0x00E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4B94727B4B0ED471E781FE8F63C56E08; // 0x0F68(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2E5FDBCB4D4E64A926B5FBA562AEB4CD; // 0x0FA8(0x0040)()
	uint8                                         Pad_FE8[0x8];                                      // 0x0FE8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_FullBodyIK                   AnimGraphNode_FullBodyIK_0039534F420370C2203F33961AEB27C4; // 0x0FF0(0x0530)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_D723C62C4D392A28B46EB48E4AE8CC80; // 0x1520(0x00D8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_07F87F504A4A9F107E375D9FC7E733BC; // 0x15F8(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5A981CFD488483DCB848BAA9E3EFF0C1; // 0x16F0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0D290DD040F5B06EAAA667B5532A1982; // 0x1738(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_161D97F5459A163B9F23CF9C59D21A46; // 0x1780(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_CA49D6414565B137EA7C17BC0866644D; // 0x1860(0x00D8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_F264FA2846D2FAADBD3C42B15BA05C4B; // 0x1938(0x00D8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8C4FFB67413F920827A84E80C7226234; // 0x1A10(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_7017AB28420DAAD45B33C09BF3B35E58; // 0x1A58(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_AFE88C9D47EFC51EA481C7A0DB4AD1DA; // 0x1B38(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B542B36A4822C871DB3CCDB389BFF25D; // 0x1B80(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3B06E9A047B27CDA1F67F98438358F23; // 0x1BC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4AF2F88B484A003B6093C6810730F51E; // 0x1C10(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EFC5EB574FAA0BD721F67AAA1AB776BB; // 0x1CB0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E02880004EE7090FCB5C05B127C6B98B; // 0x1CF0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E902E40B408DE74ACE882A98B6FE1822; // 0x1D90(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_43A148924EA071BFB58782933F8D924B; // 0x1DD0(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CF8999774E2B7B3B421B3E90A69F8CFD; // 0x1EB0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_02B6D97E48B25C5BF643F09AADC61E41; // 0x1EF8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_926EC46D4192DAC6D77ACA8FC0A12EF4; // 0x1F40(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_329AF6CE4EBD565F39BCA493FBC22494; // 0x1FE0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DE5F624548896A015B7A2E9ECA06D727; // 0x2020(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0B22D64448832ADD970A62A8693056B2; // 0x20C0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C7C68BD843C36002A8923286E079683B; // 0x2100(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3D70DC0A4437DB9BF9137A978F5D74A4; // 0x21E0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93A7041A48C664DBBE1FCB9DE6D655FD; // 0x2228(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E76261754C1122D53250A6B5C0F82B6D; // 0x2270(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_EF6313C0425226CEE454D29997E1339D; // 0x2310(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06CD7BF34AC6FB7C4C0DC88ACCD41310; // 0x2350(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6F67C00A443F049625FABCBB5FAF9DC4; // 0x23F0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4882AEC0480E36D4C9B907B0576BCD56; // 0x2430(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0A4C8AA440677B7AE88B9F98CE9434D9; // 0x2510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_258A3ADC48E0E5BC929FF38DF8EA82D4; // 0x2558(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F13FA2224A97462D116D7297D061F4F8; // 0x25A0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2B2CAAC24C235ED570EB44BB729CD36E; // 0x2640(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C7EB1F2F40F6B2DC4E1F399FBB11EAF1; // 0x2680(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8EB5950642075C054B7D5EB383156973; // 0x2720(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B04F2783471ABE1309D26BBBC67129B6; // 0x2760(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2BAA86AD49665AA558120B81E1BCE539; // 0x2840(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8778D8194F68744F45BADDBB7894EF63; // 0x2888(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F99D8BCF4F928275FE86538EC95442E0; // 0x28D0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_599785F84FCEF64FE1930BA990F3AA6A; // 0x2970(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7104B9B04FC69A0C06D5878A16CEF9C4; // 0x29B0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A318A1B749773D7A75D11699CAB48DA0; // 0x2A50(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_CC4495A743AC1CB034AA41AF4666C4DF; // 0x2A90(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42C94CB247348224774B008C7991A0DA; // 0x2B70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86B01FFA4B024A4994807A926A87E5C7; // 0x2BB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9B4FE02F4CEC5867CA497E8040EE3A6E; // 0x2C00(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_AFDCBF2A482C30437E1A4A8B34942014; // 0x2CA0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B8223CCA4F23D6CF42CD86B30DDE9516; // 0x2CE0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26CD5A6C44AD3CA49C4D18859EFC9B16; // 0x2D80(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_F663CEDE41EC9FBB6E35F4982B286EAE; // 0x2DC0(0x00E0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_D4C974FA4A6C04DE2CE17D998EFD04D5; // 0x2EA0(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B1AC99F4410868BBDCBBF4A65FE42B8B; // 0x2F70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10FDEC594A71DCB4237F2580AC97BE5D; // 0x2FB8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_412FECBD43F807345AF9B39239C9AD2D; // 0x3000(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C9CD124245807E96BC3674B1BEC59B6E; // 0x3048(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E08E98EF48E81822637AB5B44E5F04FE; // 0x30E8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_733F171D4F9FB8B4DDF69A9823008458; // 0x3128(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6BB6F7414F2D32B88A5649AD7C347882; // 0x31C8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_06DA856C498D5CE6DCC10EBB4AC4C854; // 0x3208(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4063A16249F3ED759F0557A24D83642F; // 0x32A8(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E36FFF524248112DEB56E4A7704D2AF0; // 0x32E8(0x00E0)()
	float                                         HeadRotatorSpeed;                                  // 0x33C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTriggerRight;                                    // 0x33CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTriggerLeft;                                     // 0x33CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAIControlled;                                    // 0x33CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCrouch;                                          // 0x33CF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EItemTypes                                    RightHandType;                                     // 0x33D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    LeftHandType;                                      // 0x33D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_IK_Leonard_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_IK_Leonard_AnimBP_AnimGraphNode_TransitionResult_10FDEC594A71DCB4237F2580AC97BE5D();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IK_Leonard_AnimBP_C">();
	}
	static class UIK_Leonard_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIK_Leonard_AnimBP_C>();
	}
};
static_assert(alignof(UIK_Leonard_AnimBP_C) == 0x000010, "Wrong alignment on UIK_Leonard_AnimBP_C");
static_assert(sizeof(UIK_Leonard_AnimBP_C) == 0x0033E0, "Wrong size on UIK_Leonard_AnimBP_C");
static_assert(offsetof(UIK_Leonard_AnimBP_C, UberGraphFrame) == 0x000520, "Member 'UIK_Leonard_AnimBP_C::UberGraphFrame' has a wrong offset!");
