#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: languageMenu

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass languageMenu.languageMenu_C
// 0x0020 (0x0228 - 0x0208)
class UlanguageMenu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                chineseButton;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                EnglishButton;                                     // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_languageMenu(int32 EntryPoint);
	void BndEvt__chineseButton_K2Node_ComponentBoundEvent_471_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__EnglishButton_K2Node_ComponentBoundEvent_489_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"languageMenu_C">();
	}
	static class UlanguageMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UlanguageMenu_C>();
	}
};
static_assert(alignof(UlanguageMenu_C) == 0x000008, "Wrong alignment on UlanguageMenu_C");
static_assert(sizeof(UlanguageMenu_C) == 0x000228, "Wrong size on UlanguageMenu_C");
static_assert(offsetof(UlanguageMenu_C, UberGraphFrame) == 0x000208, "Member 'UlanguageMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UlanguageMenu_C, chineseButton) == 0x000210, "Member 'UlanguageMenu_C::chineseButton' has a wrong offset!");
static_assert(offsetof(UlanguageMenu_C, EnglishButton) == 0x000218, "Member 'UlanguageMenu_C::EnglishButton' has a wrong offset!");
static_assert(offsetof(UlanguageMenu_C, Image_0) == 0x000220, "Member 'UlanguageMenu_C::Image_0' has a wrong offset!");

}

