#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: leaderboardButton

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass leaderboardButton.leaderboardButton_C
// 0x0020 (0x0228 - 0x0208)
class UleaderboardButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 bg;                                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                leaderboardButton;                                 // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABPMainMenu_C*                          parenterActor;                                     // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_leaderboardButton(int32 EntryPoint);
	void BndEvt__leaderboardButton_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"leaderboardButton_C">();
	}
	static class UleaderboardButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UleaderboardButton_C>();
	}
};
static_assert(alignof(UleaderboardButton_C) == 0x000008, "Wrong alignment on UleaderboardButton_C");
static_assert(sizeof(UleaderboardButton_C) == 0x000228, "Wrong size on UleaderboardButton_C");
static_assert(offsetof(UleaderboardButton_C, UberGraphFrame) == 0x000208, "Member 'UleaderboardButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UleaderboardButton_C, bg) == 0x000210, "Member 'UleaderboardButton_C::bg' has a wrong offset!");
static_assert(offsetof(UleaderboardButton_C, leaderboardButton) == 0x000218, "Member 'UleaderboardButton_C::leaderboardButton' has a wrong offset!");
static_assert(offsetof(UleaderboardButton_C, parenterActor) == 0x000220, "Member 'UleaderboardButton_C::parenterActor' has a wrong offset!");

}

