#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboadData_Score

#include "Basic.hpp"

#include "EnumSDKType_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaderboadData_Score.LeaderboadData_Score_C
// 0x0060 (0x0268 - 0x0208)
class ULeaderboadData_Score_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 back;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeadImg;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             rank;                                              // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Score;                                             // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Pading1;                                           // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pading2;                                           // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pading3;                                           // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pading4;                                           // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SizeBack;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 HeadUrl;                                           // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Retry;                                             // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LeaderboadData_Score(int32 EntryPoint);
	void UpdateInfo(const class FString& UserID, const class FString& rank_0, const class FString& HeadUrl_0, const class FString& nickName, const class FString& Score_0, bool IsShowBack);
	void UpdateSetting();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnFail_95801C0C4490FEF7F5F4AA857EF70C3C(class UTexture2DDynamic* Texture);
	void OnSuccess_95801C0C4490FEF7F5F4AA857EF70C3C(class UTexture2DDynamic* Texture);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaderboadData_Score_C">();
	}
	static class ULeaderboadData_Score_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaderboadData_Score_C>();
	}
};
static_assert(alignof(ULeaderboadData_Score_C) == 0x000008, "Wrong alignment on ULeaderboadData_Score_C");
static_assert(sizeof(ULeaderboadData_Score_C) == 0x000268, "Wrong size on ULeaderboadData_Score_C");
static_assert(offsetof(ULeaderboadData_Score_C, UberGraphFrame) == 0x000208, "Member 'ULeaderboadData_Score_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, back) == 0x000210, "Member 'ULeaderboadData_Score_C::back' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, HeadImg) == 0x000218, "Member 'ULeaderboadData_Score_C::HeadImg' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Name_0) == 0x000220, "Member 'ULeaderboadData_Score_C::Name_0' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, rank) == 0x000228, "Member 'ULeaderboadData_Score_C::rank' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Score) == 0x000230, "Member 'ULeaderboadData_Score_C::Score' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Pading1) == 0x000238, "Member 'ULeaderboadData_Score_C::Pading1' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Pading2) == 0x00023C, "Member 'ULeaderboadData_Score_C::Pading2' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Pading3) == 0x000240, "Member 'ULeaderboadData_Score_C::Pading3' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Pading4) == 0x000244, "Member 'ULeaderboadData_Score_C::Pading4' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, SizeBack) == 0x000248, "Member 'ULeaderboadData_Score_C::SizeBack' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, HeadUrl) == 0x000250, "Member 'ULeaderboadData_Score_C::HeadUrl' has a wrong offset!");
static_assert(offsetof(ULeaderboadData_Score_C, Retry) == 0x000260, "Member 'ULeaderboadData_Score_C::Retry' has a wrong offset!");

}

