#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboadData_Spectator

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnumSDKType_structs.hpp"


namespace SDK::Params
{

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.ExecuteUbergraph_LeaderboadData_Spectator
// 0x0288 (0x0288 - 0x0000)
struct LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate;          // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture1;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2DDynamic*                      K2Node_CustomEvent_Texture;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UTexture2DDynamic* Texture)> K2Node_CreateDelegate_OutputDelegate1;         // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UTexture2DDynamic*                      Temp_object_Variable;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue1;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue1;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue1;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue2;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue2;            // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue2;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue3;              // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X2;                         // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y2;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue4;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue5;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue6;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue2;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue7;              // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue8;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue3;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue9;              // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue10;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue4;            // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue11;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue3;                // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue4;                // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_UserID;                         // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Rank;                           // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_HeadUrl;                        // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NickName;                       // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Score;                          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsShowBack;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x01B8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x01D0(0x0018)()
	class UAsyncTaskDownloadImage*                CallFunc_DownloadImage_ReturnValue;                // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x01F0(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumSDKType                                   CallFunc_GetSDKType_SDKType;                       // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x1];                                      // 0x027B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator) == 0x000008, "Wrong alignment on LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator");
static_assert(sizeof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator) == 0x000288, "Wrong size on LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, EntryPoint) == 0x000000, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_Texture1) == 0x000020, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_Texture1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_Texture) == 0x000028, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CreateDelegate_OutputDelegate1) == 0x000030, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, Temp_object_Variable) == 0x000040, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, Temp_int_Variable) == 0x000048, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_Event_IsDesignTime) == 0x00004C, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_Event_MyGeometry) == 0x000050, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_Event_InDeltaTime) == 0x000088, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000090, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_MakeVector2D_ReturnValue) == 0x000098, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_GetSize_ReturnValue) == 0x0000A0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_X) == 0x0000A8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_Y) == 0x0000AC, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000B0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue1) == 0x0000B4, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_SlotAsCanvasSlot_ReturnValue1) == 0x0000B8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_SlotAsCanvasSlot_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_MakeVector2D_ReturnValue1) == 0x0000C0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_MakeVector2D_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_GetSize_ReturnValue1) == 0x0000C8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_GetSize_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_X1) == 0x0000D0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_Y1) == 0x0000D4, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue2) == 0x0000D8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_SlotAsCanvasSlot_ReturnValue2) == 0x0000E0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_SlotAsCanvasSlot_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_GetSize_ReturnValue2) == 0x0000E8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_GetSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue3) == 0x0000F0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_X2) == 0x0000F4, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_X2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_BreakVector2D_Y2) == 0x0000F8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_BreakVector2D_Y2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue4) == 0x0000FC, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue5) == 0x000100, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue6) == 0x000104, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_MakeVector2D_ReturnValue2) == 0x000108, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_MakeVector2D_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue7) == 0x000110, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue8) == 0x000114, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue8' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_SlotAsCanvasSlot_ReturnValue3) == 0x000118, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_SlotAsCanvasSlot_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue9) == 0x000120, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue9' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue10) == 0x000124, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue10' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_SlotAsCanvasSlot_ReturnValue4) == 0x000128, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_SlotAsCanvasSlot_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Add_FloatFloat_ReturnValue11) == 0x000130, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Add_FloatFloat_ReturnValue11' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_MakeVector2D_ReturnValue3) == 0x000134, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_MakeVector2D_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_MakeVector2D_ReturnValue4) == 0x00013C, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_MakeVector2D_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_UserID) == 0x000148, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_UserID' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_Rank) == 0x000158, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_Rank' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_HeadUrl) == 0x000168, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_HeadUrl' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_NickName) == 0x000178, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_NickName' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_Score) == 0x000188, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_Score' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_CustomEvent_IsShowBack) == 0x000198, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_CustomEvent_IsShowBack' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Conv_StringToText_ReturnValue) == 0x0001A0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Conv_StringToText_ReturnValue1) == 0x0001B8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Conv_StringToText_ReturnValue2) == 0x0001D0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Conv_StringToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_DownloadImage_ReturnValue) == 0x0001E8, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_DownloadImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_MakeStruct_SlateBrush) == 0x0001F0, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_IsValid_ReturnValue) == 0x000278, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_GetSDKType_SDKType) == 0x000279, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_GetSDKType_SDKType' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, K2Node_SwitchEnum_CmpSuccess) == 0x00027A, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Len_ReturnValue) == 0x00027C, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator, CallFunc_Greater_IntInt_ReturnValue) == 0x000280, "Member 'LeaderboadData_Spectator_C_ExecuteUbergraph_LeaderboadData_Spectator::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.UpdateInfo
// 0x0058 (0x0058 - 0x0000)
struct LeaderboadData_Spectator_C_UpdateInfo final
{
public:
	class FString                                 UserID;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 rank_0;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 HeadUrl_0;                                         // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 nickName;                                          // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Score_0;                                           // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsShowBack;                                        // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaderboadData_Spectator_C_UpdateInfo) == 0x000008, "Wrong alignment on LeaderboadData_Spectator_C_UpdateInfo");
static_assert(sizeof(LeaderboadData_Spectator_C_UpdateInfo) == 0x000058, "Wrong size on LeaderboadData_Spectator_C_UpdateInfo");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, UserID) == 0x000000, "Member 'LeaderboadData_Spectator_C_UpdateInfo::UserID' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, rank_0) == 0x000010, "Member 'LeaderboadData_Spectator_C_UpdateInfo::rank_0' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, HeadUrl_0) == 0x000020, "Member 'LeaderboadData_Spectator_C_UpdateInfo::HeadUrl_0' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, nickName) == 0x000030, "Member 'LeaderboadData_Spectator_C_UpdateInfo::nickName' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, Score_0) == 0x000040, "Member 'LeaderboadData_Spectator_C_UpdateInfo::Score_0' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_UpdateInfo, IsShowBack) == 0x000050, "Member 'LeaderboadData_Spectator_C_UpdateInfo::IsShowBack' has a wrong offset!");

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.Tick
// 0x003C (0x003C - 0x0000)
struct LeaderboadData_Spectator_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboadData_Spectator_C_Tick) == 0x000004, "Wrong alignment on LeaderboadData_Spectator_C_Tick");
static_assert(sizeof(LeaderboadData_Spectator_C_Tick) == 0x00003C, "Wrong size on LeaderboadData_Spectator_C_Tick");
static_assert(offsetof(LeaderboadData_Spectator_C_Tick, MyGeometry) == 0x000000, "Member 'LeaderboadData_Spectator_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(LeaderboadData_Spectator_C_Tick, InDeltaTime) == 0x000038, "Member 'LeaderboadData_Spectator_C_Tick::InDeltaTime' has a wrong offset!");

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LeaderboadData_Spectator_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaderboadData_Spectator_C_PreConstruct) == 0x000001, "Wrong alignment on LeaderboadData_Spectator_C_PreConstruct");
static_assert(sizeof(LeaderboadData_Spectator_C_PreConstruct) == 0x000001, "Wrong size on LeaderboadData_Spectator_C_PreConstruct");
static_assert(offsetof(LeaderboadData_Spectator_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LeaderboadData_Spectator_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.OnFail_6444FD9E455C85E78C2307AE6FD5860A
// 0x0008 (0x0008 - 0x0000)
struct LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A) == 0x000008, "Wrong alignment on LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A");
static_assert(sizeof(LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A) == 0x000008, "Wrong size on LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A");
static_assert(offsetof(LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A, Texture) == 0x000000, "Member 'LeaderboadData_Spectator_C_OnFail_6444FD9E455C85E78C2307AE6FD5860A::Texture' has a wrong offset!");

// Function LeaderboadData_Spectator.LeaderboadData_Spectator_C.OnSuccess_6444FD9E455C85E78C2307AE6FD5860A
// 0x0008 (0x0008 - 0x0000)
struct LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A final
{
public:
	class UTexture2DDynamic*                      Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A) == 0x000008, "Wrong alignment on LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A");
static_assert(sizeof(LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A) == 0x000008, "Wrong size on LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A");
static_assert(offsetof(LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A, Texture) == 0x000000, "Member 'LeaderboadData_Spectator_C_OnSuccess_6444FD9E455C85E78C2307AE6FD5860A::Texture' has a wrong offset!");

}

