#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeaderboardMM

#include "Basic.hpp"

#include "SiliconRising_structs.hpp"


namespace SDK::Params
{

// Function LeaderboardMM.LeaderboardMM_C.ExecuteUbergraph_LeaderboardMM
// 0x0028 (0x0028 - 0x0000)
struct LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue1;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM) == 0x000004, "Wrong alignment on LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM");
static_assert(sizeof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM) == 0x000028, "Wrong size on LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, EntryPoint) == 0x000000, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::EntryPoint' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue) == 0x000004, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue1) == 0x000008, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue2) == 0x00000C, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue3) == 0x000010, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue4) == 0x000014, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue5) == 0x000018, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue6) == 0x00001C, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue7) == 0x000020, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM, CallFunc_Array_Add_ReturnValue8) == 0x000024, "Member 'LeaderboardMM_C_ExecuteUbergraph_LeaderboardMM::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");

// Function LeaderboardMM.LeaderboardMM_C.SetPlayerInfo
// 0x0108 (0x0108 - 0x0000)
struct LeaderboardMM_C_SetPlayerInfo final
{
public:
	TArray<struct FLeaderBoardData>               _array;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         MaxLine;                                           // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLeaderBoardData                       CallFunc_Array_Get_Item;                           // 0x0030(0x0058)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x00A0(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInfoMM_C*                        CallFunc_Array_Get_Item1;                          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerInfoMM_C*                        CallFunc_Array_Get_Item2;                          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x2];                                       // 0x00FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LeaderboardMM_C_SetPlayerInfo) == 0x000008, "Wrong alignment on LeaderboardMM_C_SetPlayerInfo");
static_assert(sizeof(LeaderboardMM_C_SetPlayerInfo) == 0x000108, "Wrong size on LeaderboardMM_C_SetPlayerInfo");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, _array) == 0x000000, "Member 'LeaderboardMM_C_SetPlayerInfo::_array' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, MaxLine) == 0x000010, "Member 'LeaderboardMM_C_SetPlayerInfo::MaxLine' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, Temp_int_Array_Index_Variable) == 0x000014, "Member 'LeaderboardMM_C_SetPlayerInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'LeaderboardMM_C_SetPlayerInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, Temp_int_Array_Index_Variable1) == 0x000028, "Member 'LeaderboardMM_C_SetPlayerInfo::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Get_Item) == 0x000030, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Conv_StringToText_ReturnValue1) == 0x0000A0, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Conv_StringToInt_ReturnValue) == 0x0000B8, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C0, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, Temp_int_Loop_Counter_Variable1) == 0x0000D8, "Member 'LeaderboardMM_C_SetPlayerInfo::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Get_Item1) == 0x0000E0, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Get_Item2) == 0x0000E8, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Length_ReturnValue1) == 0x0000F0, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Array_Length_ReturnValue2) == 0x0000F4, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Less_IntInt_ReturnValue1) == 0x0000F8, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Less_IntInt_ReturnValue2) == 0x0000F9, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Add_IntInt_ReturnValue1) == 0x0000FC, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(LeaderboardMM_C_SetPlayerInfo, CallFunc_Greater_IntInt_ReturnValue) == 0x000100, "Member 'LeaderboardMM_C_SetPlayerInfo::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

