#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LeftClipNumber

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeftClipNumber.LeftClipNumber_C
// 0x0018 (0x0220 - 0x0208)
class ULeftClipNumber_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             LeftClipNumber;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ClipNumber;                                        // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInfinity;                                        // 0x021C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LeftClipNumber(int32 EntryPoint);
	void SetInfinity(bool Infinity);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeftClipNumber_C">();
	}
	static class ULeftClipNumber_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeftClipNumber_C>();
	}
};
static_assert(alignof(ULeftClipNumber_C) == 0x000008, "Wrong alignment on ULeftClipNumber_C");
static_assert(sizeof(ULeftClipNumber_C) == 0x000220, "Wrong size on ULeftClipNumber_C");
static_assert(offsetof(ULeftClipNumber_C, UberGraphFrame) == 0x000208, "Member 'ULeftClipNumber_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULeftClipNumber_C, LeftClipNumber) == 0x000210, "Member 'ULeftClipNumber_C::LeftClipNumber' has a wrong offset!");
static_assert(offsetof(ULeftClipNumber_C, ClipNumber) == 0x000218, "Member 'ULeftClipNumber_C::ClipNumber' has a wrong offset!");
static_assert(offsetof(ULeftClipNumber_C, IsInfinity) == 0x00021C, "Member 'ULeftClipNumber_C::IsInfinity' has a wrong offset!");

}

