#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LogoActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HttpWebBase_classes.hpp"
#include "Enum_ControllerType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LogoActor.LogoActor_C
// 0x0058 (0x04B8 - 0x0460)
class ALogoActor_C final : public ABP_HttpWebBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_LogoActor_C;                        // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMediaSoundComponent*                   MediaSound;                                        // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLogin;                                           // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnglish;                                         // 0x0481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_482[0x6];                                      // 0x0482(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABPViveportApi_C*                       ViveportSDK;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSDKOK;                                           // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MsgInterupted;                                     // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UMer2Score_C*                           SaveScore;                                         // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LogoActor(int32 EntryPoint);
	void CustomEvent_1(bool Success);
	void CustomEvent(bool Success);
	void CustomEvent_0();
	void ReceiveBeginPlay();
	void CustomEvent_3(bool Success);
	void OnGetUserData();
	void CustomEvent_2(bool Success);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LogoActor_C">();
	}
	static class ALogoActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALogoActor_C>();
	}
};
static_assert(alignof(ALogoActor_C) == 0x000008, "Wrong alignment on ALogoActor_C");
static_assert(sizeof(ALogoActor_C) == 0x0004B8, "Wrong size on ALogoActor_C");
static_assert(offsetof(ALogoActor_C, UberGraphFrame_LogoActor_C) == 0x000460, "Member 'ALogoActor_C::UberGraphFrame_LogoActor_C' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, MediaSound) == 0x000468, "Member 'ALogoActor_C::MediaSound' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, Plane) == 0x000470, "Member 'ALogoActor_C::Plane' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, Widget) == 0x000478, "Member 'ALogoActor_C::Widget' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, IsLogin) == 0x000480, "Member 'ALogoActor_C::IsLogin' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, IsEnglish) == 0x000481, "Member 'ALogoActor_C::IsEnglish' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, ViveportSDK) == 0x000488, "Member 'ALogoActor_C::ViveportSDK' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, IsSDKOK) == 0x000490, "Member 'ALogoActor_C::IsSDKOK' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, MsgInterupted) == 0x000498, "Member 'ALogoActor_C::MsgInterupted' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, SaveScore) == 0x0004A8, "Member 'ALogoActor_C::SaveScore' has a wrong offset!");
static_assert(offsetof(ALogoActor_C, MediaPlayer) == 0x0004B0, "Member 'ALogoActor_C::MediaPlayer' has a wrong offset!");

}

