#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv2_DifficultStruct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Lv2-DifficultStruct.Lv2-DifficultStruct
// 0x0038 (0x0038 - 0x0000)
struct FLv2_DifficultStruct final
{
public:
	float                                         AlertTime_6_B7FC27AA4FE1079882D1F2B433DEC629;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicsAsset*                          HeadRadio_7_F7028238452CE98FBFE581AD6327F35B;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NPCMaxHp_32_0CAB8970489A5DA986F773BF099FF8A5;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerBulletNum_22_3D5C7AD84E79418490D9DD879FEB00E7; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitGiaRateX_26_7C57A7914471064C7F4B2C84DDE2A912;   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitGiaRatey_31_226C6BAC4A9E77FA6DF9F4A2B36EFFD5;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SniperAttackRate_28_E4BAFD42452F8E1E6E23729C437C94D1; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SniperDamage_29_9A8170A7495222212778D1A93CEBD27B;  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SniperBulletSpeed_30_25E09B394B5381DE6A8F07A5911DE2AD; // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CopsShowTimeRate_35_B9D45F2D4BECB3A73DB8AE84F7147421; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AlertTriggerTimeRate_37_ACD38C13490C3F6BC51192976EC4EC1D; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FLv2_DifficultStruct) == 0x000008, "Wrong alignment on FLv2_DifficultStruct");
static_assert(sizeof(FLv2_DifficultStruct) == 0x000038, "Wrong size on FLv2_DifficultStruct");
static_assert(offsetof(FLv2_DifficultStruct, AlertTime_6_B7FC27AA4FE1079882D1F2B433DEC629) == 0x000000, "Member 'FLv2_DifficultStruct::AlertTime_6_B7FC27AA4FE1079882D1F2B433DEC629' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, HeadRadio_7_F7028238452CE98FBFE581AD6327F35B) == 0x000008, "Member 'FLv2_DifficultStruct::HeadRadio_7_F7028238452CE98FBFE581AD6327F35B' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, NPCMaxHp_32_0CAB8970489A5DA986F773BF099FF8A5) == 0x000010, "Member 'FLv2_DifficultStruct::NPCMaxHp_32_0CAB8970489A5DA986F773BF099FF8A5' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, PlayerBulletNum_22_3D5C7AD84E79418490D9DD879FEB00E7) == 0x000014, "Member 'FLv2_DifficultStruct::PlayerBulletNum_22_3D5C7AD84E79418490D9DD879FEB00E7' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, HitGiaRateX_26_7C57A7914471064C7F4B2C84DDE2A912) == 0x000018, "Member 'FLv2_DifficultStruct::HitGiaRateX_26_7C57A7914471064C7F4B2C84DDE2A912' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, HitGiaRatey_31_226C6BAC4A9E77FA6DF9F4A2B36EFFD5) == 0x00001C, "Member 'FLv2_DifficultStruct::HitGiaRatey_31_226C6BAC4A9E77FA6DF9F4A2B36EFFD5' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, SniperAttackRate_28_E4BAFD42452F8E1E6E23729C437C94D1) == 0x000020, "Member 'FLv2_DifficultStruct::SniperAttackRate_28_E4BAFD42452F8E1E6E23729C437C94D1' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, SniperDamage_29_9A8170A7495222212778D1A93CEBD27B) == 0x000024, "Member 'FLv2_DifficultStruct::SniperDamage_29_9A8170A7495222212778D1A93CEBD27B' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, SniperBulletSpeed_30_25E09B394B5381DE6A8F07A5911DE2AD) == 0x000028, "Member 'FLv2_DifficultStruct::SniperBulletSpeed_30_25E09B394B5381DE6A8F07A5911DE2AD' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, CopsShowTimeRate_35_B9D45F2D4BECB3A73DB8AE84F7147421) == 0x00002C, "Member 'FLv2_DifficultStruct::CopsShowTimeRate_35_B9D45F2D4BECB3A73DB8AE84F7147421' has a wrong offset!");
static_assert(offsetof(FLv2_DifficultStruct, AlertTriggerTimeRate_37_ACD38C13490C3F6BC51192976EC4EC1D) == 0x000030, "Member 'FLv2_DifficultStruct::AlertTriggerTimeRate_37_ACD38C13490C3F6BC51192976EC4EC1D' has a wrong offset!");

}

