#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv3_AiCarController

#include "Basic.hpp"


namespace SDK::Params
{

// Function Lv3_AiCarController.Lv3_AiCarController_C.ExecuteUbergraph_Lv3_AiCarController
// 0x0018 (0x0018 - 0x0000)
struct Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController) == 0x000008, "Wrong alignment on Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController");
static_assert(sizeof(Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController) == 0x000018, "Wrong size on Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController");
static_assert(offsetof(Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController, EntryPoint) == 0x000000, "Member 'Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController, CallFunc_UseBlackboard_BlackboardComponent) == 0x000008, "Member 'Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController, CallFunc_UseBlackboard_ReturnValue) == 0x000010, "Member 'Lv3_AiCarController_C_ExecuteUbergraph_Lv3_AiCarController::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");

}

