#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv4_AttackCarController1

#include "Basic.hpp"


namespace SDK::Params
{

// Function Lv4-AttackCarController1.Lv4-AttackCarController1_C.ExecuteUbergraph_Lv4-AttackCarController1
// 0x0018 (0x0018 - 0x0000)
struct Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_UseBlackboard_BlackboardComponent;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseBlackboard_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1) == 0x000008, "Wrong alignment on Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1");
static_assert(sizeof(Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1) == 0x000018, "Wrong size on Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1");
static_assert(offsetof(Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1, EntryPoint) == 0x000000, "Member 'Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1, CallFunc_UseBlackboard_BlackboardComponent) == 0x000008, "Member 'Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1::CallFunc_UseBlackboard_BlackboardComponent' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1, CallFunc_UseBlackboard_ReturnValue) == 0x000010, "Member 'Lv4_AttackCarController1_C_ExecuteUbergraph_Lv4_AttackCarController1::CallFunc_UseBlackboard_ReturnValue' has a wrong offset!");

}

