#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv4_AttackCarBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Lv4-AttackCarBase.Lv4-AttackCarBase_C.ExecuteUbergraph_Lv4-AttackCarBase
// 0x01D0 (0x01D0 - 0x0000)
struct Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue1;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State1;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x0090(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x013C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPPrjBase_C*                           K2Node_DynamicCast_AsBPPrj_Base;                   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AVehicle_MC_C*                          K2Node_DynamicCast_AsVehicle_MC;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue1;             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BF[0x1];                                      // 0x01BF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X1;                         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue1;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue2;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase) == 0x000008, "Wrong alignment on Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase");
static_assert(sizeof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase) == 0x0001D0, "Wrong size on Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, EntryPoint) == 0x000000, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_bool_Has_Been_Initd_Variable1) == 0x000018, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_bool_IsClosed_Variable1) == 0x000020, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_int_Variable) == 0x000024, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, Temp_int_Variable1) == 0x000030, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_AsMer_2Game_State) == 0x000038, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_AsMer_2Game_State' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_GetGameState_ReturnValue1) == 0x000048, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_GetGameState_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_AsMer_2Game_State1) == 0x000050, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_AsMer_2Game_State1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_bSuccess1) == 0x000058, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_ComponentBoundEvent_HitComponent) == 0x000068, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_ComponentBoundEvent_OtherActor) == 0x000070, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_ComponentBoundEvent_OtherComp) == 0x000078, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_ComponentBoundEvent_NormalImpulse) == 0x000080, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_ComponentBoundEvent_Hit) == 0x000090, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_bBlockingHit) == 0x000118, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_bInitialOverlap) == 0x000119, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_Time) == 0x00011C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_Distance) == 0x000120, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_Location) == 0x000124, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_ImpactPoint) == 0x000130, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_Normal) == 0x00013C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_ImpactNormal) == 0x000148, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_PhysMat) == 0x000158, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_HitActor) == 0x000160, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_HitComponent) == 0x000168, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_HitBoneName) == 0x000170, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_HitItem) == 0x000178, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_FaceIndex) == 0x00017C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_TraceStart) == 0x000180, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakHitResult_TraceEnd) == 0x00018C, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_AsBPPrj_Base) == 0x000198, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_AsBPPrj_Base' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_bSuccess2) == 0x0001A0, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_AsVehicle_MC) == 0x0001A8, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_AsVehicle_MC' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, K2Node_DynamicCast_bSuccess3) == 0x0001B0, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Less_FloatFloat_ReturnValue) == 0x0001B1, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakVector2D_X) == 0x0001B4, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakVector2D_Y) == 0x0001B8, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Less_FloatFloat_ReturnValue1) == 0x0001BC, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Less_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001BD, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BooleanAND_ReturnValue) == 0x0001BE, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakVector2D_X1) == 0x0001C0, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakVector2D_X1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BreakVector2D_Y1) == 0x0001C4, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BreakVector2D_Y1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Greater_FloatFloat_ReturnValue1) == 0x0001C8, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Greater_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_Less_FloatFloat_ReturnValue2) == 0x0001C9, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_Less_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BooleanAND_ReturnValue1) == 0x0001CA, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BooleanAND_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase, CallFunc_BooleanOR_ReturnValue) == 0x0001CB, "Member 'Lv4_AttackCarBase_C_ExecuteUbergraph_Lv4_AttackCarBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Lv4-AttackCarBase.Lv4-AttackCarBase_C.BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             Hit;                                               // 0x0028(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x0000B0, "Wrong size on Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000028, "Member 'Lv4_AttackCarBase_C_BndEvt__Mesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function Lv4-AttackCarBase.Lv4-AttackCarBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Lv4_AttackCarBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Lv4_AttackCarBase_C_ReceiveTick) == 0x000004, "Wrong alignment on Lv4_AttackCarBase_C_ReceiveTick");
static_assert(sizeof(Lv4_AttackCarBase_C_ReceiveTick) == 0x000004, "Wrong size on Lv4_AttackCarBase_C_ReceiveTick");
static_assert(offsetof(Lv4_AttackCarBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Lv4_AttackCarBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

