#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lv4ScoreType

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Lv4ScoreType.Lv4ScoreType
// 0x0020 (0x0020 - 0x0000)
struct FLv4ScoreType final
{
public:
	int32                                         HitHead_2_BFE85EB24F488206770491BF6D779776;        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HItBody_4_ABFB6F2E4AAC595972EE7D86E47D3A64;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillNpc_6_C75A65804181F16E6256A0AA250CE612;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCar_38_B5967D384B5272082D931C8D8EE4E8E2;       // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitCar_33_BECC0C7B49A59F429C5015A328AA5E29;        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BrushPast_35_406B71414840A982361DFB8D0DE64639;     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackNormalCar_40_BEDEE0334FDECAC6177AB7BC8831CB43; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackEnemyCar_43_56E4B3304F4E904B674021924EB64143; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FLv4ScoreType) == 0x000004, "Wrong alignment on FLv4ScoreType");
static_assert(sizeof(FLv4ScoreType) == 0x000020, "Wrong size on FLv4ScoreType");
static_assert(offsetof(FLv4ScoreType, HitHead_2_BFE85EB24F488206770491BF6D779776) == 0x000000, "Member 'FLv4ScoreType::HitHead_2_BFE85EB24F488206770491BF6D779776' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, HItBody_4_ABFB6F2E4AAC595972EE7D86E47D3A64) == 0x000004, "Member 'FLv4ScoreType::HItBody_4_ABFB6F2E4AAC595972EE7D86E47D3A64' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, KillNpc_6_C75A65804181F16E6256A0AA250CE612) == 0x000008, "Member 'FLv4ScoreType::KillNpc_6_C75A65804181F16E6256A0AA250CE612' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, KillCar_38_B5967D384B5272082D931C8D8EE4E8E2) == 0x00000C, "Member 'FLv4ScoreType::KillCar_38_B5967D384B5272082D931C8D8EE4E8E2' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, HitCar_33_BECC0C7B49A59F429C5015A328AA5E29) == 0x000010, "Member 'FLv4ScoreType::HitCar_33_BECC0C7B49A59F429C5015A328AA5E29' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, BrushPast_35_406B71414840A982361DFB8D0DE64639) == 0x000014, "Member 'FLv4ScoreType::BrushPast_35_406B71414840A982361DFB8D0DE64639' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, AttackNormalCar_40_BEDEE0334FDECAC6177AB7BC8831CB43) == 0x000018, "Member 'FLv4ScoreType::AttackNormalCar_40_BEDEE0334FDECAC6177AB7BC8831CB43' has a wrong offset!");
static_assert(offsetof(FLv4ScoreType, AttackEnemyCar_43_56E4B3304F4E904B674021924EB64143) == 0x00001C, "Member 'FLv4ScoreType::AttackEnemyCar_43_56E4B3304F4E904B674021924EB64143' has a wrong offset!");

}

