#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenuButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenuButton.MainMenuButton_C.ExecuteUbergraph_MainMenuButton
// 0x0140 (0x0140 - 0x0000)
struct MainMenuButton_C_ExecuteUbergraph_MainMenuButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetLanguageText_Found;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetLanguageText_Lan_Text;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLanguageText_FontSize;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0050(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x00C0(0x0028)()
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00E8(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton) == 0x000008, "Wrong alignment on MainMenuButton_C_ExecuteUbergraph_MainMenuButton");
static_assert(sizeof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton) == 0x000140, "Wrong size on MainMenuButton_C_ExecuteUbergraph_MainMenuButton");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, EntryPoint) == 0x000000, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, Temp_bool_Variable) == 0x000004, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, CallFunc_GetLanguageText_Found) == 0x000005, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::CallFunc_GetLanguageText_Found' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, CallFunc_GetLanguageText_Lan_Text) == 0x000008, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::CallFunc_GetLanguageText_Lan_Text' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, CallFunc_GetLanguageText_FontSize) == 0x000018, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::CallFunc_GetLanguageText_FontSize' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_Select_Default) == 0x000020, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_Event_IsDesignTime) == 0x000030, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_Event_MyGeometry) == 0x000050, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_Event_InDeltaTime) == 0x000088, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, CallFunc_GetIsEnabled_ReturnValue) == 0x0000B8, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_MakeStruct_SlateColor1) == 0x0000C0, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_MakeStruct_SlateColor1' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_ExecuteUbergraph_MainMenuButton, K2Node_MakeStruct_SlateFontInfo) == 0x0000E8, "Member 'MainMenuButton_C_ExecuteUbergraph_MainMenuButton::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function MainMenuButton.MainMenuButton_C.Tick
// 0x003C (0x003C - 0x0000)
struct MainMenuButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenuButton_C_Tick) == 0x000004, "Wrong alignment on MainMenuButton_C_Tick");
static_assert(sizeof(MainMenuButton_C_Tick) == 0x00003C, "Wrong size on MainMenuButton_C_Tick");
static_assert(offsetof(MainMenuButton_C_Tick, MyGeometry) == 0x000000, "Member 'MainMenuButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenuButton_C_Tick, InDeltaTime) == 0x000038, "Member 'MainMenuButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function MainMenuButton.MainMenuButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct MainMenuButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenuButton_C_PreConstruct) == 0x000001, "Wrong alignment on MainMenuButton_C_PreConstruct");
static_assert(sizeof(MainMenuButton_C_PreConstruct) == 0x000001, "Wrong size on MainMenuButton_C_PreConstruct");
static_assert(offsetof(MainMenuButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'MainMenuButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

