#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ManAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimIK_structs.hpp"
#include "AnimIK_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ManAnimBP.ManAnimBP_C
// 0x4280 (0x47A0 - 0x0520)
class UManAnimBP_C final : public UIKAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0520(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1712D18E4F2D082102259996EAA64FC7; // 0x0528(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AB929E80417E3A05EA508AAD8A418695; // 0x0568(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_528F8F0F4EE73F47568E64974DE27692; // 0x05B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F5BCF40842A92DAE4669DBA96871722B; // 0x05F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8505572B4B7F32DB9A019B83A726562B; // 0x0640(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_536CC45E442BFFA8B69FAAA00D01A5C8; // 0x0688(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_098F61F347687BD1BAC782B000A9A81A; // 0x06D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_878E674E4D4011DAE3036780216C8F39; // 0x0718(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A6564ABE491451116EA20C9D5203D715; // 0x0760(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76E962424A28D3F7C08DA696DD8C3226; // 0x07A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6E86F96E4E9DB6FAD82783A06894D3D3; // 0x07F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_395AE82D4AF85AEE4AE41DBCAA5BE3DB; // 0x0838(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2211705E43324CE31B5F7CBA4A1A2B33; // 0x08D8(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3ECED3F8420F7B9A62441E9B2E178267; // 0x0918(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_A01DE564408CB9CC1823EA90FECD52D1; // 0x0A40(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_B20B7BB64678755A4B3F1C80516408A9; // 0x0A80(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16FB12F04F9343F8F2B32A8D9943EB0D; // 0x0BA8(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_078CFF2141E306F81F163FB11B2FA3DA; // 0x0BE8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E25B5F5141749F1AD689F2B9F7A2C4E8; // 0x0C88(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_148DF72E4D5403A2D98EABB898509533; // 0x0CC8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FA6F01A746C9E6C7B1CE25817D8F7029; // 0x0D68(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_627584F642BCA904DCE6E6B994BD69B3; // 0x0DA8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D2F8799D45A2AD22C2657CBBAF9A6FDD; // 0x0E48(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A71F423E4C15E1F55C0135959AD7B683; // 0x0E88(0x00E0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_301740284997163A03E72AB43DBDAA52; // 0x0F68(0x0040)()
	uint8                                         Pad_FA8[0x8];                                      // 0x0FA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_FullBodyIK                   AnimGraphNode_FullBodyIK_A4A87B6A4AE8F69D53EDF7A43AFBE3F4; // 0x0FB0(0x0530)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B8BB62E941A087CBEEA6A983D983321C; // 0x14E0(0x00D8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_D9D14E864A5BE22100D2BD8ACABBBA49; // 0x15B8(0x00F8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EF4641AC42EA1876669EE6880C0E6937; // 0x16B0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15179FE84243CD1733353B9A57E30072; // 0x16F8(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9ABC84884BCE15B0CFC65CACF7F72DD3; // 0x1740(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5405953E4B21BD8D5DBA5EA62B5E1A8E; // 0x1878(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1E41EA0A44B0181C64DB43A9AD4D2566; // 0x19B0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_D8AA6F254C068A3DA0C195B72AF16DF0; // 0x1AE8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E092207B433446E91B0208A1B8744372; // 0x1C20(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C6DD868D472D5F6770BA73B1683457EB; // 0x1D58(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7FC9AF274D74514D1D03F88DC9E770F8; // 0x1E90(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2DF52B2C4C09D223D058EBA804C3266B; // 0x1FC8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_B6DA192346B5FB7AC4913BAEA1A0181F; // 0x2100(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_B6F701EA4F6AAEF385712D89CD36F08C; // 0x2238(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C9960DFD4C3B0A4FBB9A86BC042F0BE2; // 0x2370(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7EC67C2E4AB4CE38A07CEB8C19183EAE; // 0x24A8(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E15DA43F41C5C125D200ABB40CDB70D7; // 0x25E0(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5E3DB74C4998B882B101C19147FFE1C2; // 0x2718(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_E07820854E0F14638EB13F8013EA673B; // 0x2850(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4A97865243AA31A287781C9A4786F968; // 0x2988(0x0138)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_38A3A28C4D66B9A3C9D49FA7C08008F8; // 0x2AC0(0x00D8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17035A7A4128EA9CE350D1A37C63482A; // 0x2B98(0x00D8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C5EFD8F1482877F700A062B7ABE9F9ED; // 0x2C70(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FAA138DA4B41AA4B9F786D916D803540; // 0x2CB8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D829E2F94EAE27404829E582FA35EB80; // 0x2D00(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_670B92AC4E64B87739AFCAB423129BE7; // 0x2DA0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EEB636BA4272B7CBB59E289B98FA44B2; // 0x2DE0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_617C5FA042C84953994B0193C4B2EA97; // 0x2E80(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_EEC4BA4049D4C35185CA89A7535F8972; // 0x2EC0(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75C19046461E002C8678319EC938D219; // 0x2FA0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76144C634F2C1E2FB7D8529E4ECB6480; // 0x2FE8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1D81E5BC4936AA99C3F9A6A76D07392A; // 0x3030(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5A4264024E3D3AE9D86F8D872B549FFE; // 0x30D0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B2816A2D438128DD505D93A9F7F13923; // 0x3110(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76AE74B74AC66BF2E2AC9093F425663B; // 0x31B0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C1F034534740195EF46F72B118A15189; // 0x31F0(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_03D19F624EE031A3F56417BB6B1F07E9; // 0x32D0(0x00E0)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2AB6EA4947E58DA99827F4A03DFE40C3; // 0x33B0(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5BA9CFB444C16C364ECE7AAA8B693925; // 0x3490(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B80521DE475D9DF8D735138783B1AFA7; // 0x34D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_972F5529413A02FF98FE6AA9A512D893; // 0x3520(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4F6B87854786CB9F2A9C2CB1C0E7A22D; // 0x35C0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D34EE25A40A964E726C7A2B747A72152; // 0x3600(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1D0DF1E24001FA69E54417A9B5AE2170; // 0x36A0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_DE8B66304825050F522F79BCCDF87FE4; // 0x36E0(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F8249C6A4349298161F88AB0D9DF5D52; // 0x37C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EE19C16D490822225AEF5DA0C7436D18; // 0x3808(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_09F415CA479508FDF6EC23BD16210DB2; // 0x3850(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8F27BBDE4A883E589E2AFE8FED69CCAE; // 0x38F0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E05BA1D94F2CCCD289C685ABACEACAB8; // 0x3930(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5C15A90B4E11301CFC45D289CCC19AB0; // 0x39D0(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_34A321754E35A1D8971DD9BF46A838B0; // 0x3A10(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29A908924A73EB2531418389F0C2330B; // 0x3AF0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59A5F7504B2CA753FF1D279D2F9F3856; // 0x3B38(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7B89BBC342F4DC6F8A6B529F2AFEF4B6; // 0x3B80(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABE009754E6608FE69C27E94AE58376B; // 0x3C20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9DDEBDCD413540F8B8E57A85471D36D4; // 0x3C60(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45599E81420BD82E7B9B20B56787050F; // 0x3D00(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_71577E934E8EB10B5FF9F893746F26C0; // 0x3D40(0x00E0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A76F8A624CC358B63A08C78509112E61; // 0x3E20(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9BC3C0D247C52C8A900EA9904CD3F304; // 0x3E68(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C7CCB33945DA1A14D1E578A573AC4CB2; // 0x3EB0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8D90F1F446F91CAEC1CE43AF30BBA855; // 0x3F50(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F1073DD24959A64F9273238FCA9C0359; // 0x3F90(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_D8B2F1AA49B4AAFB00EC17AC3DD7B0DA; // 0x4030(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8FCC878247D15BBC3A64B0A84F5B2AE9; // 0x4070(0x00E0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3A3BD827421A01C90F6EBBB8167BE026; // 0x4150(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E815122242118FCAD3CAA587693AFCA7; // 0x4190(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0554752942114C0EE190BDB30E5A5E71; // 0x41D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_78D739FD4604EA3575F0D8876E1BC8F6; // 0x4220(0x00D0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_06A2DD8F473955F68ED259BA9A294E05; // 0x42F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1E5BF954417F669CEFB9388E8D09E983; // 0x4338(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3DE2599B4CE1D3942B1F4B910DED61CB; // 0x4380(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8D17B5944B10DD6810294E9F4224E65A; // 0x43C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66716EF544450392C57B4A80063508D1; // 0x4468(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DC02ADCF444FC59EACA3B2AD3EADC17D; // 0x44A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_0A028E48499C8657B6EAEDBFC178414C; // 0x4548(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_BD247DD3445565A399376E960E373BFB; // 0x4588(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_617EA1A44681C78F6C3298BF2BD1DF75; // 0x4628(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_AC54A666487ECD16D177EA8974A8CB4F; // 0x4668(0x00E0)()
	float                                         HeadRotatorSpeed;                                  // 0x4748(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAIControlled;                                    // 0x474C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_474D[0x3];                                     // 0x474D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               Bn_piston_base_Sho_FR_up;                          // 0x4750(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Bn_piston_base_Sho_BR_up;                          // 0x475C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Bn_piston_base_Sho_FL_up;                          // 0x4768(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Bn_piston_base_Sho_BL_up;                          // 0x4774(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Bn_piston_base_Sho_FR_up_0;                        // 0x4780(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_478C[0x4];                                     // 0x478C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 SkeletonMesh;                                      // 0x4790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTriggerLeft;                                     // 0x4798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTriggerRight;                                    // 0x4799(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EItemTypes                                    RightHandWeapon;                                   // 0x479A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemTypes                                    LeftHandWeapon;                                    // 0x479B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouch;                                          // 0x479C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ManAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_5E3DB74C4998B882B101C19147FFE1C2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_E07820854E0F14638EB13F8013EA673B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_4A97865243AA31A287781C9A4786F968();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_E15DA43F41C5C125D200ABB40CDB70D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_7EC67C2E4AB4CE38A07CEB8C19183EAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ManAnimBP_AnimGraphNode_ModifyBone_C9960DFD4C3B0A4FBB9A86BC042F0BE2();
