#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: meButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "buttonParent_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass meButton.meButton_C
// 0x0018 (0x0228 - 0x0210)
class UmeButton_C final : public UbuttonParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 bg;                                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                meButton;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_meButton(int32 EntryPoint);
	void BndEvt__meButton_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"meButton_C">();
	}
	static class UmeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UmeButton_C>();
	}
};
static_assert(alignof(UmeButton_C) == 0x000008, "Wrong alignment on UmeButton_C");
static_assert(sizeof(UmeButton_C) == 0x000228, "Wrong size on UmeButton_C");
static_assert(offsetof(UmeButton_C, UberGraphFrame) == 0x000210, "Member 'UmeButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UmeButton_C, bg) == 0x000218, "Member 'UmeButton_C::bg' has a wrong offset!");
static_assert(offsetof(UmeButton_C, meButton) == 0x000220, "Member 'UmeButton_C::meButton' has a wrong offset!");

}

