#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mer2ExtraSetting

#include "Basic.hpp"

#include "Enum_PlayMode_structs.hpp"
#include "Enum_TurnMode_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mer2ExtraSetting.Mer2ExtraSetting_C
// 0x0008 (0x0030 - 0x0028)
class UMer2ExtraSetting_C final : public USaveGame
{
public:
	bool                                          DominateHandLeft;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	Enum_PlayMode                                 PlayMode;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_TurnMode                                 TurnMode;                                          // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlayBGM;                                           // 0x002B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mer2ExtraSetting_C">();
	}
	static class UMer2ExtraSetting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMer2ExtraSetting_C>();
	}
};
static_assert(alignof(UMer2ExtraSetting_C) == 0x000008, "Wrong alignment on UMer2ExtraSetting_C");
static_assert(sizeof(UMer2ExtraSetting_C) == 0x000030, "Wrong size on UMer2ExtraSetting_C");
static_assert(offsetof(UMer2ExtraSetting_C, DominateHandLeft) == 0x000028, "Member 'UMer2ExtraSetting_C::DominateHandLeft' has a wrong offset!");
static_assert(offsetof(UMer2ExtraSetting_C, PlayMode) == 0x000029, "Member 'UMer2ExtraSetting_C::PlayMode' has a wrong offset!");
static_assert(offsetof(UMer2ExtraSetting_C, TurnMode) == 0x00002A, "Member 'UMer2ExtraSetting_C::TurnMode' has a wrong offset!");
static_assert(offsetof(UMer2ExtraSetting_C, PlayBGM) == 0x00002B, "Member 'UMer2ExtraSetting_C::PlayBGM' has a wrong offset!");

}

