#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mer2GameState

#include "Basic.hpp"


namespace SDK::Params
{

// Function Mer2GameState.Mer2GameState_C.ExecuteUbergraph_Mer2GameState
// 0x03C8 (0x03C8 - 0x0000)
struct Mer2GameState_C_ExecuteUbergraph_Mer2GameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable5;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue5;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable3;                                // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable6;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue6;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable5;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable4;                                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable6;                    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable7;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue7;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable7;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable5;                                // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE[0x2];                                       // 0x00DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable8;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue8;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable8;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable9;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue9;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable10;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue10;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable9;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable10;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable1;                      // 0x0106(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable1;                // 0x0107(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable7;                                // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable8;                                // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue6;           // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ID;                             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_NickName;                       // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsServer;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue11;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable11;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors1;           // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item1;                          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors2;           // 0x01C0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_Map_Values_Values;                        // 0x01E0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item2;                          // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Array_Get_Item3;                          // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors3;           // 0x0208(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item4;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable9;                                // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue12;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors4;           // 0x0238(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item5;                          // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue13;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue14;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors5;           // 0x0260(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item6;                          // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue5;                // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue15;                 // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors6;           // 0x0288(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable11;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item7;                          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue16;                 // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue6;                // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue5;                 // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue17;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable12;                   // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item8;                          // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors7;           // 0x02C8(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item9;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue7;                // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue6;                 // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable12;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue7;                 // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue18;                 // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable10;                               // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue7;           // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue19;                 // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue20;                 // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue21;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors8;           // 0x0308(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors9;           // 0x0318(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item10;                         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item11;                         // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue8;                // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue9;                // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue8;                 // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue9;                 // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors10;          // 0x0348(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item12;                         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue10;               // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue10;                // 0x0364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_365[0x3];                                      // 0x0365(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue22;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue23;                 // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors11;          // 0x0370(0x0010)(ZeroConstructor, ReferenceParm)
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item13;                         // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue11;               // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue11;                // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_CharacterBase_C*>            CallFunc_GetAllActorsOfClass_OutActors12;          // 0x0390(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Variable11;                               // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CharacterBase_C*                    CallFunc_Array_Get_Item14;                         // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue8;           // 0x03B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue9;           // 0x03B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue10;          // 0x03B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue12;               // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue12;                // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BD[0x3];                                      // 0x03BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue24;                 // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState) == 0x000008, "Wrong alignment on Mer2GameState_C_ExecuteUbergraph_Mer2GameState");
static_assert(sizeof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState) == 0x0003C8, "Wrong size on Mer2GameState_C_ExecuteUbergraph_Mer2GameState");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, EntryPoint) == 0x000000, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_HasAuthority_ReturnValue) == 0x00000C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable1) == 0x000010, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue1) == 0x000014, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable) == 0x000018, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable1) == 0x00001C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable) == 0x000020, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable2) == 0x000028, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue2) == 0x00002C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable2) == 0x000030, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable3) == 0x000034, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue3) == 0x000038, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable4) == 0x00003C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable1) == 0x000040, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue4) == 0x000044, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x000048, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable3) == 0x00004C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable2) == 0x000050, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable5) == 0x000054, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue5) == 0x000058, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable4) == 0x00005C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable3) == 0x000070, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable6) == 0x000074, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue6) == 0x000078, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable5) == 0x00007C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable4) == 0x000080, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000084, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable6) == 0x000088, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Conv_BoolToString_ReturnValue) == 0x000090, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable7) == 0x0000A0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable7' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Concat_StrStr_ReturnValue1) == 0x0000A8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue7) == 0x0000B8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue7' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Concat_StrStr_ReturnValue2) == 0x0000C0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable7) == 0x0000D0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable7' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable5) == 0x0000D4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable6) == 0x0000D8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue3) == 0x0000DC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue4) == 0x0000DD, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable8) == 0x0000E0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable8' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue8) == 0x0000E4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue8' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable8) == 0x0000E8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable8' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable9) == 0x0000EC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable9' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue9) == 0x0000F0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue9' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable10) == 0x0000F4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable10' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue10) == 0x0000F8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue10' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable9) == 0x0000FC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable9' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable10) == 0x000100, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable10' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_bool_IsClosed_Variable) == 0x000104, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_bool_Has_Been_Initd_Variable) == 0x000105, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_bool_IsClosed_Variable1) == 0x000106, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_bool_IsClosed_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_bool_Has_Been_Initd_Variable1) == 0x000107, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_bool_Has_Been_Initd_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable7) == 0x000108, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable7' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue5) == 0x00010C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable8) == 0x000110, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable8' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_EqualEqual_IntInt_ReturnValue6) == 0x000114, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_EqualEqual_IntInt_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_Event_DeltaSeconds) == 0x000118, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetGameInstance_ReturnValue) == 0x000120, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_CustomEvent_ID) == 0x000128, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_CustomEvent_ID' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_CustomEvent_NickName) == 0x000138, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_CustomEvent_NickName' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_CustomEvent_IsServer) == 0x000148, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_CustomEvent_IsServer' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000150, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors) == 0x000160, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue11) == 0x000170, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue11' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item) == 0x000178, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue) == 0x000184, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Array_Index_Variable11) == 0x000188, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Array_Index_Variable11' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors1) == 0x000190, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item1) == 0x0001A0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue1) == 0x0001A8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0001B0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors2) == 0x0001C0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Contains_ReturnValue) == 0x0001D0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue2) == 0x0001D4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue1) == 0x0001D8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_FloatFloat_ReturnValue) == 0x0001DC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Map_Values_Values) == 0x0001E0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Map_Length_ReturnValue) == 0x0001F0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item2) == 0x0001F4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001F8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Greater_IntInt_ReturnValue) == 0x0001F9, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item3) == 0x0001FC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000200, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Abs_ReturnValue) == 0x000204, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors3) == 0x000208, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000218, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item4) == 0x000220, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue3) == 0x000228, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Variable9) == 0x00022C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Variable9' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue12) == 0x000230, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue12' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors4) == 0x000238, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item5) == 0x000248, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue4) == 0x000250, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue2) == 0x000254, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue13) == 0x000258, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue13' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue14) == 0x00025C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue14' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors5) == 0x000260, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item6) == 0x000270, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue5) == 0x000278, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue5' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue3) == 0x00027C, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue15) == 0x000280, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue15' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_GetAllActorsOfClass_OutActors6) == 0x000288, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_GetAllActorsOfClass_OutActors6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, Temp_int_Loop_Counter_Variable11) == 0x000298, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::Temp_int_Loop_Counter_Variable11' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Get_Item7) == 0x0002A0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Get_Item7' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue4) == 0x0002A8, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Add_IntInt_ReturnValue16) == 0x0002AC, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Add_IntInt_ReturnValue16' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Array_Length_ReturnValue6) == 0x0002B0, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Array_Length_ReturnValue6' has a wrong offset!");
static_assert(offsetof(Mer2GameState_C_ExecuteUbergraph_Mer2GameState, CallFunc_Less_IntInt_ReturnValue5) == 0x0002B4, "Member 'Mer2GameState_C_ExecuteUbergraph_Mer2GameState::CallFunc_Less_IntInt_ReturnValue5' has a wrong offset!");
