#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mer2OnlineSave

#include "Basic.hpp"

#include "EnumDifficuty_structs.hpp"
#include "Enum_Language_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mer2OnlineSave.Mer2OnlineSave_C
// 0x0020 (0x0048 - 0x0028)
class UMer2OnlineSave_C final : public USaveGame
{
public:
	int32                                         StartLevel;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EnumDifficuty                                 Difficulty;                                        // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SoundLevel;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnglish;                                         // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	Enum_Language                                 Language;                                          // 0x0035(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PlanerReflection;                                  // 0x0036(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Resolution;                                        // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MSAA;                                              // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Subtitle;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFreeMove;                                        // 0x0041(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mer2OnlineSave_C">();
	}
	static class UMer2OnlineSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMer2OnlineSave_C>();
	}
};
static_assert(alignof(UMer2OnlineSave_C) == 0x000008, "Wrong alignment on UMer2OnlineSave_C");
static_assert(sizeof(UMer2OnlineSave_C) == 0x000048, "Wrong size on UMer2OnlineSave_C");
static_assert(offsetof(UMer2OnlineSave_C, StartLevel) == 0x000028, "Member 'UMer2OnlineSave_C::StartLevel' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, Difficulty) == 0x00002C, "Member 'UMer2OnlineSave_C::Difficulty' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, SoundLevel) == 0x000030, "Member 'UMer2OnlineSave_C::SoundLevel' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, IsEnglish) == 0x000034, "Member 'UMer2OnlineSave_C::IsEnglish' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, Language) == 0x000035, "Member 'UMer2OnlineSave_C::Language' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, PlanerReflection) == 0x000036, "Member 'UMer2OnlineSave_C::PlanerReflection' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, Resolution) == 0x000038, "Member 'UMer2OnlineSave_C::Resolution' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, MSAA) == 0x00003C, "Member 'UMer2OnlineSave_C::MSAA' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, Subtitle) == 0x000040, "Member 'UMer2OnlineSave_C::Subtitle' has a wrong offset!");
static_assert(offsetof(UMer2OnlineSave_C, IsFreeMove) == 0x000041, "Member 'UMer2OnlineSave_C::IsFreeMove' has a wrong offset!");

}

