#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mer2_Lv2_PlayerController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Mer2PlayerController_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mer2_Lv2_PlayerController.Mer2_Lv2_PlayerController_C
// 0x0030 (0x0730 - 0x0700)
class AMer2_Lv2_PlayerController_C final : public AMer2PlayerController_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Mer2_Lv2_PlayerController_C;        // 0x06F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Lv2_characterBase_C*                P1;                                                // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_characterBase_C*                P2;                                                // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Lv2_characterBase_C*                NextPawn;                                          // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALv2_SniperRifle_C*                     sniperRifle;                                       // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCarl;                                            // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Mer2_Lv2_PlayerController(int32 EntryPoint);
	void ReturnHMDStatus(bool bHMDEnabled, const struct FVector& HMDOffset, const struct FRotator& HMDRotation);
	void SpawnSniperRifle(class ALv2_SniperRifle_C** sniperRifle_0);
	void SwitchCharacter();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mer2_Lv2_PlayerController_C">();
	}
	static class AMer2_Lv2_PlayerController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMer2_Lv2_PlayerController_C>();
	}
};
static_assert(alignof(AMer2_Lv2_PlayerController_C) == 0x000010, "Wrong alignment on AMer2_Lv2_PlayerController_C");
static_assert(sizeof(AMer2_Lv2_PlayerController_C) == 0x000730, "Wrong size on AMer2_Lv2_PlayerController_C");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, UberGraphFrame_Mer2_Lv2_PlayerController_C) == 0x0006F8, "Member 'AMer2_Lv2_PlayerController_C::UberGraphFrame_Mer2_Lv2_PlayerController_C' has a wrong offset!");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, P1) == 0x000700, "Member 'AMer2_Lv2_PlayerController_C::P1' has a wrong offset!");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, P2) == 0x000708, "Member 'AMer2_Lv2_PlayerController_C::P2' has a wrong offset!");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, NextPawn) == 0x000710, "Member 'AMer2_Lv2_PlayerController_C::NextPawn' has a wrong offset!");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, sniperRifle) == 0x000718, "Member 'AMer2_Lv2_PlayerController_C::sniperRifle' has a wrong offset!");
static_assert(offsetof(AMer2_Lv2_PlayerController_C, IsCarl) == 0x000720, "Member 'AMer2_Lv2_PlayerController_C::IsCarl' has a wrong offset!");

}

