#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mer2GameInstance

#include "Basic.hpp"

#include "Lv2ScoreType_structs.hpp"
#include "Lv4_ScoreType_structs.hpp"
#include "Lv4ScoreType_structs.hpp"
#include "scoreType_structs.hpp"
#include "Lv2_Scoretype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EnumScoreType_structs.hpp"
#include "EnumDifficuty_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "GameState_structs.hpp"
#include "Struct_PlayerData_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK::Params
{

// Function Mer2GameInstance.Mer2GameInstance_C.ExecuteUbergraph_Mer2GameInstance
// 0x04F8 (0x04F8 - 0x0000)
struct Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FSessionPropertyKeyPair>        CallFunc_GetExtraSettings_ExtraSettings;           // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	ESessionSettingSearchResult                   CallFunc_GetSessionPropertyString_SearchResult;    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionPropertyString_SettingValue;    // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results1;                       // 0x0068(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate3; // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FBlueprintSessionResult>        K2Node_CustomEvent_Results;                        // 0x0088(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TDelegate<void(const TArray<struct FBlueprintSessionResult>& Results)> K2Node_CreateDelegate_OutputDelegate4; // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FBlueprintSessionResult>        Temp_struct_Variable;                              // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue; // 0x00D8(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate8;             // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_MapName1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Filter1;                        // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Filter;                         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue1; // 0x0148(0x0020)()
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue2; // 0x0168(0x0020)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSessionsSearchSetting                 CallFunc_MakeLiteralSessionSearchProperty_ReturnValue; // 0x0190(0x0028)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue1;                         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue1;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlueprintSessionResult                K2Node_CustomEvent_Session;                        // 0x01E8(0x00B8)()
	class UJoinSessionCallbackProxy*              CallFunc_JoinSession_ReturnValue;                  // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_MapName;                        // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue1;         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate9;             // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSessionPropertyKeyPair                CallFunc_MakeLiteralSessionPropertyString_ReturnValue3; // 0x0308(0x0020)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0328(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FSessionPropertyKeyPair>        K2Node_MakeArray_Array;                            // 0x0338(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FSessionPropertyKeyPair>        K2Node_MakeArray_Array1;                           // 0x0348(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FSessionsSearchSetting                 CallFunc_MakeLiteralSessionSearchProperty_ReturnValue1; // 0x0358(0x0028)()
	class UCreateSessionCallbackProxyAdvanced*    CallFunc_CreateAdvancedSession_ReturnValue;        // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSessionsSearchSetting>         K2Node_MakeArray_Array2;                           // 0x0388(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionsSearchSetting>         K2Node_MakeArray_Array3;                           // 0x03A0(0x0010)(ZeroConstructor, ReferenceParm)
	class FString                                 K2Node_CustomEvent_LevelName;                      // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBlueprintSessionResult>        CallFunc_FilterSessionResults_FilteredResults;     // 0x03F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FBlueprintSessionResult                CallFunc_Array_Get_Item;                           // 0x0400(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C5[0x3];                                      // 0x04C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionsSearchSetting>         Temp_struct_Variable1;                             // 0x04C8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFindSessionsCallbackProxyAdvanced*     CallFunc_FindSessionsAdvanced_ReturnValue;         // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue2;         // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDestroySessionCallbackProxy*           CallFunc_DestroySession_ReturnValue1;              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance) == 0x000008, "Wrong alignment on Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance");
static_assert(sizeof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance) == 0x0004F8, "Wrong size on Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, EntryPoint) == 0x000000, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetExtraSettings_ExtraSettings) == 0x000018, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetExtraSettings_ExtraSettings' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate1) == 0x000028, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetSessionPropertyString_SearchResult) == 0x000038, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetSessionPropertyString_SearchResult' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetSessionPropertyString_SettingValue) == 0x000040, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetSessionPropertyString_SettingValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate2) == 0x000058, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_Results1) == 0x000068, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_Results1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate3) == 0x000078, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_Results) == 0x000088, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate4) == 0x000098, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, Temp_struct_Variable) == 0x0000A8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate5) == 0x0000B8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate6) == 0x0000C8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate6' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue) == 0x0000D8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate7) == 0x0000F8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate7' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate8) == 0x000108, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate8' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, Temp_int_Array_Index_Variable) == 0x000118, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_MapName1) == 0x000120, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_MapName1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_Filter1) == 0x000128, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_Filter1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_Filter) == 0x000138, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_Filter' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue1) == 0x000148, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue2) == 0x000168, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Len_ReturnValue) == 0x000188, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionSearchProperty_ReturnValue) == 0x000190, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionSearchProperty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Len_ReturnValue1) == 0x0001BC, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Len_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Greater_IntInt_ReturnValue1) == 0x0001C0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Greater_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetPlayerController_ReturnValue) == 0x0001C8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_DestroySession_ReturnValue) == 0x0001D0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_DestroySession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, Temp_int_Loop_Counter_Variable) == 0x0001D8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Add_IntInt_ReturnValue) == 0x0001DC, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_Session) == 0x0001E8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_Session' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_JoinSession_ReturnValue) == 0x0002A0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_JoinSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue1) == 0x0002A8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_MapName) == 0x0002B0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_MapName' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Conv_StringToName_ReturnValue) == 0x0002C0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Concat_StrStr_ReturnValue) == 0x0002C8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetPlayerController_ReturnValue1) == 0x0002D8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetPlayerController_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CreateDelegate_OutputDelegate9) == 0x0002E0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CreateDelegate_OutputDelegate9' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0002F0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Conv_IntToString_ReturnValue) == 0x0002F8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionPropertyString_ReturnValue3) == 0x000308, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionPropertyString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Concat_StrStr_ReturnValue1) == 0x000328, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Concat_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_MakeArray_Array) == 0x000338, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_MakeArray_Array1) == 0x000348, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_MakeArray_Array1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_MakeLiteralSessionSearchProperty_ReturnValue1) == 0x000358, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_MakeLiteralSessionSearchProperty_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_CreateAdvancedSession_ReturnValue) == 0x000380, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_CreateAdvancedSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_MakeArray_Array2) == 0x000388, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_MakeArray_Array2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue2) == 0x000398, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_MakeArray_Array3) == 0x0003A0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_MakeArray_Array3' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_CustomEvent_LevelName) == 0x0003B0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_CustomEvent_LevelName' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Concat_StrStr_ReturnValue2) == 0x0003C0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue3) == 0x0003D0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetGameState_ReturnValue) == 0x0003D8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_DynamicCast_AsMer_2Game_State) == 0x0003E0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_DynamicCast_AsMer_2Game_State' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, K2Node_DynamicCast_bSuccess) == 0x0003E8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_FilterSessionResults_FilteredResults) == 0x0003F0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_FilterSessionResults_FilteredResults' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Array_Get_Item) == 0x000400, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Array_Length_ReturnValue) == 0x0004B8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Less_IntInt_ReturnValue) == 0x0004BC, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Array_Length_ReturnValue1) == 0x0004C0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Array_Length_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_Greater_IntInt_ReturnValue2) == 0x0004C4, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, Temp_struct_Variable1) == 0x0004C8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::Temp_struct_Variable1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_FindSessionsAdvanced_ReturnValue) == 0x0004D8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_FindSessionsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_GetPlayerController_ReturnValue2) == 0x0004E0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_GetPlayerController_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_DestroySession_ReturnValue1) == 0x0004E8, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_DestroySession_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue4) == 0x0004F0, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance, CallFunc_IsValid_ReturnValue5) == 0x0004F1, "Member 'Mer2GameInstance_C_ExecuteUbergraph_Mer2GameInstance::CallFunc_IsValid_ReturnValue5' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.ServerTravel
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_ServerTravel final
{
public:
	class FString                                 LevelName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameInstance_C_ServerTravel) == 0x000008, "Wrong alignment on Mer2GameInstance_C_ServerTravel");
static_assert(sizeof(Mer2GameInstance_C_ServerTravel) == 0x000010, "Wrong size on Mer2GameInstance_C_ServerTravel");
static_assert(offsetof(Mer2GameInstance_C_ServerTravel, LevelName) == 0x000000, "Member 'Mer2GameInstance_C_ServerTravel::LevelName' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.OnDeadTravel
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_OnDeadTravel final
{
public:
	class FString                                 MapName_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameInstance_C_OnDeadTravel) == 0x000008, "Wrong alignment on Mer2GameInstance_C_OnDeadTravel");
static_assert(sizeof(Mer2GameInstance_C_OnDeadTravel) == 0x000010, "Wrong size on Mer2GameInstance_C_OnDeadTravel");
static_assert(offsetof(Mer2GameInstance_C_OnDeadTravel, MapName_0) == 0x000000, "Member 'Mer2GameInstance_C_OnDeadTravel::MapName_0' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.JoinSession
// 0x00B8 (0x00B8 - 0x0000)
struct Mer2GameInstance_C_JoinSession final
{
public:
	struct FBlueprintSessionResult                Session_0;                                         // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Mer2GameInstance_C_JoinSession) == 0x000008, "Wrong alignment on Mer2GameInstance_C_JoinSession");
static_assert(sizeof(Mer2GameInstance_C_JoinSession) == 0x0000B8, "Wrong size on Mer2GameInstance_C_JoinSession");
static_assert(offsetof(Mer2GameInstance_C_JoinSession, Session_0) == 0x000000, "Member 'Mer2GameInstance_C_JoinSession::Session_0' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.FindSession
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_FindSession final
{
public:
	class FString                                 Filter;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameInstance_C_FindSession) == 0x000008, "Wrong alignment on Mer2GameInstance_C_FindSession");
static_assert(sizeof(Mer2GameInstance_C_FindSession) == 0x000010, "Wrong size on Mer2GameInstance_C_FindSession");
static_assert(offsetof(Mer2GameInstance_C_FindSession, Filter) == 0x000000, "Member 'Mer2GameInstance_C_FindSession::Filter' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.CreateSession
// 0x0018 (0x0018 - 0x0000)
struct Mer2GameInstance_C_CreateSession final
{
public:
	class FName                                   MapName_0;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Filter;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameInstance_C_CreateSession) == 0x000008, "Wrong alignment on Mer2GameInstance_C_CreateSession");
static_assert(sizeof(Mer2GameInstance_C_CreateSession) == 0x000018, "Wrong size on Mer2GameInstance_C_CreateSession");
static_assert(offsetof(Mer2GameInstance_C_CreateSession, MapName_0) == 0x000000, "Member 'Mer2GameInstance_C_CreateSession::MapName_0' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_CreateSession, Filter) == 0x000008, "Member 'Mer2GameInstance_C_CreateSession::Filter' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.OnSuccess_B37144804BB00E9A5BC6F9B784641DA1
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1) == 0x000008, "Wrong alignment on Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1");
static_assert(sizeof(Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1) == 0x000010, "Wrong size on Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1");
static_assert(offsetof(Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1, Results) == 0x000000, "Member 'Mer2GameInstance_C_OnSuccess_B37144804BB00E9A5BC6F9B784641DA1::Results' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.OnFailure_B37144804BB00E9A5BC6F9B784641DA1
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1 final
{
public:
	TArray<struct FBlueprintSessionResult>        Results;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1) == 0x000008, "Wrong alignment on Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1");
static_assert(sizeof(Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1) == 0x000010, "Wrong size on Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1");
static_assert(offsetof(Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1, Results) == 0x000000, "Member 'Mer2GameInstance_C_OnFailure_B37144804BB00E9A5BC6F9B784641DA1::Results' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.SavePlayerData
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_SavePlayerData final
{
public:
	class ABP_CharacterBase_C*                    Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_PlayerData                     TempData;                                          // 0x0008(0x0002)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStruct_PlayerData                     K2Node_MakeStruct_Struct_PlayerData;               // 0x000B(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FStruct_PlayerData                     K2Node_MakeStruct_Struct_PlayerData1;              // 0x000E(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mer2GameInstance_C_SavePlayerData) == 0x000008, "Wrong alignment on Mer2GameInstance_C_SavePlayerData");
static_assert(sizeof(Mer2GameInstance_C_SavePlayerData) == 0x000010, "Wrong size on Mer2GameInstance_C_SavePlayerData");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, Player) == 0x000000, "Member 'Mer2GameInstance_C_SavePlayerData::Player' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, TempData) == 0x000008, "Member 'Mer2GameInstance_C_SavePlayerData::TempData' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'Mer2GameInstance_C_SavePlayerData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, K2Node_MakeStruct_Struct_PlayerData) == 0x00000B, "Member 'Mer2GameInstance_C_SavePlayerData::K2Node_MakeStruct_Struct_PlayerData' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, CallFunc_IsValid_ReturnValue1) == 0x00000D, "Member 'Mer2GameInstance_C_SavePlayerData::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_SavePlayerData, K2Node_MakeStruct_Struct_PlayerData1) == 0x00000E, "Member 'Mer2GameInstance_C_SavePlayerData::K2Node_MakeStruct_Struct_PlayerData1' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.LoadPlayerData
// 0x0010 (0x0010 - 0x0000)
struct Mer2GameInstance_C_LoadPlayerData final
{
public:
	class ABP_CharacterBase_C*                    Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsLoad;                                            // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mer2GameInstance_C_LoadPlayerData) == 0x000008, "Wrong alignment on Mer2GameInstance_C_LoadPlayerData");
static_assert(sizeof(Mer2GameInstance_C_LoadPlayerData) == 0x000010, "Wrong size on Mer2GameInstance_C_LoadPlayerData");
static_assert(offsetof(Mer2GameInstance_C_LoadPlayerData, Player) == 0x000000, "Member 'Mer2GameInstance_C_LoadPlayerData::Player' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_LoadPlayerData, Success) == 0x000008, "Member 'Mer2GameInstance_C_LoadPlayerData::Success' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_LoadPlayerData, IsLoad) == 0x000009, "Member 'Mer2GameInstance_C_LoadPlayerData::IsLoad' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_LoadPlayerData, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'Mer2GameInstance_C_LoadPlayerData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_LoadPlayerData, K2Node_SwitchEnum1_CmpSuccess) == 0x00000B, "Member 'Mer2GameInstance_C_LoadPlayerData::K2Node_SwitchEnum1_CmpSuccess' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.lsPhoneDevice
// 0x0020 (0x0020 - 0x0000)
struct Mer2GameInstance_C_lsPhoneDevice final
{
public:
	bool                                          outlsPhone;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mer2GameInstance_C_lsPhoneDevice) == 0x000008, "Wrong alignment on Mer2GameInstance_C_lsPhoneDevice");
static_assert(sizeof(Mer2GameInstance_C_lsPhoneDevice) == 0x000020, "Wrong size on Mer2GameInstance_C_lsPhoneDevice");
static_assert(offsetof(Mer2GameInstance_C_lsPhoneDevice, outlsPhone) == 0x000000, "Member 'Mer2GameInstance_C_lsPhoneDevice::outlsPhone' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsPhoneDevice, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'Mer2GameInstance_C_lsPhoneDevice::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsPhoneDevice, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'Mer2GameInstance_C_lsPhoneDevice::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsPhoneDevice, CallFunc_EqualEqual_StrStr_ReturnValue1) == 0x000019, "Member 'Mer2GameInstance_C_lsPhoneDevice::CallFunc_EqualEqual_StrStr_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsPhoneDevice, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'Mer2GameInstance_C_lsPhoneDevice::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.lsAnroid
// 0x0020 (0x0020 - 0x0000)
struct Mer2GameInstance_C_lsAnroid final
{
public:
	bool                                          blsAndroid;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mer2GameInstance_C_lsAnroid) == 0x000008, "Wrong alignment on Mer2GameInstance_C_lsAnroid");
static_assert(sizeof(Mer2GameInstance_C_lsAnroid) == 0x000020, "Wrong size on Mer2GameInstance_C_lsAnroid");
static_assert(offsetof(Mer2GameInstance_C_lsAnroid, blsAndroid) == 0x000000, "Member 'Mer2GameInstance_C_lsAnroid::blsAndroid' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsAnroid, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'Mer2GameInstance_C_lsAnroid::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mer2GameInstance_C_lsAnroid, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000018, "Member 'Mer2GameInstance_C_lsAnroid::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function Mer2GameInstance.Mer2GameInstance_C.AddBulletScore
// 0x0488 (0x0488 - 0x0000)
struct Mer2GameInstance_C_AddBulletScore final
{
public:
	EnumScoreType                                 scoreType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FscoreType                             currentScore;                                      // 0x0010(0x004C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerController_ReturnValue;      // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FscoreType                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0068(0x004C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FscoreType                             CallFunc_GetDataTableRowFromName_OutRow1;          // 0x00B8(0x004C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue1;     // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FscoreType                             CallFunc_GetDataTableRowFromName_OutRow2;          // 0x0108(0x004C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue2;     // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FscoreType                             CallFunc_GetDataTableRowFromName_OutRow3;          // 0x0158(0x004C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue3;     // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x01A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select1_Default;                            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select2_Default;                            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select3_Default;                            // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select4_Default;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select5_Default;                            // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select6_Default;                            // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select7_Default;                            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select8_Default;                            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable9;                               // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select9_Default;                            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select10_Default;                           // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable11;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select11_Default;                           // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable12;                              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable2;                             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select12_Default;                           // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
