#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiplayerUI

#include "Basic.hpp"

#include "AdvancedSessions_structs.hpp"
#include "SlateCore_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK::Params
{

// Function MultiplayerUI.MultiplayerUI_C.ExecuteUbergraph_MultiplayerUI
// 0x01D8 (0x01D8 - 0x0000)
struct MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlueprintSessionResult                K2Node_CustomEvent_Session;                        // 0x0040(0x00B8)()
	bool                                          K2Node_CustomEvent_IsDebug;                        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSessionPropertyKeyPair>        CallFunc_GetExtraSettings_ExtraSettings;           // 0x0100(0x0010)(ZeroConstructor, ReferenceParm)
	ESessionSettingSearchResult                   CallFunc_GetSessionPropertyString_SearchResult;    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSessionPropertyString_SettingValue;    // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue1;                   // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue2;                   // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue3;                   // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue4;                   // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue5;                   // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_147[0x1];                                      // 0x0147(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue2;             // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance2;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers;  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x01C0(0x0018)()
};
static_assert(alignof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI) == 0x000008, "Wrong alignment on MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI");
static_assert(sizeof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI) == 0x0001D8, "Wrong size on MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, EntryPoint) == 0x000000, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_Event_MyGeometry) == 0x000004, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_CustomEvent_Session) == 0x000040, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_CustomEvent_Session' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_CustomEvent_IsDebug) == 0x0000F8, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_CustomEvent_IsDebug' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetExtraSettings_ExtraSettings) == 0x000100, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetExtraSettings_ExtraSettings' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetSessionPropertyString_SearchResult) == 0x000110, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetSessionPropertyString_SearchResult' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetSessionPropertyString_SettingValue) == 0x000118, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetSessionPropertyString_SettingValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_SwitchEnum_CmpSuccess) == 0x000140, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue) == 0x000141, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue1) == 0x000142, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue2) == 0x000143, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue3) == 0x000144, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue4) == 0x000145, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_IsVisible_ReturnValue5) == 0x000146, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_IsVisible_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetGameInstance_ReturnValue) == 0x000148, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000150, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetGameInstance_ReturnValue1) == 0x000160, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000168, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000178, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_bSuccess1) == 0x000180, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_Conv_StringToName_ReturnValue) == 0x000188, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetGameInstance_ReturnValue2) == 0x000190, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetGameInstance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_AsMer_2Game_Instance2) == 0x000198, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_AsMer_2Game_Instance2' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, K2Node_DynamicCast_bSuccess2) == 0x0001A0, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers) == 0x0001A4, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_GetNumberOfNetworkPlayers_NumNetPlayers' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001A8, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_BuildString_Int_ReturnValue) == 0x0001B0, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI, CallFunc_Conv_StringToText_ReturnValue1) == 0x0001C0, "Member 'MultiplayerUI_C_ExecuteUbergraph_MultiplayerUI::CallFunc_Conv_StringToText_ReturnValue1' has a wrong offset!");

// Function MultiplayerUI.MultiplayerUI_C.AddList
// 0x00C0 (0x00C0 - 0x0000)
struct MultiplayerUI_C_AddList final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsDebug;                                           // 0x00B8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MultiplayerUI_C_AddList) == 0x000008, "Wrong alignment on MultiplayerUI_C_AddList");
static_assert(sizeof(MultiplayerUI_C_AddList) == 0x0000C0, "Wrong size on MultiplayerUI_C_AddList");
static_assert(offsetof(MultiplayerUI_C_AddList, Session) == 0x000000, "Member 'MultiplayerUI_C_AddList::Session' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_AddList, IsDebug) == 0x0000B8, "Member 'MultiplayerUI_C_AddList::IsDebug' has a wrong offset!");

// Function MultiplayerUI.MultiplayerUI_C.Tick
// 0x003C (0x003C - 0x0000)
struct MultiplayerUI_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MultiplayerUI_C_Tick) == 0x000004, "Wrong alignment on MultiplayerUI_C_Tick");
static_assert(sizeof(MultiplayerUI_C_Tick) == 0x00003C, "Wrong size on MultiplayerUI_C_Tick");
static_assert(offsetof(MultiplayerUI_C_Tick, MyGeometry) == 0x000000, "Member 'MultiplayerUI_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MultiplayerUI_C_Tick, InDeltaTime) == 0x000038, "Member 'MultiplayerUI_C_Tick::InDeltaTime' has a wrong offset!");

}

