#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MultiplayerUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "AdvancedSessions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MultiplayerUI.MultiplayerUI_C
// 0x00E0 (0x02E8 - 0x0208)
class UMultiplayerUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loading;                                           // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BtnText;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_44;                                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_1;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_2;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_3;                                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_4;                                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_5;                                            // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                List_6;                                            // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_1;                                       // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_2;                                       // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_3;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_4;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_5;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             List_Text_6;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Loading_1;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Loading_2;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_33;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SearchingText;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FBlueprintSessionResult>        SessionList;                                       // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LeftTime;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBtn;                                           // 0x02CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TxtBtn;                                            // 0x02D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MultiplayerUI(int32 EntryPoint);
	void BndEvt__List_6_K2Node_ComponentBoundEvent_136_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__List_5_K2Node_ComponentBoundEvent_112_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__List_4_K2Node_ComponentBoundEvent_89_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__List_3_K2Node_ComponentBoundEvent_67_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__List_2_K2Node_ComponentBoundEvent_46_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__List_1_K2Node_ComponentBoundEvent_33_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_0_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void ClearList();
	void AddList(const struct FBlueprintSessionResult& Session, bool IsDebug);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MultiplayerUI_C">();
	}
	static class UMultiplayerUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiplayerUI_C>();
	}
};
static_assert(alignof(UMultiplayerUI_C) == 0x000008, "Wrong alignment on UMultiplayerUI_C");
static_assert(sizeof(UMultiplayerUI_C) == 0x0002E8, "Wrong size on UMultiplayerUI_C");
static_assert(offsetof(UMultiplayerUI_C, UberGraphFrame) == 0x000208, "Member 'UMultiplayerUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Loading) == 0x000210, "Member 'UMultiplayerUI_C::Loading' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, BtnText) == 0x000218, "Member 'UMultiplayerUI_C::BtnText' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Button_0) == 0x000220, "Member 'UMultiplayerUI_C::Button_0' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Image_44) == 0x000228, "Member 'UMultiplayerUI_C::Image_44' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Image_98) == 0x000230, "Member 'UMultiplayerUI_C::Image_98' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_1) == 0x000238, "Member 'UMultiplayerUI_C::List_1' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_2) == 0x000240, "Member 'UMultiplayerUI_C::List_2' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_3) == 0x000248, "Member 'UMultiplayerUI_C::List_3' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_4) == 0x000250, "Member 'UMultiplayerUI_C::List_4' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_5) == 0x000258, "Member 'UMultiplayerUI_C::List_5' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_6) == 0x000260, "Member 'UMultiplayerUI_C::List_6' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_1) == 0x000268, "Member 'UMultiplayerUI_C::List_Text_1' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_2) == 0x000270, "Member 'UMultiplayerUI_C::List_Text_2' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_3) == 0x000278, "Member 'UMultiplayerUI_C::List_Text_3' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_4) == 0x000280, "Member 'UMultiplayerUI_C::List_Text_4' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_5) == 0x000288, "Member 'UMultiplayerUI_C::List_Text_5' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, List_Text_6) == 0x000290, "Member 'UMultiplayerUI_C::List_Text_6' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Loading_1) == 0x000298, "Member 'UMultiplayerUI_C::Loading_1' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, Loading_2) == 0x0002A0, "Member 'UMultiplayerUI_C::Loading_2' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, ScrollBox_33) == 0x0002A8, "Member 'UMultiplayerUI_C::ScrollBox_33' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, SearchingText) == 0x0002B0, "Member 'UMultiplayerUI_C::SearchingText' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, SessionList) == 0x0002B8, "Member 'UMultiplayerUI_C::SessionList' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, LeftTime) == 0x0002C8, "Member 'UMultiplayerUI_C::LeftTime' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, ShowBtn) == 0x0002CC, "Member 'UMultiplayerUI_C::ShowBtn' has a wrong offset!");
static_assert(offsetof(UMultiplayerUI_C, TxtBtn) == 0x0002D0, "Member 'UMultiplayerUI_C::TxtBtn' has a wrong offset!");

}

