#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OculusHMD

#include "Basic.hpp"

#include "HeadMountedDisplay_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "OculusHMD_structs.hpp"


namespace SDK
{

// Class OculusHMD.OculusFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UOculusFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddLoadingSplashScreen(class UTexture2D* Texture, const struct FVector& TranslationInMeters, const struct FRotator& Rotation, const struct FVector2D& SizeInMeters, const struct FRotator& DeltaRotation, bool bClearBeforeAdd);
	static void ClearLoadingSplashScreens();
	static void EnableAutoLoadingSplashScreen(bool bAutoShowEnabled);
	static void EnableOrientationTracking(bool bOrientationTracking);
	static void EnablePositionTracking(bool bPositionTracking);
	static TArray<float> GetAvailableDisplayFrequencies();
	static void GetBaseRotationAndBaseOffsetInMeters(struct FRotator* OutRotation, struct FVector* OutBaseOffsetInMeters);
	static void GetBaseRotationAndPositionOffset(struct FRotator* OutRot, struct FVector* OutPosOffset);
	static float GetCurrentDisplayFrequency();
	static class FString GetDeviceName();
	static float GetGPUFrameTime();
	static void GetGPUUtilization(bool* IsGPUAvailable, float* GPUUtilization);
	static struct FVector GetGuardianDimensions(EBoundaryType BoundaryType);
	static TArray<struct FVector> GetGuardianPoints(EBoundaryType BoundaryType);
	static void GetLoadingSplashParams(class FString* TexturePath, struct FVector* DistanceInMeters, struct FVector2D* SizeInMeters, struct FVector* RotationAxis, float* RotationDeltaInDeg);
	static struct FGuardianTestResult GetNodeGuardianIntersection(ETrackedDeviceType DeviceType, EBoundaryType BoundaryType);
	static struct FTransform GetPlayAreaTransform();
	static struct FGuardianTestResult GetPointGuardianIntersection(const struct FVector& Point, EBoundaryType BoundaryType);
	static void GetPose(struct FRotator* DeviceRotation, struct FVector* DevicePosition, struct FVector* NeckPosition, bool bUseOrienationForPlayerCamera, bool bUsePositionForPlayerCamera, const struct FVector& PositionScale);
	static void GetRawSensorData(struct FVector* AngularAcceleration, struct FVector* LinearAcceleration, struct FVector* AngularVelocity, struct FVector* LinearVelocity, float* TimeInSeconds, ETrackedDeviceType DeviceType);
	static ETiledMultiResLevel GetTiledMultiresLevel();
	static bool GetUserProfile(struct FHmdUserProfile* Profile);
	static bool HasInputFocus();
	static bool HasSystemOverlayPresent();
	static void HideLoadingIcon();
	static void HideLoadingSplashScreen(bool bClear);
	static bool IsAutoLoadingSplashScreenEnabled();
	static bool IsDeviceTracked(ETrackedDeviceType DeviceType);
	static bool IsGuardianDisplayed();
	static bool IsLoadingIconEnabled();
	static void SetBaseRotationAndBaseOffsetInMeters(const struct FRotator& Rotation, const struct FVector& BaseOffsetInMeters, EOrientPositionSelector Options);
	static void SetBaseRotationAndPositionOffset(const struct FRotator& BaseRot, const struct FVector& PosOffset, EOrientPositionSelector Options);
	static void SetCPUAndGPULevels(int32 CPULevel, int32 GPULevel);
	static void SetDisplayFrequency(float RequestedFrequency);
	static void SetGuardianVisibility(bool GuardianVisible);
	static void SetLoadingSplashParams(const class FString& TexturePath, const struct FVector& DistanceInMeters, const struct FVector2D& SizeInMeters, const struct FVector& RotationAxis, float RotationDeltaInDeg);
	static void SetPositionScale3D(const struct FVector& PosScale3D);
	static void SetReorientHMDOnControllerRecenter(bool recenterMode);
	static void SetTiledMultiresLevel(ETiledMultiResLevel Level);
	static void ShowLoadingIcon(class UTexture2D* Texture);
	static void ShowLoadingSplashScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OculusFunctionLibrary">();
	}
	static class UOculusFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusFunctionLibrary>();
	}
};
static_assert(alignof(UOculusFunctionLibrary) == 0x000008, "Wrong alignment on UOculusFunctionLibrary");
static_assert(sizeof(UOculusFunctionLibrary) == 0x000028, "Wrong size on UOculusFunctionLibrary");

// Class OculusHMD.OculusHMDRuntimeSettings
// 0x0018 (0x0040 - 0x0028)
class UOculusHMDRuntimeSettings final : public UObject
{
public:
	bool                                          bAutoEnabled;                                      // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FOculusSplashDesc>              SplashDescs;                                       // 0x0030(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OculusHMDRuntimeSettings">();
	}
	static class UOculusHMDRuntimeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusHMDRuntimeSettings>();
	}
};
static_assert(alignof(UOculusHMDRuntimeSettings) == 0x000008, "Wrong alignment on UOculusHMDRuntimeSettings");
static_assert(sizeof(UOculusHMDRuntimeSettings) == 0x000040, "Wrong size on UOculusHMDRuntimeSettings");
static_assert(offsetof(UOculusHMDRuntimeSettings, bAutoEnabled) == 0x000028, "Member 'UOculusHMDRuntimeSettings::bAutoEnabled' has a wrong offset!");
static_assert(offsetof(UOculusHMDRuntimeSettings, SplashDescs) == 0x000030, "Member 'UOculusHMDRuntimeSettings::SplashDescs' has a wrong offset!");

// Class OculusHMD.OculusSceneCaptureCubemap
// 0x0068 (0x0090 - 0x0028)
class UOculusSceneCaptureCubemap final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneCaptureComponent2D*>       CaptureComponents;                                 // 0x0038(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OculusSceneCaptureCubemap">();
	}
	static class UOculusSceneCaptureCubemap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOculusSceneCaptureCubemap>();
	}
};
static_assert(alignof(UOculusSceneCaptureCubemap) == 0x000008, "Wrong alignment on UOculusSceneCaptureCubemap");
static_assert(sizeof(UOculusSceneCaptureCubemap) == 0x000090, "Wrong size on UOculusSceneCaptureCubemap");
static_assert(offsetof(UOculusSceneCaptureCubemap, CaptureComponents) == 0x000038, "Member 'UOculusSceneCaptureCubemap::CaptureComponents' has a wrong offset!");

}

