#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: optionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "buttonParent_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass optionButton.optionButton_C
// 0x0018 (0x0228 - 0x0210)
class UoptionButton_C final : public UbuttonParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 bg;                                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                optionButton;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_optionButton(int32 EntryPoint);
	void BndEvt__optionButton_K2Node_ComponentBoundEvent_11_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"optionButton_C">();
	}
	static class UoptionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UoptionButton_C>();
	}
};
static_assert(alignof(UoptionButton_C) == 0x000008, "Wrong alignment on UoptionButton_C");
static_assert(sizeof(UoptionButton_C) == 0x000228, "Wrong size on UoptionButton_C");
static_assert(offsetof(UoptionButton_C, UberGraphFrame) == 0x000210, "Member 'UoptionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UoptionButton_C, bg) == 0x000218, "Member 'UoptionButton_C::bg' has a wrong offset!");
static_assert(offsetof(UoptionButton_C, optionButton) == 0x000220, "Member 'UoptionButton_C::optionButton' has a wrong offset!");

}

