#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCModeHud

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "EnumDifficuty_structs.hpp"


namespace SDK::Params
{

// Function PCModeHud.PCModeHud_C.ExecuteUbergraph_PCModeHud
// 0x02A8 (0x02A8 - 0x0000)
struct PCModeHud_C_ExecuteUbergraph_PCModeHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EnumDifficuty                                 Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0070(0x0018)()
	bool                                          Temp_bool_Variable1;                               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CharacterBase_C*                    K2Node_DynamicCast_AsBP_Character_Base;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E0(0x0018)()
	int32                                         CallFunc_Round_ReturnValue1;                       // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0100(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11B[0x5];                                      // 0x011B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMer2GameState_C*                       K2Node_DynamicCast_AsMer_2Game_State;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0140(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0170(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0188(0x0018)()
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue1;                // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select1_Default;                            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x01A8(0x0018)()
	int32                                         K2Node_Select2_Default;                            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue4;              // 0x01C8(0x0018)()
	int32                                         K2Node_Select3_Default;                            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue5;              // 0x01E8(0x0018)()
	int32                                         K2Node_Select4_Default;                            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue6;              // 0x0208(0x0018)()
	int32                                         K2Node_Select5_Default;                            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select6_Default;                            // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue1;           // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue1;            // 0x0240(0x0018)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentTimeScore__score;               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentDodgoScore__score;              // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue7;              // 0x0278(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue8;              // 0x0290(0x0018)()
};
static_assert(alignof(PCModeHud_C_ExecuteUbergraph_PCModeHud) == 0x000008, "Wrong alignment on PCModeHud_C_ExecuteUbergraph_PCModeHud");
static_assert(sizeof(PCModeHud_C_ExecuteUbergraph_PCModeHud) == 0x0002A8, "Wrong size on PCModeHud_C_ExecuteUbergraph_PCModeHud");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, EntryPoint) == 0x000000, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable) == 0x000010, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000018, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_byte_Variable) == 0x000021, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_text_Variable) == 0x000028, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_text_Variable1) == 0x000040, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_text_Variable1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_text_Variable2) == 0x000058, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_text_Variable2' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_text_Variable3) == 0x000070, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_text_Variable3' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable1) == 0x000088, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable2) == 0x000089, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable3) == 0x00008A, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Event_MyGeometry) == 0x00008C, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x0000C8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_AsBP_Character_Base) == 0x0000D0, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_bSuccess1) == 0x0000D8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Round_ReturnValue) == 0x0000DC, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue) == 0x0000E0, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Round_ReturnValue1) == 0x0000F8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Round_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue1) == 0x000100, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable4) == 0x000119, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, Temp_bool_Variable5) == 0x00011A, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetGameState_ReturnValue) == 0x000120, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetController_ReturnValue) == 0x000128, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_AsMer_2Game_State) == 0x000130, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_AsMer_2Game_State' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_bSuccess2) == 0x000138, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_IsValid_ReturnValue1) == 0x000139, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_IsValid_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select_Default) == 0x000140, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000158, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00015C, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToFloat_ReturnValue1) == 0x000160, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000164, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000168, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue2) == 0x000170, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_FloatToText_ReturnValue) == 0x000188, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_HasAuthority_ReturnValue) == 0x0001A0, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_HasAuthority_ReturnValue1) == 0x0001A1, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_HasAuthority_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select1_Default) == 0x0001A4, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue3) == 0x0001A8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select2_Default) == 0x0001C0, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue4) == 0x0001C8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select3_Default) == 0x0001E0, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue5) == 0x0001E8, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select4_Default) == 0x000200, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue6) == 0x000208, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select5_Default) == 0x000220, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_Select6_Default) == 0x000224, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x000228, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_EqualEqual_IntInt_ReturnValue1) == 0x00022C, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_EqualEqual_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x000230, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000234, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x000238, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_FloatToText_ReturnValue1) == 0x000240, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_FloatToText_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetGameInstance_ReturnValue1) == 0x000258, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000260, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, K2Node_DynamicCast_bSuccess3) == 0x000268, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetCurrentTimeScore__score) == 0x00026C, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetCurrentTimeScore__score' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_GetCurrentDodgoScore__score) == 0x000270, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_GetCurrentDodgoScore__score' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue7) == 0x000278, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_ExecuteUbergraph_PCModeHud, CallFunc_Conv_IntToText_ReturnValue8) == 0x000290, "Member 'PCModeHud_C_ExecuteUbergraph_PCModeHud::CallFunc_Conv_IntToText_ReturnValue8' has a wrong offset!");

// Function PCModeHud.PCModeHud_C.Tick
// 0x003C (0x003C - 0x0000)
struct PCModeHud_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PCModeHud_C_Tick) == 0x000004, "Wrong alignment on PCModeHud_C_Tick");
static_assert(sizeof(PCModeHud_C_Tick) == 0x00003C, "Wrong size on PCModeHud_C_Tick");
static_assert(offsetof(PCModeHud_C_Tick, MyGeometry) == 0x000000, "Member 'PCModeHud_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(PCModeHud_C_Tick, InDeltaTime) == 0x000038, "Member 'PCModeHud_C_Tick::InDeltaTime' has a wrong offset!");

}

