#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInfoMM

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayerInfoMM.PlayerInfoMM_C.SetRankInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfoMM_C_SetRankInfo final
{
public:
	class FText                                   _rank;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfoMM_C_SetRankInfo) == 0x000008, "Wrong alignment on PlayerInfoMM_C_SetRankInfo");
static_assert(sizeof(PlayerInfoMM_C_SetRankInfo) == 0x000018, "Wrong size on PlayerInfoMM_C_SetRankInfo");
static_assert(offsetof(PlayerInfoMM_C_SetRankInfo, _rank) == 0x000000, "Member 'PlayerInfoMM_C_SetRankInfo::_rank' has a wrong offset!");

// Function PlayerInfoMM.PlayerInfoMM_C.SetNameInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfoMM_C_SetNameInfo final
{
public:
	class FText                                   _name;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfoMM_C_SetNameInfo) == 0x000008, "Wrong alignment on PlayerInfoMM_C_SetNameInfo");
static_assert(sizeof(PlayerInfoMM_C_SetNameInfo) == 0x000018, "Wrong size on PlayerInfoMM_C_SetNameInfo");
static_assert(offsetof(PlayerInfoMM_C_SetNameInfo, _name) == 0x000000, "Member 'PlayerInfoMM_C_SetNameInfo::_name' has a wrong offset!");

// Function PlayerInfoMM.PlayerInfoMM_C.SetScoreInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfoMM_C_SetScoreInfo final
{
public:
	class FText                                   _score;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfoMM_C_SetScoreInfo) == 0x000008, "Wrong alignment on PlayerInfoMM_C_SetScoreInfo");
static_assert(sizeof(PlayerInfoMM_C_SetScoreInfo) == 0x000018, "Wrong size on PlayerInfoMM_C_SetScoreInfo");
static_assert(offsetof(PlayerInfoMM_C_SetScoreInfo, _score) == 0x000000, "Member 'PlayerInfoMM_C_SetScoreInfo::_score' has a wrong offset!");

}

