#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function PlayerInfo.PlayerInfo_C.SetRankInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfo_C_SetRankInfo final
{
public:
	class FText                                   _rank;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfo_C_SetRankInfo) == 0x000008, "Wrong alignment on PlayerInfo_C_SetRankInfo");
static_assert(sizeof(PlayerInfo_C_SetRankInfo) == 0x000018, "Wrong size on PlayerInfo_C_SetRankInfo");
static_assert(offsetof(PlayerInfo_C_SetRankInfo, _rank) == 0x000000, "Member 'PlayerInfo_C_SetRankInfo::_rank' has a wrong offset!");

// Function PlayerInfo.PlayerInfo_C.SetNameInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfo_C_SetNameInfo final
{
public:
	class FText                                   _name;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfo_C_SetNameInfo) == 0x000008, "Wrong alignment on PlayerInfo_C_SetNameInfo");
static_assert(sizeof(PlayerInfo_C_SetNameInfo) == 0x000018, "Wrong size on PlayerInfo_C_SetNameInfo");
static_assert(offsetof(PlayerInfo_C_SetNameInfo, _name) == 0x000000, "Member 'PlayerInfo_C_SetNameInfo::_name' has a wrong offset!");

// Function PlayerInfo.PlayerInfo_C.SetScoreInfo
// 0x0018 (0x0018 - 0x0000)
struct PlayerInfo_C_SetScoreInfo final
{
public:
	class FText                                   _score;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(PlayerInfo_C_SetScoreInfo) == 0x000008, "Wrong alignment on PlayerInfo_C_SetScoreInfo");
static_assert(sizeof(PlayerInfo_C_SetScoreInfo) == 0x000018, "Wrong size on PlayerInfo_C_SetScoreInfo");
static_assert(offsetof(PlayerInfo_C_SetScoreInfo, _score) == 0x000000, "Member 'PlayerInfo_C_SetScoreInfo::_score' has a wrong offset!");

// Function PlayerInfo.PlayerInfo_C.setAvatarInfo
// 0x0088 (0x0088 - 0x0000)
struct PlayerInfo_C_setAvatarInfo final
{
public:
	struct FSlateBrush                            InBrush;                                           // 0x0000(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(PlayerInfo_C_setAvatarInfo) == 0x000008, "Wrong alignment on PlayerInfo_C_setAvatarInfo");
static_assert(sizeof(PlayerInfo_C_setAvatarInfo) == 0x000088, "Wrong size on PlayerInfo_C_setAvatarInfo");
static_assert(offsetof(PlayerInfo_C_setAvatarInfo, InBrush) == 0x000000, "Member 'PlayerInfo_C_setAvatarInfo::InBrush' has a wrong offset!");

}

