#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerInfoMM

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerInfoMM.PlayerInfoMM_C
// 0x0018 (0x0220 - 0x0208)
class UPlayerInfoMM_C final : public UUserWidget
{
public:
	class UTextBlock*                             Name_0;                                            // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             rank;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Score;                                             // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetRankInfo(const class FText& _rank);
	void SetNameInfo(const class FText& _name);
	void SetScoreInfo(const class FText& _score);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerInfoMM_C">();
	}
	static class UPlayerInfoMM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerInfoMM_C>();
	}
};
static_assert(alignof(UPlayerInfoMM_C) == 0x000008, "Wrong alignment on UPlayerInfoMM_C");
static_assert(sizeof(UPlayerInfoMM_C) == 0x000220, "Wrong size on UPlayerInfoMM_C");
static_assert(offsetof(UPlayerInfoMM_C, Name_0) == 0x000208, "Member 'UPlayerInfoMM_C::Name_0' has a wrong offset!");
static_assert(offsetof(UPlayerInfoMM_C, rank) == 0x000210, "Member 'UPlayerInfoMM_C::rank' has a wrong offset!");
static_assert(offsetof(UPlayerInfoMM_C, Score) == 0x000218, "Member 'UPlayerInfoMM_C::Score' has a wrong offset!");

}

