#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Elevator_outDoor_Skeleton_AnimBlueprint

#include "Basic.hpp"


namespace SDK::Params
{

// Function Prop_Elevator_outDoor_Skeleton_AnimBlueprint.Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint
// 0x0010 (0x0010 - 0x0000)
struct Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint) == 0x000004, "Wrong alignment on Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint");
static_assert(sizeof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint) == 0x000010, "Wrong size on Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint");
static_assert(offsetof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue) == 0x000004, "Member 'Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint, CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1) == 0x000008, "Member 'Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint::CallFunc_GetInstanceAssetPlayerTimeFromEndFraction_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint, CallFunc_LessEqual_FloatFloat_ReturnValue1) == 0x00000D, "Member 'Prop_Elevator_outDoor_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Prop_Elevator_outDoor_Skeleton_AnimBlueprint::CallFunc_LessEqual_FloatFloat_ReturnValue1' has a wrong offset!");

}

