#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Slide_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Prop_Slide_Skeleton_AnimBlueprint.Prop_Slide_Skeleton_AnimBlueprint_C
// 0x0868 (0x0BC0 - 0x0358)
class UProp_Slide_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7A3088854A6E31A90CA96C869AA8AD6B; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8FD40D86411DAB5450130E971381B126; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4E52006B46308FA5D377B1949FDCD2E3; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1A4B7F345F62EEA4C7012BB69642632; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_DDC88B374258B365F07DB8843E0A1109; // 0x0480(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E5A6326D4D07BFF136031DAE9993596E; // 0x04C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9B783BDB40DAD99E1935E2881EAE0F03; // 0x0510(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_727EE8744D91A28B58E1FB96FEA44418; // 0x0558(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4D2A1C2B478A1DE912A86DB63806CEA6; // 0x05A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F6F5AFB3419E99EE6D826AA1BDD407EA; // 0x05E8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_849E516441277F669D90A9837762AB4B; // 0x0688(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0E1E4C9842F19982F06114A646D3C92C; // 0x06C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64B63F7E4C1175D501C81C9057C27AD0; // 0x0768(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63B76F7C422BD622C1C21EABF0E91B55; // 0x07A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_F1FCAA014F1E8E9404392599CD9B586C; // 0x0848(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_368C590444CC95700BB0698C36722669; // 0x0888(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_498D4F7F4214BC2A4E5E22BE867DAEB8; // 0x0928(0x0040)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_833A54C442FF55E607C9538AD024A699; // 0x0968(0x0128)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_FF19B70F4BFBF2727EA162BFF20C4B79; // 0x0A90(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3060946947BB97F3210DDBB1BC36A24F; // 0x0AD0(0x00E0)()
	float                                         LeftRight;                                         // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DownLeftTrigger;                                   // 0x0BB4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DownRightTrigger;                                  // 0x0BB5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Init;                                              // 0x0BB6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DownLeftBoomTrigger;                               // 0x0BB7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DownRightBoomTrigger;                              // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_Slide_Skeleton_AnimBlueprint(int32 EntryPoint);
	void InitAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_Slide_Skeleton_AnimBlueprint_C">();
	}
	static class UProp_Slide_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProp_Slide_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UProp_Slide_Skeleton_AnimBlueprint_C) == 0x000008, "Wrong alignment on UProp_Slide_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UProp_Slide_Skeleton_AnimBlueprint_C) == 0x000BC0, "Wrong size on UProp_Slide_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000360, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_7A3088854A6E31A90CA96C869AA8AD6B) == 0x000368, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_7A3088854A6E31A90CA96C869AA8AD6B' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_8FD40D86411DAB5450130E971381B126) == 0x0003A8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_8FD40D86411DAB5450130E971381B126' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_4E52006B46308FA5D377B1949FDCD2E3) == 0x0003F0, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_4E52006B46308FA5D377B1949FDCD2E3' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_C1A4B7F345F62EEA4C7012BB69642632) == 0x000438, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_C1A4B7F345F62EEA4C7012BB69642632' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_DDC88B374258B365F07DB8843E0A1109) == 0x000480, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_DDC88B374258B365F07DB8843E0A1109' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_E5A6326D4D07BFF136031DAE9993596E) == 0x0004C8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_E5A6326D4D07BFF136031DAE9993596E' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_9B783BDB40DAD99E1935E2881EAE0F03) == 0x000510, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_9B783BDB40DAD99E1935E2881EAE0F03' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_727EE8744D91A28B58E1FB96FEA44418) == 0x000558, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_727EE8744D91A28B58E1FB96FEA44418' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_4D2A1C2B478A1DE912A86DB63806CEA6) == 0x0005A0, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_4D2A1C2B478A1DE912A86DB63806CEA6' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_F6F5AFB3419E99EE6D826AA1BDD407EA) == 0x0005E8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_F6F5AFB3419E99EE6D826AA1BDD407EA' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_849E516441277F669D90A9837762AB4B) == 0x000688, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_849E516441277F669D90A9837762AB4B' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_0E1E4C9842F19982F06114A646D3C92C) == 0x0006C8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_0E1E4C9842F19982F06114A646D3C92C' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_64B63F7E4C1175D501C81C9057C27AD0) == 0x000768, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_64B63F7E4C1175D501C81C9057C27AD0' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_63B76F7C422BD622C1C21EABF0E91B55) == 0x0007A8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_63B76F7C422BD622C1C21EABF0E91B55' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_F1FCAA014F1E8E9404392599CD9B586C) == 0x000848, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_F1FCAA014F1E8E9404392599CD9B586C' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_368C590444CC95700BB0698C36722669) == 0x000888, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_368C590444CC95700BB0698C36722669' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_498D4F7F4214BC2A4E5E22BE867DAEB8) == 0x000928, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_498D4F7F4214BC2A4E5E22BE867DAEB8' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendSpacePlayer_833A54C442FF55E607C9538AD024A699) == 0x000968, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendSpacePlayer_833A54C442FF55E607C9538AD024A699' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_FF19B70F4BFBF2727EA162BFF20C4B79) == 0x000A90, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_FF19B70F4BFBF2727EA162BFF20C4B79' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine_3060946947BB97F3210DDBB1BC36A24F) == 0x000AD0, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine_3060946947BB97F3210DDBB1BC36A24F' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, LeftRight) == 0x000BB0, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::LeftRight' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, DownLeftTrigger) == 0x000BB4, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::DownLeftTrigger' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, DownRightTrigger) == 0x000BB5, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::DownRightTrigger' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, Init) == 0x000BB6, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::Init' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, DownLeftBoomTrigger) == 0x000BB7, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::DownLeftBoomTrigger' has a wrong offset!");
static_assert(offsetof(UProp_Slide_Skeleton_AnimBlueprint_C, DownRightBoomTrigger) == 0x000BB8, "Member 'UProp_Slide_Skeleton_AnimBlueprint_C::DownRightBoomTrigger' has a wrong offset!");

}

