#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prop_Elevator_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Prop_Elevator_Skeleton_AnimBlueprint.Prop_Elevator_Skeleton_AnimBlueprint_C
// 0x05D8 (0x0930 - 0x0358)
class UProp_Elevator_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F657DBCA4BCDED925D5767AA59C1292C; // 0x0368(0x0040)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59D5B1E946113EA50169729F96CDF346; // 0x03A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ADB0A1EF4B6EF69BDAF1B3A8C7400D99; // 0x03F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5ABCFC614C4ADB50D44168B3DDD691C5; // 0x0438(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E01D1C784893E867405F248C317B75CE; // 0x0480(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_FD23BA5145DD3EA04B8234A39CA01633; // 0x04C8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_253930DD4DF520894F87C3A62597AC5C; // 0x0568(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_899246F84FB18D0DC4BE35988364E8C4; // 0x05A8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_B019EB604C3E54F69558B1845AF9565F; // 0x0648(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_97A1D38642E753E7BBE2C0862C68D0CB; // 0x0688(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E101E8784190941C92A1E9B28170F82D; // 0x0728(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F69018A54C104CECEFC39CBE9B849453; // 0x0768(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_DF56640E40EFAB876FE698A58DE20169; // 0x0808(0x0040)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_090C34B24EEDEDEB96AB67AC25F94F1B; // 0x0848(0x00E0)()
	bool                                          IsOpen;                                            // 0x0928(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsRolling;                                         // 0x0929(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsRollingCouldStop;                                // 0x092A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Prop_Elevator_Skeleton_AnimBlueprint(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Prop_Elevator_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_5ABCFC614C4ADB50D44168B3DDD691C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Prop_Elevator_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_59D5B1E946113EA50169729F96CDF346();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prop_Elevator_Skeleton_AnimBlueprint_C">();
	}
	static class UProp_Elevator_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProp_Elevator_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UProp_Elevator_Skeleton_AnimBlueprint_C) == 0x000008, "Wrong alignment on UProp_Elevator_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UProp_Elevator_Skeleton_AnimBlueprint_C) == 0x000930, "Wrong size on UProp_Elevator_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000360, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_F657DBCA4BCDED925D5767AA59C1292C) == 0x000368, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_F657DBCA4BCDED925D5767AA59C1292C' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_59D5B1E946113EA50169729F96CDF346) == 0x0003A8, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_59D5B1E946113EA50169729F96CDF346' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_ADB0A1EF4B6EF69BDAF1B3A8C7400D99) == 0x0003F0, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_ADB0A1EF4B6EF69BDAF1B3A8C7400D99' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_5ABCFC614C4ADB50D44168B3DDD691C5) == 0x000438, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_5ABCFC614C4ADB50D44168B3DDD691C5' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_TransitionResult_E01D1C784893E867405F248C317B75CE) == 0x000480, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_TransitionResult_E01D1C784893E867405F248C317B75CE' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_FD23BA5145DD3EA04B8234A39CA01633) == 0x0004C8, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_FD23BA5145DD3EA04B8234A39CA01633' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_253930DD4DF520894F87C3A62597AC5C) == 0x000568, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_253930DD4DF520894F87C3A62597AC5C' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_899246F84FB18D0DC4BE35988364E8C4) == 0x0005A8, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_899246F84FB18D0DC4BE35988364E8C4' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_B019EB604C3E54F69558B1845AF9565F) == 0x000648, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_B019EB604C3E54F69558B1845AF9565F' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_97A1D38642E753E7BBE2C0862C68D0CB) == 0x000688, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_97A1D38642E753E7BBE2C0862C68D0CB' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_E101E8784190941C92A1E9B28170F82D) == 0x000728, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_E101E8784190941C92A1E9B28170F82D' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer_F69018A54C104CECEFC39CBE9B849453) == 0x000768, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer_F69018A54C104CECEFC39CBE9B849453' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult_DF56640E40EFAB876FE698A58DE20169) == 0x000808, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult_DF56640E40EFAB876FE698A58DE20169' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine_090C34B24EEDEDEB96AB67AC25F94F1B) == 0x000848, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine_090C34B24EEDEDEB96AB67AC25F94F1B' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, IsOpen) == 0x000928, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::IsOpen' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, IsRolling) == 0x000929, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::IsRolling' has a wrong offset!");
static_assert(offsetof(UProp_Elevator_Skeleton_AnimBlueprint_C, IsRollingCouldStop) == 0x00092A, "Member 'UProp_Elevator_Skeleton_AnimBlueprint_C::IsRollingCouldStop' has a wrong offset!");

}

