#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: scoreType

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct scoreType.scoreType
// 0x004C (0x004C - 0x0000)
struct FscoreType final
{
public:
	int32                                         SentryRiotHead_19_153056704AF4F7B6E8C6A9A453BB0D40; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SentryRiotBody_20_20C3C6F64FC340E904F01CB6044094FC; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SpgBody_21_47D2332B4AF7D695CB3FB698BD0938DC;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillSentryRiot_48_7D8922C94D1A61951FB5E894189C3E9E; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillSpg_47_EA0ABD334127D25471CD1B8388FE8527;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitHelicopterMissile_23_370BA44E4A92B8DCDFB4368FA00B2410; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitHelicopterMissileMax_34_9B328C13460550C251625797194A29A3; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossNormal_24_AC1861E849A54EF11705C4932969557A;    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossDodge_30_1F5F16964D815E8213D815AC9751B340;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossDodgeMax_36_A2D112AC45E19164790AB3A0AECA1B77;  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossCore_25_57B74D5A4C688E8835012383776C72ED;      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TerminatePlsma_26_1D27C0A240A3FB2ED72935A5812E517F; // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TerminatePlsmaMax_38_B4FB130B4F580ACD2E6128BEB9211CE0; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillBoss_27_DE0BA16E49492C6981477B97E0B8983B;      // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalTimeBonus_40_0BC3C4A1407762D5872F25B4E2B34022; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalDodgoBonus_42_FB8C1AF04881B102841669A81C774726; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GetHurtScore_44_E652B296478FC10B64F4ED98BC00E050;  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossAssistMaxCount_51_401BE5BA48F3D6226FB6E8BF56081484; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CheckpointBonus_54_5C2A1BF14EE320156C2592853C9B1742; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FscoreType) == 0x000004, "Wrong alignment on FscoreType");
static_assert(sizeof(FscoreType) == 0x00004C, "Wrong size on FscoreType");
static_assert(offsetof(FscoreType, SentryRiotHead_19_153056704AF4F7B6E8C6A9A453BB0D40) == 0x000000, "Member 'FscoreType::SentryRiotHead_19_153056704AF4F7B6E8C6A9A453BB0D40' has a wrong offset!");
static_assert(offsetof(FscoreType, SentryRiotBody_20_20C3C6F64FC340E904F01CB6044094FC) == 0x000004, "Member 'FscoreType::SentryRiotBody_20_20C3C6F64FC340E904F01CB6044094FC' has a wrong offset!");
static_assert(offsetof(FscoreType, SpgBody_21_47D2332B4AF7D695CB3FB698BD0938DC) == 0x000008, "Member 'FscoreType::SpgBody_21_47D2332B4AF7D695CB3FB698BD0938DC' has a wrong offset!");
static_assert(offsetof(FscoreType, KillSentryRiot_48_7D8922C94D1A61951FB5E894189C3E9E) == 0x00000C, "Member 'FscoreType::KillSentryRiot_48_7D8922C94D1A61951FB5E894189C3E9E' has a wrong offset!");
static_assert(offsetof(FscoreType, KillSpg_47_EA0ABD334127D25471CD1B8388FE8527) == 0x000010, "Member 'FscoreType::KillSpg_47_EA0ABD334127D25471CD1B8388FE8527' has a wrong offset!");
static_assert(offsetof(FscoreType, HitHelicopterMissile_23_370BA44E4A92B8DCDFB4368FA00B2410) == 0x000014, "Member 'FscoreType::HitHelicopterMissile_23_370BA44E4A92B8DCDFB4368FA00B2410' has a wrong offset!");
static_assert(offsetof(FscoreType, HitHelicopterMissileMax_34_9B328C13460550C251625797194A29A3) == 0x000018, "Member 'FscoreType::HitHelicopterMissileMax_34_9B328C13460550C251625797194A29A3' has a wrong offset!");
static_assert(offsetof(FscoreType, BossNormal_24_AC1861E849A54EF11705C4932969557A) == 0x00001C, "Member 'FscoreType::BossNormal_24_AC1861E849A54EF11705C4932969557A' has a wrong offset!");
static_assert(offsetof(FscoreType, BossDodge_30_1F5F16964D815E8213D815AC9751B340) == 0x000020, "Member 'FscoreType::BossDodge_30_1F5F16964D815E8213D815AC9751B340' has a wrong offset!");
static_assert(offsetof(FscoreType, BossDodgeMax_36_A2D112AC45E19164790AB3A0AECA1B77) == 0x000024, "Member 'FscoreType::BossDodgeMax_36_A2D112AC45E19164790AB3A0AECA1B77' has a wrong offset!");
static_assert(offsetof(FscoreType, BossCore_25_57B74D5A4C688E8835012383776C72ED) == 0x000028, "Member 'FscoreType::BossCore_25_57B74D5A4C688E8835012383776C72ED' has a wrong offset!");
static_assert(offsetof(FscoreType, TerminatePlsma_26_1D27C0A240A3FB2ED72935A5812E517F) == 0x00002C, "Member 'FscoreType::TerminatePlsma_26_1D27C0A240A3FB2ED72935A5812E517F' has a wrong offset!");
static_assert(offsetof(FscoreType, TerminatePlsmaMax_38_B4FB130B4F580ACD2E6128BEB9211CE0) == 0x000030, "Member 'FscoreType::TerminatePlsmaMax_38_B4FB130B4F580ACD2E6128BEB9211CE0' has a wrong offset!");
static_assert(offsetof(FscoreType, KillBoss_27_DE0BA16E49492C6981477B97E0B8983B) == 0x000034, "Member 'FscoreType::KillBoss_27_DE0BA16E49492C6981477B97E0B8983B' has a wrong offset!");
static_assert(offsetof(FscoreType, TotalTimeBonus_40_0BC3C4A1407762D5872F25B4E2B34022) == 0x000038, "Member 'FscoreType::TotalTimeBonus_40_0BC3C4A1407762D5872F25B4E2B34022' has a wrong offset!");
static_assert(offsetof(FscoreType, TotalDodgoBonus_42_FB8C1AF04881B102841669A81C774726) == 0x00003C, "Member 'FscoreType::TotalDodgoBonus_42_FB8C1AF04881B102841669A81C774726' has a wrong offset!");
static_assert(offsetof(FscoreType, GetHurtScore_44_E652B296478FC10B64F4ED98BC00E050) == 0x000040, "Member 'FscoreType::GetHurtScore_44_E652B296478FC10B64F4ED98BC00E050' has a wrong offset!");
static_assert(offsetof(FscoreType, BossAssistMaxCount_51_401BE5BA48F3D6226FB6E8BF56081484) == 0x000044, "Member 'FscoreType::BossAssistMaxCount_51_401BE5BA48F3D6226FB6E8BF56081484' has a wrong offset!");
static_assert(offsetof(FscoreType, CheckpointBonus_54_5C2A1BF14EE320156C2592853C9B1742) == 0x000048, "Member 'FscoreType::CheckpointBonus_54_5C2A1BF14EE320156C2592853C9B1742' has a wrong offset!");

}

