#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sedan_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "PhysXVehicles_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Sedan_AnimBP.Sedan_AnimBP_C
// 0x01C0 (0x0AC0 - 0x0900)
class USedan_AnimBP_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0900(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_43D350A7435B3CA46873A7A6347A4E28; // 0x0908(0x0040)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3AC97E634436D181C0FED4A1947D23A2; // 0x0948(0x0040)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_68CA065C4D85A0F6F0D969937578703A; // 0x0988(0x0030)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_59F528E54CC269A13006B2A067370ECB; // 0x09B8(0x0108)()

public:
	void ExecuteUbergraph_Sedan_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sedan_AnimBP_C">();
	}
	static class USedan_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USedan_AnimBP_C>();
	}
};
static_assert(alignof(USedan_AnimBP_C) == 0x000008, "Wrong alignment on USedan_AnimBP_C");
static_assert(sizeof(USedan_AnimBP_C) == 0x000AC0, "Wrong size on USedan_AnimBP_C");
static_assert(offsetof(USedan_AnimBP_C, UberGraphFrame) == 0x000900, "Member 'USedan_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USedan_AnimBP_C, AnimGraphNode_Root_43D350A7435B3CA46873A7A6347A4E28) == 0x000908, "Member 'USedan_AnimBP_C::AnimGraphNode_Root_43D350A7435B3CA46873A7A6347A4E28' has a wrong offset!");
static_assert(offsetof(USedan_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3AC97E634436D181C0FED4A1947D23A2) == 0x000948, "Member 'USedan_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3AC97E634436D181C0FED4A1947D23A2' has a wrong offset!");
static_assert(offsetof(USedan_AnimBP_C, AnimGraphNode_MeshRefPose_68CA065C4D85A0F6F0D969937578703A) == 0x000988, "Member 'USedan_AnimBP_C::AnimGraphNode_MeshRefPose_68CA065C4D85A0F6F0D969937578703A' has a wrong offset!");
static_assert(offsetof(USedan_AnimBP_C, AnimGraphNode_WheelHandler_59F528E54CC269A13006B2A067370ECB) == 0x0009B8, "Member 'USedan_AnimBP_C::AnimGraphNode_WheelHandler_59F528E54CC269A13006B2A067370ECB' has a wrong offset!");

}

