#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SiliconRising

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "SiliconRising_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "PhysXVehicles_classes.hpp"


namespace SDK
{

// Class SiliconRising.ClipAnimInstance
// 0x0018 (0x0370 - 0x0358)
class UClipAnimInstance : public UAnimInstance
{
public:
	float                                         fAnimOffset;                                       // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpaceBase*                        AnimOffset_Clip;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Idle;                                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ClipAnimInstance">();
	}
	static class UClipAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UClipAnimInstance>();
	}
};
static_assert(alignof(UClipAnimInstance) == 0x000008, "Wrong alignment on UClipAnimInstance");
static_assert(sizeof(UClipAnimInstance) == 0x000370, "Wrong size on UClipAnimInstance");
static_assert(offsetof(UClipAnimInstance, fAnimOffset) == 0x000358, "Member 'UClipAnimInstance::fAnimOffset' has a wrong offset!");
static_assert(offsetof(UClipAnimInstance, AnimOffset_Clip) == 0x000360, "Member 'UClipAnimInstance::AnimOffset_Clip' has a wrong offset!");
static_assert(offsetof(UClipAnimInstance, Anim_Idle) == 0x000368, "Member 'UClipAnimInstance::Anim_Idle' has a wrong offset!");

// Class SiliconRising.FlatBuffersYYMsgObjectPropertyVector2
// 0x0000 (0x0028 - 0x0028)
class UFlatBuffersYYMsgObjectPropertyVector2 final : public UObject
{
public:
	static bool PackObjectPropertyVector2(class UObject* InWorldContextObject, const struct FYYMsgObjectPropertyVector2& InUE4Data, TArray<uint8>* OutData);
	static bool UnpackObjectPropertyVector2(class UObject* InWorldContextObject, const TArray<uint8>& InData, struct FYYMsgObjectPropertyVector2* OutUE4Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlatBuffersYYMsgObjectPropertyVector2">();
	}
	static class UFlatBuffersYYMsgObjectPropertyVector2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlatBuffersYYMsgObjectPropertyVector2>();
	}
};
static_assert(alignof(UFlatBuffersYYMsgObjectPropertyVector2) == 0x000008, "Wrong alignment on UFlatBuffersYYMsgObjectPropertyVector2");
static_assert(sizeof(UFlatBuffersYYMsgObjectPropertyVector2) == 0x000028, "Wrong size on UFlatBuffersYYMsgObjectPropertyVector2");

// Class SiliconRising.ASensitiveCharacter
// 0x0000 (0x0740 - 0x0740)
class AASensitiveCharacter : public ACharacter
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ASensitiveCharacter">();
	}
	static class AASensitiveCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AASensitiveCharacter>();
	}
};
static_assert(alignof(AASensitiveCharacter) == 0x000010, "Wrong alignment on AASensitiveCharacter");
static_assert(sizeof(AASensitiveCharacter) == 0x000740, "Wrong size on AASensitiveCharacter");

// Class SiliconRising.FlatBuffersYYMsgObjectRecordString
// 0x0000 (0x0028 - 0x0028)
class UFlatBuffersYYMsgObjectRecordString final : public UObject
{
public:
	static bool PackObjectRecordString(class UObject* InWorldContextObject, const struct FYYMsgObjectRecordString& InUE4Data, TArray<uint8>* OutData);
	static bool UnpackObjectRecordString(class UObject* InWorldContextObject, const TArray<uint8>& InData, struct FYYMsgObjectRecordString* OutUE4Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlatBuffersYYMsgObjectRecordString">();
	}
	static class UFlatBuffersYYMsgObjectRecordString* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlatBuffersYYMsgObjectRecordString>();
	}
};
static_assert(alignof(UFlatBuffersYYMsgObjectRecordString) == 0x000008, "Wrong alignment on UFlatBuffersYYMsgObjectRecordString");
static_assert(sizeof(UFlatBuffersYYMsgObjectRecordString) == 0x000028, "Wrong size on UFlatBuffersYYMsgObjectRecordString");

// Class SiliconRising.BTT_MoveToBlackboardBase
// 0x0018 (0x00B8 - 0x00A0)
class UBTT_MoveToBlackboardBase : public UBTTask_BlueprintBase
{
public:
	uint8                                         Pad_A0[0x18];                                      // 0x00A0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BindReceiveMoveCompleted(class AAIController* AI_Controller);
	void ReceiveMoveCompleted(EPathFollowingResult Result);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BTT_MoveToBlackboardBase">();
	}
	static class UBTT_MoveToBlackboardBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_MoveToBlackboardBase>();
	}
};
static_assert(alignof(UBTT_MoveToBlackboardBase) == 0x000008, "Wrong alignment on UBTT_MoveToBlackboardBase");
static_assert(sizeof(UBTT_MoveToBlackboardBase) == 0x0000B8, "Wrong size on UBTT_MoveToBlackboardBase");

// Class SiliconRising.FlatBuffersYYMsgObjectRecordByte
// 0x0000 (0x0028 - 0x0028)
class UFlatBuffersYYMsgObjectRecordByte final : public UObject
{
public:
	static bool PackObjectRecordByte(class UObject* InWorldContextObject, const struct FYYMsgObjectRecordByte& InUE4Data, TArray<uint8>* OutData);
	static bool UnpackObjectRecordByte(class UObject* InWorldContextObject, const TArray<uint8>& InData, struct FYYMsgObjectRecordByte* OutUE4Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlatBuffersYYMsgObjectRecordByte">();
	}
	static class UFlatBuffersYYMsgObjectRecordByte* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlatBuffersYYMsgObjectRecordByte>();
	}
};
static_assert(alignof(UFlatBuffersYYMsgObjectRecordByte) == 0x000008, "Wrong alignment on UFlatBuffersYYMsgObjectRecordByte");
static_assert(sizeof(UFlatBuffersYYMsgObjectRecordByte) == 0x000028, "Wrong size on UFlatBuffersYYMsgObjectRecordByte");

// Class SiliconRising.CharacterCamp
// 0x0018 (0x0108 - 0x00F0)
class UCharacterCamp final : public UActorComponent
{
public:
	EPawnCamp                                     MyCamp;                                            // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CanBeAttacked;                                     // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCampConfig>                    Config;                                            // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterCamp">();
	}
	static class UCharacterCamp* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterCamp>();
	}
};
static_assert(alignof(UCharacterCamp) == 0x000008, "Wrong alignment on UCharacterCamp");
static_assert(sizeof(UCharacterCamp) == 0x000108, "Wrong size on UCharacterCamp");
static_assert(offsetof(UCharacterCamp, MyCamp) == 0x0000F0, "Member 'UCharacterCamp::MyCamp' has a wrong offset!");
static_assert(offsetof(UCharacterCamp, CanBeAttacked) == 0x0000F1, "Member 'UCharacterCamp::CanBeAttacked' has a wrong offset!");
static_assert(offsetof(UCharacterCamp, Config) == 0x0000F8, "Member 'UCharacterCamp::Config' has a wrong offset!");

// Class SiliconRising.FlatBuffersYYMsgObjectRecordObject
// 0x0000 (0x0028 - 0x0028)
class UFlatBuffersYYMsgObjectRecordObject final : public UObject
{
public:
	static bool PackObjectRecordObject(class UObject* InWorldContextObject, const struct FYYMsgObjectRecordObject& InUE4Data, TArray<uint8>* OutData);
	static bool UnpackObjectRecordObject(class UObject* InWorldContextObject, const TArray<uint8>& InData, struct FYYMsgObjectRecordObject* OutUE4Data);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FlatBuffersYYMsgObjectRecordObject">();
	}
	static class UFlatBuffersYYMsgObjectRecordObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlatBuffersYYMsgObjectRecordObject>();
	}
};
static_assert(alignof(UFlatBuffersYYMsgObjectRecordObject) == 0x000008, "Wrong alignment on UFlatBuffersYYMsgObjectRecordObject");
static_assert(sizeof(UFlatBuffersYYMsgObjectRecordObject) == 0x000028, "Wrong size on UFlatBuffersYYMsgObjectRecordObject");

// Class SiliconRising.CharacterHandAnimInstance
// 0x0028 (0x0380 - 0x0358)
class UCharacterHandAnimInstance : public UAnimInstance
{
public:
	EItemTypes                                    eHoldWeaponType;                                   // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemTypes                                    eCarryWeaponClipType;                              // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsHold;                                           // 0x035A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBothHand;                                       // 0x035B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsPullBolt;                                       // 0x035C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemTypes                                    ePullBoltType;                                     // 0x035D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsCarryClip;                                      // 0x035E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35F[0x1];                                      // 0x035F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                vHandLocationOffset;                               // 0x0360(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               rHandRotationOffset;                               // 0x036C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bIsPushClip;                                       // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CharacterHandAnimInstance">();
	}
	static class UCharacterHandAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterHandAnimInstance>();
	}
};
static_assert(alignof(UCharacterHandAnimInstance) == 0x000008, "Wrong alignment on UCharacterHandAnimInstance");
static_assert(sizeof(UCharacterHandAnimInstance) == 0x000380, "Wrong size on UCharacterHandAnimInstance");
static_assert(offsetof(UCharacterHandAnimInstance, eHoldWeaponType) == 0x000358, "Member 'UCharacterHandAnimInstance::eHoldWeaponType' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, eCarryWeaponClipType) == 0x000359, "Member 'UCharacterHandAnimInstance::eCarryWeaponClipType' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, bIsHold) == 0x00035A, "Member 'UCharacterHandAnimInstance::bIsHold' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, bIsBothHand) == 0x00035B, "Member 'UCharacterHandAnimInstance::bIsBothHand' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, bIsPullBolt) == 0x00035C, "Member 'UCharacterHandAnimInstance::bIsPullBolt' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, ePullBoltType) == 0x00035D, "Member 'UCharacterHandAnimInstance::ePullBoltType' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, bIsCarryClip) == 0x00035E, "Member 'UCharacterHandAnimInstance::bIsCarryClip' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, vHandLocationOffset) == 0x000360, "Member 'UCharacterHandAnimInstance::vHandLocationOffset' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, rHandRotationOffset) == 0x00036C, "Member 'UCharacterHandAnimInstance::rHandRotationOffset' has a wrong offset!");
static_assert(offsetof(UCharacterHandAnimInstance, bIsPushClip) == 0x000378, "Member 'UCharacterHandAnimInstance::bIsPushClip' has a wrong offset!");

// Class SiliconRising.CommandLineParametersBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UCommandLineParametersBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AppendToCommandLine(const class FString& argument);
	static bool CommandLineArgIntValue(const class FString& Key, int32* Value);
	static bool CommandLineArgPresent(const class FString& Key);
	static bool CommandLineArgValue(const class FString& Key, class FString* Value);
	static class FString GetFullCommandLine();
	static class FString GetOriginalCommandLine();
	static bool SetFullCommandLine(const class FString& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CommandLineParametersBPLibrary">();
	}
	static class UCommandLineParametersBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandLineParametersBPLibrary>();
	}
};
static_assert(alignof(UCommandLineParametersBPLibrary) == 0x000008, "Wrong alignment on UCommandLineParametersBPLibrary");
static_assert(sizeof(UCommandLineParametersBPLibrary) == 0x000028, "Wrong size on UCommandLineParametersBPLibrary");

// Class SiliconRising.CryptBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UCryptBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<uint8> AES_CBC_DecryptBytesArray(const TArray<uint8>& BytesArray, const TArray<uint8>& InitiationVector);
	static class FString AES_CBC_DecryptBytesArrayToString(const TArray<uint8>& BytesArray, const TArray<uint8>& InitiationVector);
	static TArray<uint8> AES_CBC_EncryptBytesArray(const TArray<uint8>& BytesArray, const TArray<uint8>& InitiationVector);
	static TArray<uint8> AES_CBC_EncryptStringToBytesArray(const class FString& String, const TArray<uint8>& InitiationVector);
	static TArray<uint8> AES_CTR_BytesArray(const TArray<uint8>& BytesArray, const TArray<uint8>& InitiationVector);
	static class FString AES_CTR_String(const class FString& String, const TArray<uint8>& InitiationVector);
	static TArray<uint8> AES_ECB_DecryptBytesArray(const TArray<uint8>& BytesArray);
	static class FString AES_ECB_DecryptBytesArrayToString(const TArray<uint8>& BytesArray);
	static TArray<uint8> AES_ECB_EncryptBytesArray(const TArray<uint8>& BytesArray);
	static TArray<uint8> AES_ECB_EncryptStringToBytesArray(const class FString& String);
	static TArray<uint8> Base64DecodeFromBytesArrayToBytesArray(const TArray<uint8>& BytesArray);
	static class FString Base64DecodeFromBytesArrayToString(const TArray<uint8>& BytesArray);
	static TArray<uint8> Base64DecodeFromStringToBytesArray(const class FString& Source);
	static class FString Base64DecodeFromStringToString(const class FString& Source);
	static class FString Base64EncodeFromBytesArray(const TArray<uint8>& BytesArray);
	static class FString Base64EncodeFromString(const class FString& Source);
	static int32 BinToDec(const class FString& BinaryString);
	static TArray<uint8> CaesarDecryptBytesArray(const TArray<uint8>& BytesArray);
	static class FString CaesarDecryptString(const class FString& String);
	static TArray<uint8> CaesarEncryptBytesArray(const TArray<uint8>& BytesArray);
	static class FString CaesarEncryptString(const class FString& String);
	static class FString ConvertBytesToString(const TArray<uint8>& Bytes);
	static TArray<uint8> ConvertStringToBytes(const class FString& String);
	static class FString DecToBin(int32 Integer);
	static class FString DecToHex(int32 Integer);
	static int32 HexToDec(const class FString& HexadecimalString);
	static void InitializeKeysByte(const uint8 CaesarKey, const TArray<uint8>& XORKey, const TArray<uint8>& AESKey);
	static void InitializeKeysString(const uint8 CaesarKey, const class FString& XORKey, const class FString& AESKey);
	static class FString PKCS7Padding(const class FString& Source);
	static TArray<uint8> PKCS7PaddingForArray(const TArray<uint8>& Source);
	static class FString PKCS7Unpadding(const class FString& Source);
	static TArray<uint8> PKCS7UnpaddingForArray(const TArray<uint8>& Source);
	static class FString RSADecrypt(const class FString& Key, const class FString& Content, bool bPublic);
	static TArray<uint8> RSADecryptForArray(const class FString& Key, const TArray<uint8>& Content, bool bPublic);
	static class FString RSAEncrypt(const class FString& Key, const class FString& Content, bool bPublic);
	static TArray<uint8> RSAEncryptForArray(const class FString& Key, const TArray<uint8>& Content, bool bPublic);
	static TArray<uint8> XORBytesArray(const TArray<uint8>& BytesArray);
	static class FString XORString(const class FString& String);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"CryptBPLibrary">();
	}
	static class UCryptBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCryptBPLibrary>();
	}
};
static_assert(alignof(UCryptBPLibrary) == 0x000008, "Wrong alignment on UCryptBPLibrary");
static_assert(sizeof(UCryptBPLibrary) == 0x000028, "Wrong size on UCryptBPLibrary");

// Class SiliconRising.HttpUtilities
// 0x0128 (0x0450 - 0x0328)
class AHttpUtilities : public AActor
{
public:
	uint8                                         Pad_328[0x48];                                     // 0x0328(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 strChannelID;                                      // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 strGameID;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsPrintDebug;                                      // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_391[0x17];                                     // 0x0391(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringResponse;                                    // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringResponseErrno;                               // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLeaderBoardData>               ListLeaderBoard;                                   // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FSteamUserData>                 ListSteamUserData;                                 // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FPlayerTopInfo                         PlayerTopInfo;                                     // 0x03E8(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 pageID;                                            // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         totalPage;                                         // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         currentPage;                                       // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetCurrentLanguage();
	void GetJsonFromUrl(const class FString& URL, const TDelegate<void(bool Success)>& Callback);
	void GetLeaderBoardData(const class FString& URL, const TArray<class FString>& Data, const TDelegate<void(bool Success)>& Callback);
	TArray<struct FLeaderBoardData> GetListLeaderBoard();
	class FString GetPageID();
	struct FPlayerTopInfo GetPlayerTopInfo();
	void GetSteamUserHeadUrl(const class FString& URL, const TDelegate<void(bool Success)>& Callback);
	class FString GetStringErrorNumber();
	class FString GetStringFromJson(const class FString& JsonKey);
	class FString GetStringFromJsonFields(const TArray<class FString>& JsonField, const class FString& JsonKey, bool* isOK);
	class FString GetStringResponse();
	void Login(const class FString& URL, const TMap<class FString, class FString>& ExtraData, const TDelegate<void(bool Success)>& Callback);
	void PostUrl(const class FString& URL, const class FString& Data, const TDelegate<void(bool Success)>& Callback);
	void SendScore(const class FString& URL, const TArray<class FString>& Data, const TDelegate<void(bool Success)>& Callback);
	void VerifyGame(const class FString& URL, const TMap<class FString, class FString>& ExtraData, const TDelegate<void(bool Success)>& Callback);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HttpUtilities">();
	}
	static class AHttpUtilities* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHttpUtilities>();
	}
};
static_assert(alignof(AHttpUtilities) == 0x000008, "Wrong alignment on AHttpUtilities");
static_assert(sizeof(AHttpUtilities) == 0x000450, "Wrong size on AHttpUtilities");
static_assert(offsetof(AHttpUtilities, strChannelID) == 0x000370, "Member 'AHttpUtilities::strChannelID' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, strGameID) == 0x000380, "Member 'AHttpUtilities::strGameID' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, IsPrintDebug) == 0x000390, "Member 'AHttpUtilities::IsPrintDebug' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, StringResponse) == 0x0003A8, "Member 'AHttpUtilities::StringResponse' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, StringResponseErrno) == 0x0003B8, "Member 'AHttpUtilities::StringResponseErrno' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, ListLeaderBoard) == 0x0003C8, "Member 'AHttpUtilities::ListLeaderBoard' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, ListSteamUserData) == 0x0003D8, "Member 'AHttpUtilities::ListSteamUserData' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, PlayerTopInfo) == 0x0003E8, "Member 'AHttpUtilities::PlayerTopInfo' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, pageID) == 0x000438, "Member 'AHttpUtilities::pageID' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, totalPage) == 0x000448, "Member 'AHttpUtilities::totalPage' has a wrong offset!");
static_assert(offsetof(AHttpUtilities, currentPage) == 0x00044C, "Member 'AHttpUtilities::currentPage' has a wrong offset!");

// Class SiliconRising.Mer2GameInstanceBase
// 0x0010 (0x00B0 - 0x00A0)
class UMer2GameInstanceBase : public UGameInstance
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mer2GameInstanceBase">();
	}
	static class UMer2GameInstanceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMer2GameInstanceBase>();
	}
};
static_assert(alignof(UMer2GameInstanceBase) == 0x000008, "Wrong alignment on UMer2GameInstanceBase");
static_assert(sizeof(UMer2GameInstanceBase) == 0x0000B0, "Wrong size on UMer2GameInstanceBase");

// Class SiliconRising.Mer2WheeldVehicle
// 0x0010 (0x0398 - 0x0388)
class AMer2WheeldVehicle : public APawn
{
public:
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0388(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWheeledVehicleMovementComponent*       VehicleMovement;                                   // 0x0390(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mer2WheeldVehicle">();
	}
	static class AMer2WheeldVehicle* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMer2WheeldVehicle>();
	}
};
static_assert(alignof(AMer2WheeldVehicle) == 0x000008, "Wrong alignment on AMer2WheeldVehicle");
static_assert(sizeof(AMer2WheeldVehicle) == 0x000398, "Wrong size on AMer2WheeldVehicle");
static_assert(offsetof(AMer2WheeldVehicle, Mesh) == 0x000388, "Member 'AMer2WheeldVehicle::Mesh' has a wrong offset!");
static_assert(offsetof(AMer2WheeldVehicle, VehicleMovement) == 0x000390, "Member 'AMer2WheeldVehicle::VehicleMovement' has a wrong offset!");

// Class SiliconRising.Mer2WheeledVehicleMovement4W
// 0x0000 (0x0428 - 0x0428)
class UMer2WheeledVehicleMovement4W final : public UWheeledVehicleMovementComponent4W
{
public:
	float GetEngineMaxRPM();
	float GetFinalSteeringInput();
	void SetEngineMaxRPM(float fRPM);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mer2WheeledVehicleMovement4W">();
	}
	static class UMer2WheeledVehicleMovement4W* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMer2WheeledVehicleMovement4W>();
	}
};
static_assert(alignof(UMer2WheeledVehicleMovement4W) == 0x000008, "Wrong alignment on UMer2WheeledVehicleMovement4W");
static_assert(sizeof(UMer2WheeledVehicleMovement4W) == 0x000428, "Wrong size on UMer2WheeledVehicleMovement4W");

// Class SiliconRising.Mer2_PVP_PlayerController
// 0x0008 (0x0680 - 0x0678)
class AMer2_PVP_PlayerController : public APlayerController
{
public:
	bool                                          IsNeedDestroyPawnWhileLeavingGame;                 // 0x0678(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mer2_PVP_PlayerController">();
	}
	static class AMer2_PVP_PlayerController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMer2_PVP_PlayerController>();
	}
};
static_assert(alignof(AMer2_PVP_PlayerController) == 0x000008, "Wrong alignment on AMer2_PVP_PlayerController");
static_assert(sizeof(AMer2_PVP_PlayerController) == 0x000680, "Wrong size on AMer2_PVP_PlayerController");
static_assert(offsetof(AMer2_PVP_PlayerController, IsNeedDestroyPawnWhileLeavingGame) == 0x000678, "Member 'AMer2_PVP_PlayerController::IsNeedDestroyPawnWhileLeavingGame' has a wrong offset!");

// Class SiliconRising.Mercenary2GameMode
// 0x0000 (0x03C8 - 0x03C8)
class AMercenary2GameMode final : public AGameModeBase
{
public:
	bool VerifyUserInfo(const class FString& strToken);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mercenary2GameMode">();
	}
	static class AMercenary2GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMercenary2GameMode>();
	}
};
static_assert(alignof(AMercenary2GameMode) == 0x000008, "Wrong alignment on AMercenary2GameMode");
static_assert(sizeof(AMercenary2GameMode) == 0x0003C8, "Wrong size on AMercenary2GameMode");

// Class SiliconRising.Mercenary2_PVP_GameMode
// 0x0010 (0x03D8 - 0x03C8)
class AMercenary2_PVP_GameMode : public AGameModeBase
{
public:
	uint8                                         Pad_3C8[0x10];                                     // 0x03C8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Evt_NewPlayerConnect(class APlayerController* NewPlayerController, const class FString& RoomName, const class FString& RoomID, const class FString& PlayerID);
	void ShutdownServer();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Mercenary2_PVP_GameMode">();
	}
	static class AMercenary2_PVP_GameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMercenary2_PVP_GameMode>();
	}
};
static_assert(alignof(AMercenary2_PVP_GameMode) == 0x000008, "Wrong alignment on AMercenary2_PVP_GameMode");
static_assert(sizeof(AMercenary2_PVP_GameMode) == 0x0003D8, "Wrong size on AMercenary2_PVP_GameMode");

// Class SiliconRising.ProjectileBase
// 0x0000 (0x0328 - 0x0328)
class AProjectileBase final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ProjectileBase">();
	}
	static class AProjectileBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectileBase>();
	}
};
static_assert(alignof(AProjectileBase) == 0x000008, "Wrong alignment on AProjectileBase");
static_assert(sizeof(AProjectileBase) == 0x000328, "Wrong size on AProjectileBase");

// Class SiliconRising.TcpSocketConnection
// 0x0040 (0x0368 - 0x0328)
class ATcpSocketConnection : public AActor
{
public:
	int32                                         SendBufferSize;                                    // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReceiveBufferSize;                                 // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeBetweenTicks;                                  // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_334[0x34];                                     // 0x0334(0x0034)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static TArray<uint8> Concat_BytesBytes(const TArray<uint8>& A, const TArray<uint8>& B);
	static TArray<uint8> Conv_ByteToBytes(uint8 InByte);
	static TArray<uint8> Conv_FloatToBytes(float InFloat);
	static TArray<uint8> Conv_IntToBytes(int32 inInt);
	static TArray<uint8> Conv_StringToBytes(const class FString& InStr);
	static uint8 Message_ReadByte(TArray<uint8>& Message);
	static float Message_ReadFloat(TArray<uint8>& Message);
	static int32 Message_ReadInt(TArray<uint8>& Message);
	static class FString Message_ReadString(TArray<uint8>& Message, int32 StringLength);

	void Connect(const class FString& ipAddress, int32 Port, const TDelegate<void(const class FString& ConnectionId)>& OnDisconnected, const TDelegate<void(const class FString& ConnectionId)>& OnConnected, const TDelegate<void(const class FString& ConnectionId, const TArray<uint8>& Message)>& OnMessageReceived, class FString* ConnectionId, bool bUniqueCheck, bool* bIsAlreadyConnected);
	void Disconnect(const class FString& ConnectionId);
	void DisconnectAll();
	bool SendData(const class FString& ConnectionId, const TArray<uint8>& DataToSend);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TcpSocketConnection">();
	}
	static class ATcpSocketConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATcpSocketConnection>();
	}
};
static_assert(alignof(ATcpSocketConnection) == 0x000008, "Wrong alignment on ATcpSocketConnection");
static_assert(sizeof(ATcpSocketConnection) == 0x000368, "Wrong size on ATcpSocketConnection");
static_assert(offsetof(ATcpSocketConnection, SendBufferSize) == 0x000328, "Member 'ATcpSocketConnection::SendBufferSize' has a wrong offset!");
static_assert(offsetof(ATcpSocketConnection, ReceiveBufferSize) == 0x00032C, "Member 'ATcpSocketConnection::ReceiveBufferSize' has a wrong offset!");
static_assert(offsetof(ATcpSocketConnection, TimeBetweenTicks) == 0x000330, "Member 'ATcpSocketConnection::TimeBetweenTicks' has a wrong offset!");

// Class SiliconRising.TcpPvpNetBaseActor
// 0x00D8 (0x0440 - 0x0368)
class ATcpPvpNetBaseActor : public ATcpSocketConnection
{
public:
	class FString                                 Client_Private_Key;                                // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Server_Public_Key;                                 // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerIP;                                          // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ServerPort;                                        // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39C[0xA4];                                     // 0x039C(0x00A4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnConnected(const class FString& ConnectionId);
	void OnDisconnect(const class FString& ConnectionId);
	void OnGameInstanceShutdown();
	void OnReceivedMessage(const class FString& ConnectionId, const TArray<uint8>& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TcpPvpNetBaseActor">();
	}
	static class ATcpPvpNetBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATcpPvpNetBaseActor>();
	}
};
static_assert(alignof(ATcpPvpNetBaseActor) == 0x000008, "Wrong alignment on ATcpPvpNetBaseActor");
static_assert(sizeof(ATcpPvpNetBaseActor) == 0x000440, "Wrong size on ATcpPvpNetBaseActor");
static_assert(offsetof(ATcpPvpNetBaseActor, Client_Private_Key) == 0x000368, "Member 'ATcpPvpNetBaseActor::Client_Private_Key' has a wrong offset!");
static_assert(offsetof(ATcpPvpNetBaseActor, Server_Public_Key) == 0x000378, "Member 'ATcpPvpNetBaseActor::Server_Public_Key' has a wrong offset!");
static_assert(offsetof(ATcpPvpNetBaseActor, ServerIP) == 0x000388, "Member 'ATcpPvpNetBaseActor::ServerIP' has a wrong offset!");
static_assert(offsetof(ATcpPvpNetBaseActor, ServerPort) == 0x000398, "Member 'ATcpPvpNetBaseActor::ServerPort' has a wrong offset!");

// Class SiliconRising.TcpPvpClientToBackendServer
// 0x0018 (0x0458 - 0x0440)
class ATcpPvpClientToBackendServer : public ATcpPvpNetBaseActor
{
public:
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckConnection();
	void ClearCurrentRoomInfo();
	void Evt_OnConnected();
	void Evt_OnDisconnect();
	void Evt_ReceiveMessage(const struct FYYMsgData& Message);
	struct FYYMsgIdent GetCurrentPlayerID();
	struct FYYMsgReqAckRoomInfo GetCurrentRoomInfo();
	void MsgID_MID_ACK_PINGPONG(const class FString& ConnectionId, int32 MsgID, const TArray<uint8>& Data);
	void OnRecieveAllMessage(const class FString& ConnectionId, int32 MsgID, const TArray<uint8>& Data);
	bool SendMessageToServer(const struct FYYMsgData& Message);
	void SetCurrentPlayerID(const struct FYYMsgIdent& Value);
	void SetCurrentRoomInfo(const struct FYYMsgReqAckRoomInfo& Value);
	bool StartConnectToServer(bool bUniqueCheck, bool* bIsAlreadyConnected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TcpPvpClientToBackendServer">();
	}
	static class ATcpPvpClientToBackendServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATcpPvpClientToBackendServer>();
	}
};
static_assert(alignof(ATcpPvpClientToBackendServer) == 0x000008, "Wrong alignment on ATcpPvpClientToBackendServer");
static_assert(sizeof(ATcpPvpClientToBackendServer) == 0x000458, "Wrong size on ATcpPvpClientToBackendServer");

// Class SiliconRising.TcpPvpServerToBackendServer
// 0x0018 (0x0458 - 0x0440)
class ATcpPvpServerToBackendServer : public ATcpPvpNetBaseActor
{
public:
	uint8                                         Pad_440[0x18];                                     // 0x0440(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Evt_OnConnected();
	void Evt_OnDisconnect();
	void Evt_ReceiveMessage(const struct FYYMsgData& Message);
	int32 GetServerRunPort();
	void MsgID_MID_ACK_PINGPONG(const class FString& ConnectionId, int32 MsgID, const TArray<uint8>& Data);
	void OnRecieveAllMessage(const class FString& ConnectionId, int32 MsgID, const TArray<uint8>& Data);
	bool SendMessageToServer(const struct FYYMsgData& Message);
	bool StartConnectToServer(bool bUniqueCheck, bool* bIsAlreadyConnected);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TcpPvpServerToBackendServer">();
	}
	static class ATcpPvpServerToBackendServer* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATcpPvpServerToBackendServer>();
	}
};
static_assert(alignof(ATcpPvpServerToBackendServer) == 0x000008, "Wrong alignment on ATcpPvpServerToBackendServer");
static_assert(sizeof(ATcpPvpServerToBackendServer) == 0x000458, "Wrong size on ATcpPvpServerToBackendServer");

// Class SiliconRising.TcpSocketSettings
// 0x0008 (0x0030 - 0x0028)
class UTcpSocketSettings final : public UObject
{
public:
	bool                                          bPostErrorsToMessageLog;                           // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TcpSocketSettings">();
	}
	static class UTcpSocketSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTcpSocketSettings>();
	}
};
static_assert(alignof(UTcpSocketSettings) == 0x000008, "Wrong alignment on UTcpSocketSettings");
static_assert(sizeof(UTcpSocketSettings) == 0x000030, "Wrong size on UTcpSocketSettings");
static_assert(offsetof(UTcpSocketSettings, bPostErrorsToMessageLog) == 0x000028, "Member 'UTcpSocketSettings::bPostErrorsToMessageLog' has a wrong offset!");

// Class SiliconRising.UtilityBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UUtilityBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FYYMsgInt64 Add_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static bool ChangeCurrentLevelToListen(class UObject* WorldContextObject);
	static class FString DecryptString(const class FString& String);
	static class FString DecryptStringKey(const class FString& String, const class FString& Key);
	static struct FYYMsgInt64 Divide_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static class FString EncryptString(const class FString& String);
	static class FString EncryptStringKey(const class FString& String, const class FString& Key);
	static bool EqualEqual_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static int32 GameBuildNumber();
	static int32 GameMajorNumber();
	static int32 GameMinorNumber();
	static int32 GamePatchNumber();
	static class FString GameVersionString();
	static class FString GetBuildMode();
	static class FString GetChannelID();
	static class FString GetCurrentWorldType();
	static class FString GetHMDMonitorName();
	static EVRHeadMountedDevicType_Mer2 GetHMDType();
	static class FString GetHostByName(const class FString& hostname);
	static class FString GetMachineID();
	static class FString GetPVPServerIP();
	static bool GetSteamAchievementsFromIni(TArray<struct FOnlineAchievementSteam>* OutArray);
	static class FString GetViveportHeadUrl();
	static class FString GetViveportID();
	static class FString GetViveportNickName();
	static int32 GetVRControllerDeviceID();
	static void GetVRDevicePropertyString(EVRDeviceProperty_String PropertyToRetrieve, int32 DeviceID, class FString* StringValue, EBPOVRResultSwitch* Result);
	static bool Greater_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static bool GreaterEqual_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static class FString Int64ToString(const struct FYYMsgInt64& Value);
	static bool IsDevelopmentMode();
	static bool IsPlayInEditor();
	static bool Less_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static bool LessEqual_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static struct FYYMsgInt64 Multiply_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static bool NotEqual_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static struct FYYMsgInt64 Percent_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);
	static void SetPlanarReflectionScreenPercentage(class UPlanarReflectionComponent* PlanarReflectionComponent, int32 nPercentage);
	static void SetPVPServerIP(const class FString& Value);
	static void SetViveportHeadUrl(const class FString& Value);
	static void SetViveportID(const class FString& Value);
	static void SetViveportIsGetUserData(bool Value);
	static void SetViveportNickName(const class FString& Value);
	static void SetViveportPassword(const class FString& Value);
	static void SortArrayWithDefault(const TArray<class UObject*>& inArray, TArray<class UObject*>* OutArray);
	static struct FYYMsgInt64 StringToInt64(const class FString& Value);
	static struct FYYMsgInt64 Subtract_FYYMsgInt64FYYMsgInt64(const struct FYYMsgInt64& A, const struct FYYMsgInt64& B);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UtilityBPLibrary">();
	}
	static class UUtilityBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUtilityBPLibrary>();
	}
};
static_assert(alignof(UUtilityBPLibrary) == 0x000008, "Wrong alignment on UUtilityBPLibrary");
static_assert(sizeof(UUtilityBPLibrary) == 0x000028, "Wrong size on UUtilityBPLibrary");

// Class SiliconRising.ViveportSDK
// 0x0040 (0x0368 - 0x0328)
class AViveportSDK : public AActor
{
public:
	uint8                                         Pad_328[0x40];                                     // 0x0328(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetIsDRMCheckOK();
	bool GetIsSDKCheckOK();
	void StartViveportSDK();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportSDK">();
	}
	static class AViveportSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<AViveportSDK>();
	}
};
static_assert(alignof(AViveportSDK) == 0x000008, "Wrong alignment on AViveportSDK");
static_assert(sizeof(AViveportSDK) == 0x000368, "Wrong size on AViveportSDK");

// Class SiliconRising.WeaponAnimInstance
// 0x00B8 (0x0410 - 0x0358)
class UWeaponAnimInstance : public UAnimInstance
{
public:
	bool                                          bTriggerFire;                                      // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerReload;                                    // 0x0359(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerClipEmpty;                                 // 0x035A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPullTrigger;                                      // 0x035B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fWaitTimer;                                        // 0x035C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fReloadTime;                                       // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fMaxReloadTime;                                    // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPullBolt;                                         // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         fPullBoltLength;                                   // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         fPullBoltLengthMax;                                // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTriggerContinuously;                              // 0x0374(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAnimOffset_BoltValid;                           // 0x0375(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsUseEmptyBoltPosition;                           // 0x0376(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_377[0x1];                                      // 0x0377(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                vEjectLocation;                                    // 0x0378(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSetEjectLocation;                               // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoltName;                                          // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   EjectName;                                         // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpaceBase*                        AnimOffset_Bolt;                                   // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_ClipEmpty;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Idle;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Firing;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Hold;                                         // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Reload1;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Reload2;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      Anim_Reload3;                                      // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D8[0x38];                                     // 0x03D8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeAnimState(EWState CurState, bool NewValue);
	struct FVector GetBoltCurrentOffset();
	struct FTransform GetBoltCurrentTransform();
	struct FTransform GetBoltInitTransform();
	void SetBoltInitTransform(const struct FTransform& InitTransform);
	void UpdateReloadDelay(float fDelta);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeaponAnimInstance">();
	}
	static class UWeaponAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponAnimInstance>();
	}
};
static_assert(alignof(UWeaponAnimInstance) == 0x000008, "Wrong alignment on UWeaponAnimInstance");
static_assert(sizeof(UWeaponAnimInstance) == 0x000410, "Wrong size on UWeaponAnimInstance");
static_assert(offsetof(UWeaponAnimInstance, bTriggerFire) == 0x000358, "Member 'UWeaponAnimInstance::bTriggerFire' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bTriggerReload) == 0x000359, "Member 'UWeaponAnimInstance::bTriggerReload' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bTriggerClipEmpty) == 0x00035A, "Member 'UWeaponAnimInstance::bTriggerClipEmpty' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bPullTrigger) == 0x00035B, "Member 'UWeaponAnimInstance::bPullTrigger' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, fWaitTimer) == 0x00035C, "Member 'UWeaponAnimInstance::fWaitTimer' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, fReloadTime) == 0x000360, "Member 'UWeaponAnimInstance::fReloadTime' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, fMaxReloadTime) == 0x000364, "Member 'UWeaponAnimInstance::fMaxReloadTime' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bPullBolt) == 0x000368, "Member 'UWeaponAnimInstance::bPullBolt' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, fPullBoltLength) == 0x00036C, "Member 'UWeaponAnimInstance::fPullBoltLength' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, fPullBoltLengthMax) == 0x000370, "Member 'UWeaponAnimInstance::fPullBoltLengthMax' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bTriggerContinuously) == 0x000374, "Member 'UWeaponAnimInstance::bTriggerContinuously' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bIsAnimOffset_BoltValid) == 0x000375, "Member 'UWeaponAnimInstance::bIsAnimOffset_BoltValid' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bIsUseEmptyBoltPosition) == 0x000376, "Member 'UWeaponAnimInstance::bIsUseEmptyBoltPosition' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, vEjectLocation) == 0x000378, "Member 'UWeaponAnimInstance::vEjectLocation' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, bIsSetEjectLocation) == 0x000384, "Member 'UWeaponAnimInstance::bIsSetEjectLocation' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, BoltName) == 0x000388, "Member 'UWeaponAnimInstance::BoltName' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, EjectName) == 0x000390, "Member 'UWeaponAnimInstance::EjectName' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, AnimOffset_Bolt) == 0x000398, "Member 'UWeaponAnimInstance::AnimOffset_Bolt' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_ClipEmpty) == 0x0003A0, "Member 'UWeaponAnimInstance::Anim_ClipEmpty' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Idle) == 0x0003A8, "Member 'UWeaponAnimInstance::Anim_Idle' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Firing) == 0x0003B0, "Member 'UWeaponAnimInstance::Anim_Firing' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Hold) == 0x0003B8, "Member 'UWeaponAnimInstance::Anim_Hold' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Reload1) == 0x0003C0, "Member 'UWeaponAnimInstance::Anim_Reload1' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Reload2) == 0x0003C8, "Member 'UWeaponAnimInstance::Anim_Reload2' has a wrong offset!");
static_assert(offsetof(UWeaponAnimInstance, Anim_Reload3) == 0x0003D0, "Member 'UWeaponAnimInstance::Anim_Reload3' has a wrong offset!");

// Class SiliconRising.WeaponBase
// 0x0000 (0x0328 - 0x0328)
class AWeaponBase final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeaponBase">();
	}
	static class AWeaponBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponBase>();
	}
};
static_assert(alignof(AWeaponBase) == 0x000008, "Wrong alignment on AWeaponBase");
static_assert(sizeof(AWeaponBase) == 0x000328, "Wrong size on AWeaponBase");

// Class SiliconRising.WinnerAnimInstance
// 0x0008 (0x0360 - 0x0358)
class UWinnerAnimInstance final : public UAnimInstance
{
public:
	bool                                          bShowWinAnim;                                      // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WinnerAnimInstance">();
	}
	static class UWinnerAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWinnerAnimInstance>();
	}
};
static_assert(alignof(UWinnerAnimInstance) == 0x000008, "Wrong alignment on UWinnerAnimInstance");
static_assert(sizeof(UWinnerAnimInstance) == 0x000360, "Wrong size on UWinnerAnimInstance");
static_assert(offsetof(UWinnerAnimInstance, bShowWinAnim) == 0x000358, "Member 'UWinnerAnimInstance::bShowWinAnim' has a wrong offset!");

// Class SiliconRising.FlatBuffersYYMsgIdent
// 0x0000 (0x0028 - 0x0028)
class UFlatBuffersYYMsgIdent final : public UObject
{
public:
	static bool PackIdent(class UObject* InWorldContextObject, const struct FYYMsgIdent& InUE4Data, TArray<uint8>* OutData);
	static bool UnpackIdent(class UObject* InWorldContextObject, const TArray<uint8>& InData, struct FYYMsgIdent* OutUE4Data);

