#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SiliconRising

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum SiliconRising.ECampState
// NumValues: 0x0004
enum class ECampState : uint8
{
	Opposite                                 = 0,
	Nuetrality                               = 1,
	Friendly                                 = 2,
	ECampState_MAX                           = 3,
};

// Enum SiliconRising.EPawnCamp
// NumValues: 0x0006
enum class EPawnCamp : uint8
{
	NoCamp                                   = 0,
	Empire                                   = 1,
	Guardian                                 = 2,
	Civilians                                = 3,
	Mercenary                                = 4,
	Max                                      = 5,
};

// Enum SiliconRising.EVRDeviceProperty_String
// NumValues: 0x0023
enum class EVRDeviceProperty_String : uint8
{
	Prop_TrackingSystemName_String_1000      = 0,
	Prop_ModelNumber_String_1001             = 1,
	Prop_SerialNumber_String_1002            = 2,
	Prop_RenderModelName_String_1003         = 3,
	Prop_ManufacturerName_String_1005        = 4,
	Prop_TrackingFirmwareVersion_String_1006 = 5,
	Prop_HardwareRevision_String_1007        = 6,
	Prop_AllWirelessDongleDescriptions_String_1008 = 7,
	Prop_ConnectedWirelessDongle_String_1009 = 8,
	Prop_Firmware_ManualUpdateURL_String_1016 = 9,
	Prop_Firmware_ProgrammingTarget_String_1028 = 10,
	Prop_DriverVersion_String_1031           = 11,
	Prop_ResourceRoot_String_1035            = 12,
	Prop_RegisteredDeviceType_String_1036    = 13,
	Prop_InputProfileName_String_1037        = 14,
	HMDProp_DisplayMCImageLeft_String_2012   = 15,
	HMDProp_DisplayMCImageRight_String_2013  = 16,
	HMDProp_DisplayGCImage_String_2021       = 17,
	HMDProp_CameraFirmwareDescription_String_2028 = 18,
	HMDProp_DriverProvidedChaperonePath_String_2048 = 19,
	ControllerProp_AttachedDeviceId_String_3000 = 20,
	TrackRefProp_ModeLabel_String_4006       = 21,
	UIProp_NamedIconPathDeviceOff_String_5001 = 22,
	UIProp_NamedIconPathDeviceSearching_String_5002 = 23,
	UIProp_NamedIconPathDeviceSearchingAlert_String_5003 = 24,
	UIProp_NamedIconPathDeviceReady_String_5004 = 25,
	UIProp_NamedIconPathDeviceReadyAlert_String_5005 = 26,
	UIProp_NamedIconPathDeviceNotReady_String_5006 = 27,
	UIProp_NamedIconPathDeviceStandby_String_5007 = 28,
	UIProp_NamedIconPathDeviceAlertLow_String_5008 = 29,
	DriverProp_UserConfigPath_String_6000    = 30,
	DriverProp_InstallPath_String_6001       = 31,
	DriverProp_ControllerType_String_7000    = 32,
	DriveerProp_LegacyInputProfile_String_7001 = 33,
	EVRDeviceProperty_MAX                    = 34,
};

// Enum SiliconRising.EVRHeadMountedDevicType_Mer2
// NumValues: 0x000A
enum class EVRHeadMountedDevicType_Mer2 : uint8
{
	HMD_Unknown                              = 0,
	HMD_SteamVR                              = 1,
	HMD_Vive                                 = 2,
	HMD_ViveCosmos                           = 3,
	HMD_WindowsMR                            = 4,
	HMD_OculusRift                           = 5,
	HMD_OculusRiftS                          = 6,
	HMD_OSVR                                 = 7,
	HMD_INDEX                                = 8,
	HMD_MAX                                  = 9,
};

// Enum SiliconRising.EBPOVRResultSwitch
// NumValues: 0x0003
enum class EBPOVRResultSwitch : uint8
{
	OnSucceeded                              = 0,
	OnFailed                                 = 1,
	EBPOVRResultSwitch_MAX                   = 2,
};

// Enum SiliconRising.EItemTypes
// NumValues: 0x0014
enum class EItemTypes : uint8
{
	NONE                                     = 0,
	WPN_GunAy                                = 1,
	WPN_Pistol                               = 2,
	WPN_Revolver                             = 3,
	WPN_Sniper                               = 4,
	WPN_NPC_GunAy                            = 5,
	WPN_NPC_Pistol                           = 6,
	WPN_NPC_Revolver                         = 7,
	WPN_AKM                                  = 8,
	WPN_AWM                                  = 9,
	WPN_M32                                  = 10,
	WPN_SCAR                                 = 11,
	WPN_RPG                                  = 12,
	WPN_SMG                                  = 13,
	WPN_Knife                                = 14,
	ITEM_Heal_Pack                           = 15,
	WPN_Shield                               = 16,
	ITEM_PowerUp                             = 17,
	WPN_AAC                                  = 18,
	EItemTypes_MAX                           = 19,
};

// Enum SiliconRising.WState
// NumValues: 0x0006
enum class EWState : uint8
{
	Idle                                     = 0,
	Firing                                   = 1,
	Reloading                                = 2,
	BulletOut                                = 3,
	TriggerOnly                              = 4,
	WState_MAX                               = 5,
};

// Enum SiliconRising.EYYMsgERoomStartResult
// NumValues: 0x000B
enum class EYYMsgERoomStartResult : uint8
{
	ERSR_NONE                                = 0,
	ERSR_FIND_SUITABLE_PVP_SERVER            = 1,
	ERSR_NO_SERVER                           = 2,
	ERSR_WAIT_TO_LOAD_PVP_SERVER             = 3,
	ERSR_PVP_SERVER_LOAD_FAILED              = 4,
	ERSR_PVP_SERVER_LOADED                   = 5,
	ERSR_ROOM_PLAYER_NOT_BALANCED            = 6,
	ERSR_NOT_MASTER                          = 7,
	ERSR_ROOMNAME_EMPTY                      = 8,
	ERSR_NO_ROOMINFO                         = 9,
	ERSR_MAX                                 = 10,
};

// Enum SiliconRising.EYYMsgECancelMatchResult
// NumValues: 0x0005
enum class EYYMsgECancelMatchResult : uint8
{
	ECMR_Ok                                  = 0,
	ECMR_FreeMan                             = 1,
	ECMR_Idle                                = 2,
	ECMR_Playing                             = 3,
	ECMR_MAX                                 = 4,
};

// Enum SiliconRising.EYYMsgEGameElementType
// NumValues: 0x0006
enum class EYYMsgEGameElementType : uint8
{
	EELEMENTTYPE_FIRE                        = 0,
	EELEMENTTYPE_LIGHT                       = 1,
	EELEMENTTYPE_WIND                        = 2,
	EELEMENTTYPE_ICE                         = 3,
	EELEMENTTYPE_POISON                      = 4,
	EELEMENTTYPE_MAX                         = 5,
};

// Enum SiliconRising.EYYMsgEPropertyType
// NumValues: 0x0004
enum class EYYMsgEPropertyType : uint8
{
	EPT_STRENGTH                             = 0,
	EPT_AGILITY                              = 1,
	EPT_INTELLIGENCE                         = 2,
	EPT_MAX                                  = 3,
};

// Enum SiliconRising.EYYMsgENPCType
// NumValues: 0x0004
enum class EYYMsgENPCType : uint8
{
	ENPCTYPE_NORMAL                          = 0,
	ENPCTYPE_HERO                            = 1,
	ENPCTYPE_TURRET                          = 2,
	ENPCTYPE_MAX                             = 3,
};

// Enum SiliconRising.EYYMsgERankType
// NumValues: 0x0006
enum class EYYMsgERankType : uint8
{
	ERT_PLAYER_LEVEL                         = 0,
	ERT_FIGHT_VALUE                          = 1,
	ERT_PLAYER_MONEY                         = 2,
	ERT_GUILD_LEVEL                          = 3,
	ERT_GUILD_KINGSOURCE                     = 4,
	ERT_MAX                                  = 5,
};

// Enum SiliconRising.EYYMsgEShopType
// NumValues: 0x0009
enum class EYYMsgEShopType : uint8
{
	ESHT_BUILDING                            = 0,
	ESHT_GOLD                                = 1,
	ESHT_DIAMOND                             = 2,
	ESHT_SP                                  = 3,
	ESHT_EQUIP                               = 4,
	ESHT_GEM                                 = 5,
	ESHT_Hero                                = 6,
	ESHT_Other                               = 7,
	ESHT_MAX                                 = 8,
};

// Enum SiliconRising.EYYMsgEBattleType
// NumValues: 0x0003
enum class EYYMsgEBattleType : uint8
{
	BATTLE_SINGLE                            = 0,
	BATTLE_PVE_TEAM                          = 1,
	BATTLE_MAX                               = 2,
};

// Enum SiliconRising.EYYMsgETaskType
// NumValues: 0x000B
enum class EYYMsgETaskType : uint8
{
	TASK_LEVEL_UPDATE_SOME_LEVEL             = 0,
	TASK_PASS_ECTYPE                         = 1,
	TASK_PASS_ECTYPE_COUNT                   = 2,
	TASK_PASS_SOME_TYPE_ECTYPE_COUNT         = 3,
	TASK_UPDATE_SKILL_COUNT                  = 4,
	TASK_CONSUME_MONEY                       = 5,
	TASK_CONSUME_DIAMOND                     = 6,
	TASK_ARENA_COUNT                         = 7,
	TASK_KILL_MONSTER_COUNT                  = 8,
	TASK_KILL_SOME_MONSTER_COUNT             = 9,
	TASK_MAX                                 = 10,
};

// Enum SiliconRising.EYYMsgETaskState
// NumValues: 0x0005
enum class EYYMsgETaskState : uint8
{
	TASK_IN_PROCESS                          = 0,
	TASK_DONE                                = 1,
	TASK_DRAW_AWARD                          = 2,
	TASK_FINISH                              = 3,
	TASK_MAX                                 = 4,
};

// Enum SiliconRising.EYYMsgEGuildPowerType
// NumValues: 0x0004
enum class EYYMsgEGuildPowerType : uint8
{
	GUILD_POWER_TYPE_NORMAL                  = 0,
	GUILD_POWER_TYPE_VICE_PRESIDENT          = 1,
	GUILD_POWER_TYPE_PRESIDENT               = 2,
	GUILD_POWER_TYPE_MAX                     = 3,
};

// Enum SiliconRising.EYYMsgEDrawDropItemState
// NumValues: 0x0004
enum class EYYMsgEDrawDropItemState : uint8
{
	E_DRAW_STATE_NONE                        = 0,
	E_DRAW_STATE_GAIN                        = 1,
	E_DRAW_STATE_RECV                        = 2,
	E_DRAW_STATE_MAX                         = 3,
};

// Enum SiliconRising.EYYMsgEFireType
// NumValues: 0x0005
enum class EYYMsgEFireType : uint8
{
	EFT_FIXED                                = 0,
	EFT_SERIAL                               = 1,
	EFT_THROW                                = 2,
	EFT_REMOTE_CONTROL                       = 3,
	EFT_MAX                                  = 4,
};

// Enum SiliconRising.EYYMsgEItemSubType
// NumValues: 0x0005
enum class EYYMsgEItemSubType : uint8
{
	EIST_ITEM_REMOTE_UAV                     = 0,
	EIST_ITEM_HP                             = 1,
	EIST_ITEM_HOT_DETECTOR                   = 2,
	EIST_ITEM_REMOTE_BOMB                    = 3,
	EIST_ITEM_MAX                            = 4,
};

// Enum SiliconRising.EYYMsgEEquipSubType
// NumValues: 0x0005
enum class EYYMsgEEquipSubType : uint8
{
	EEST_PISTOL                              = 0,
	EEST_NORMAL                              = 1,
	EEST_ARROW                               = 2,
	EEST_SHIELD                              = 3,
	EEST_MAX                                 = 4,
};

// Enum SiliconRising.EYYMsgEItemType
// NumValues: 0x0004
enum class EYYMsgEItemType : uint8
{
	EIT_EQUIP                                = 0,
	EIT_BULLET                               = 1,
	EIT_ITEM                                 = 2,
	EIT_MAX                                  = 3,
};

// Enum SiliconRising.EYYMsgEGameItemExpiredType
// NumValues: 0x0005
enum class EYYMsgEGameItemExpiredType : uint8
{
	EGIET_NONE                               = 0,
	EGIET_USE_TIMES                          = 1,
	EGIET_REAL_TIME                          = 2,
	EGIET_END_INDEX                          = 3,
	EGIET_MAX                                = 4,
};

// Enum SiliconRising.EYYMsgEGameTokenSubType
// NumValues: 0x0005
enum class EYYMsgEGameTokenSubType : uint8
{
	EGTST_TOKEN_REBORN                       = 0,
	EGTST_TOKEN_POSITION                     = 1,
	EGTST_TOKEN_BOUNTY                       = 2,
	EGTST_TOKEN_ACTIVITY                     = 3,
	EGTST_TOKEN_MAX                          = 4,
};

// Enum SiliconRising.EYYMsgEGameCardSubType
// NumValues: 0x0004
enum class EYYMsgEGameCardSubType : uint8
{
	EGCST_STRENGTH                           = 0,
	EGCST_AGILITY                            = 1,
	EGCST_INTELLIGENCE                       = 2,
	EGCST_MAX                                = 3,
};

// Enum SiliconRising.EYYMsgEGameItemSubType
// NumValues: 0x0009
enum class EYYMsgEGameItemSubType : uint8
{
	EGIT_ITEM_WATER                          = 0,
	EGIT_ITEM_DIAMOND                        = 1,
	EGIT_ITEM_CURRENCY                       = 2,
	EGIT_ITEM_EXP                            = 3,
	EGIT_ITEM_HP                             = 4,
	EGIT_ITEM_MP                             = 5,
	EGIT_ITEM_SP                             = 6,
	EGIT_ITEM_PACK                           = 7,
	EGIT_ITEM_MAX                            = 8,
};

// Enum SiliconRising.EYYMsgEGameGemSubType
// NumValues: 0x0008
enum class EYYMsgEGameGemSubType : uint8
{
	EGGSTYPE_GEM_ATK                         = 0,
	EGGSTYPE_GEM_DEF                         = 1,
	EGGSTYPE_GEM_FIRE                        = 2,
	EGGSTYPE_GEM_LIGHT                       = 3,
	EGGSTYPE_GEM_WIND                        = 4,
	EGGSTYPE_GEM_ICE                         = 5,
	EGGSTYPE_GEM_POISON                      = 6,
	EGGSTYPE_GEM_MAX                         = 7,
};

// Enum SiliconRising.EYYMsgEGameEquipSubType
// NumValues: 0x0007
enum class EYYMsgEGameEquipSubType : uint8
{
	EQUIPTYPE_WEAPON                         = 0,
	EQUIPTYPE_HELMET                         = 1,
	EQUIPTYPE_ARMOR                          = 2,
	EQUIPTYPE_WRIST                          = 3,
	EQUIPTYPE_PANT                           = 4,
	EQUIPTYPE_BOOT                           = 5,
	EQUIPTYPE_MAX                            = 6,
};

// Enum SiliconRising.EYYMsgEConditionType
// NumValues: 0x0014
enum class EYYMsgEConditionType : uint8
{
	ECT_Invalid                              = 0,
	ECT_LessHP                               = 1,
	ECT_EqualHP                              = 2,
	ECT_GreaterHP                            = 3,
	ECT_LessMP                               = 4,
	ECT_EqualMP                              = 5,
	ECT_GreaterMP                            = 6,
	ECT_OverTime                             = 7,
	ECT_LessRange                            = 8,
	ECT_EqualRange                           = 9,
	ECT_GreaterRange                         = 10,
	ECT_Collide                              = 11,
	ECT_Dead                                 = 12,
	ECT_AfterAttack                          = 13,
	ECT_AfterSkill                           = 14,
	ECT_OnAttacked                           = 15,
	ECT_BuffEffected                         = 16,
	ECT_Killed                               = 17,
	ECT_Count                                = 18,
	ECT_MAX                                  = 19,
};

// Enum SiliconRising.EYYMsgEBuffEffectType
// NumValues: 0x001C
enum class EYYMsgEBuffEffectType : uint8
{
	EBET_MaxHP                               = 0,
	EBET_MaxMP                               = 1,
	EBET_RegenHP                             = 2,
	EBET_RegenMP                             = 3,
	EBET_Damage                              = 4,
	EBET_HeadshotDamage                      = 5,
	EBET_MoveSpeed                           = 6,
	EBET_AttackSpeed                         = 7,
	EBET_MaxHPRate                           = 8,
	EBET_MaxMPRate                           = 9,
	EBET_RegenHPRate                         = 10,
	EBET_RegenMPRate                         = 11,
	EBET_DamageRate                          = 12,
	EBET_HeadshotDamageRate                  = 13,
	EBET_MoveSpeedRate                       = 14,
	EBET_AttackSpeedRate                     = 15,
	EBET_CooldownReduce                      = 16,
	EBET_AttackIntervalReduce                = 17,
	EBET_Dot                                 = 18,
	EBET_Hot                                 = 19,
	EBET_DotRate                             = 20,
	EBET_HotRate                             = 21,
	EBET_Visible                             = 22,
	EBET_Invisible                           = 23,
	EBET_InfiniteAmmo                        = 24,
	EBET_LimitCD                             = 25,
	EBET_Invincible                          = 26,
	EBET_MAX                                 = 27,
};

// Enum SiliconRising.EYYMsgEBuffCategory
// NumValues: 0x0008
enum class EYYMsgEBuffCategory : uint8
{
	EBC_Buff                                 = 0,
	EBC_Control                              = 1,
	EBC_DeBuff                               = 2,
	EBC_SlowDown                             = 3,
	EBC_Hurt                                 = 4,
	EBC_Immune                               = 5,
	EBC_Limit                                = 6,
	EBC_MAX                                  = 7,
};

// Enum SiliconRising.EYYMsgESkillBeneficiaryType
// NumValues: 0x0005
enum class EYYMsgESkillBeneficiaryType : uint8
{
	ESBT_Self                                = 0,
	ESBT_Teammate                            = 1,
	ESBT_Enemy                               = 2,
	ESBT_All                                 = 3,
	ESBT_MAX                                 = 4,
};

// Enum SiliconRising.EYYMsgESkillType
// NumValues: 0x0004
enum class EYYMsgESkillType : uint8
{
	EST_Normal                               = 0,
	EST_Passive                              = 1,
	EST_Attack                               = 2,
	EST_MAX                                  = 3,
};

// Enum SiliconRising.EYYMsgECardType
// NumValues: 0x0004
enum class EYYMsgECardType : uint8
{
	ECT_Hero                                 = 0,
	ECT_Summon                               = 1,
	ECT_Enemy                                = 2,
	ECT_MAX                                  = 3,
};

// Enum SiliconRising.EYYMsgEGameMsgID
// NumValues: 0x005A
enum class EYYMsgEGameMsgID : uint8
{
	EGMI_UNKNOW                              = 0,
	EGMI_EVENT_RESULT                        = 1,
	EGMI_EVENT_TRANSPOND                     = 2,
	EGMI_CLOSE_SOCKET                        = 3,
	EGMI_SERVER_REGISTERED                   = 4,
	EGMI_SERVER_UNREGISTERED                 = 5,
	EGMI_SERVER_REFRESH                      = 6,
	EGMI_REQ_LOGIN                           = 7,
	EGMI_ACK_LOGIN                           = 8,
	EGMI_REQ_LOGOUT                          = 9,
	EGMI_REQ_PING                            = 10,
	EGMI_ACK_PING                            = 11,
	EGMI_REQ_ROLE_LIST                       = 12,
	EGMI_ACK_ROLE_LIST                       = 13,
	EGMI_REQ_CREATE_ROLE                     = 14,
	EGMI_REQ_DELETE_ROLE                     = 15,
	EGMI_REQ_ENTER_GAME                      = 16,
	EGMI_ACK_ENTER_GAME                      = 17,
	EGMI_REQ_LEAVE_GAME                      = 18,
	EGMI_ACK_LEAVE_GAME                      = 19,
	EGMI_REQ_SWAP_SCENE                      = 20,
	EGMI_ACK_SWAP_SCENE                      = 21,
	EGMI_ACK_OBJECT_ENTRY                    = 22,
	EGMI_ACK_OBJECT_LEAVE                    = 23,
	EGMI_ACK_OBJECT_PROPERTY_ENTRY           = 24,
	EGMI_ACK_OBJECT_RECORD_ENTRY             = 25,
	EGMI_ACK_PROPERTY_INT                    = 26,
	EGMI_ACK_PROPERTY_FLOAT                  = 27,
	EGMI_ACK_PROPERTY_STRING                 = 28,
	EGMI_ACK_PROPERTY_BYTE                   = 29,
	EGMI_ACK_PROPERTY_OBJECT                 = 30,
	EGMI_ACK_PROPERTY_VECTOR2                = 31,
	EGMI_ACK_PROPERTY_VECTOR3                = 32,
	EGMI_ACK_PROPERTY_VECTOR4                = 33,
	EGMI_ACK_ADD_ROW                         = 34,
	EGMI_ACK_REMOVE_ROW                      = 35,
	EGMI_ACK_SWAP_ROW                        = 36,
	EGMI_ACK_RECORD_INT                      = 37,
	EGMI_ACK_RECORD_FLOAT                    = 38,
	EGMI_ACK_RECORD_STRING                   = 39,
	EGMI_ACK_RECORD_BYTE                     = 40,
	EGMI_ACK_RECORD_OBJECT                   = 41,
	EGMI_ACK_RECORD_VECTOR2                  = 42,
	EGMI_ACK_RECORD_VECTOR3                  = 43,
	EGMI_ACK_RECORD_VECTOR4                  = 44,
	EGMI_ACK_RECORD_CLEAR                    = 45,
	EGMI_ACK_RECORD_SORT                     = 46,
	EGMI_ACK_CLONE_OBJECT_ENTRY              = 47,
	EGMI_ACK_CLONE_OBJECT_LEAVE              = 48,
	EGMI_ACK_CLONE_OBJECT_PROPERTY_ENTRY     = 49,
	EGMI_ACK_CLONE_OBJECT_RECORD_ENTRY       = 50,
	EGMI_ACK_CLONE_PROPERTY_INT              = 51,
	EGMI_ACK_CLONE_PROPERTY_FLOAT            = 52,
	EGMI_ACK_CLONE_PROPERTY_STRING           = 53,
	EGMI_ACK_CLONE_PROPERTY_OBJECT           = 54,
	EGMI_REQ_LOADER_SERVER_REGISTER          = 55,
	EGMI_ACK_LOADER_SERVER_REGISTER          = 56,
	EGMI_REQ_LOAD_PVP_SERVER                 = 57,
	EGMI_ACK_LOAD_PVP_SERVER                 = 58,
	EGMI_REQ_START_MATCH                     = 59,
	EGMI_ACK_START_MATCH                     = 60,
	EGMI_REQ_CANCEL_MATCH                    = 61,
	EGMI_ACK_CANCEL_MATCH                    = 62,
	EGMI_REQ_FINISH_MATCH                    = 63,
	EGMI_ACK_FINISH_MATCH                    = 64,
	EGMI_REQ_ROOM_LIST                       = 65,
	EGMI_ACK_ROOM_LIST                       = 66,
	EGMI_REQ_ENTER_ROOM                      = 67,
	EGMI_ACK_ENTER_ROOM                      = 68,
	EGMI_REQ_ROOM_INFO                       = 69,
	EGMI_ACK_ROOM_INFO                       = 70,
	EGMI_REQ_CREATE_ROOM                     = 71,
	EGMI_ACK_CREATE_ROOM                     = 72,
	EGMI_REQ_QUICK_ENTER                     = 73,
	EGMI_ACK_QUICK_ENTER                     = 74,
	EGMI_REQ_LEAVE_ROOM                      = 75,
	EGMI_ACK_LEAVE_ROOM                      = 76,
	EGMI_REQ_ROOM_START                      = 77,
	EGMI_ACK_ROOM_START                      = 78,
	EGMI_REQ_ROOM_HEADURL                    = 79,
	EGMI_ACK_ROOM_HEADURL                    = 80,
	EGMI_REQ_PVP_SERVER_REGISTER             = 81,
	EGMI_ACK_PVP_SERVER_REGISTER             = 82,
	EGMI_REQ_PVP_SERVER_START                = 83,
	EGMI_ACK_PVP_SERVER_START                = 84,
	EGMI_REQ_PVP_SERVER_FINISHED             = 85,
	EGMI_ACK_PVP_SERVER_FINISHED             = 86,
	EGMI_REQ_PVP_SERVER_SHUTDOWN             = 87,
	EGMI_ACK_PVP_SERVER_SHUTDOWN             = 88,
	EGMI_MAX                                 = 89,
};

// Enum SiliconRising.EYYMsgEGameEventCode
// NumValues: 0x003C
enum class EYYMsgEGameEventCode : uint8
{
	EGEC_SUCCESS                             = 0,
	EGEC_FAIL                                = 1,
	EGEC_UNKOWN_ERROR                        = 2,
	EGEC_ACCOUNT_EXIST                       = 3,
	EGEC_ACCOUNTPWD_INVALID                  = 4,
	EGEC_ACCOUNT_USING                       = 5,
	EGEC_ACCOUNT_LOCKED                      = 6,
	EGEC_ACCOUNT_SUCCESS                     = 7,
	EGEC_VERIFY_KEY_SUCCESS                  = 8,
	EGEC_VERIFY_KEY_FAIL                     = 9,
	EGEC_SELECTSERVER_SUCCESS                = 10,
	EGEC_SELECTSERVER_FAIL                   = 11,
	EGEC_MASTERSERVER_CONNECT_FAIL           = 12,
	EGEC_LOGIN_PROXY_INVALID                 = 13,
	EGEC_LOGIN_GAME_INVALID                  = 14,
	EGEC_CHARACTER_EXIST                     = 15,
	EGEC_SVRZONEID_INVALID                   = 16,
	EGEC_CHARACTER_NUMOUT                    = 17,
	EGEC_CHARACTER_INVALID                   = 18,
	EGEC_CHARACTER_NOTEXIST                  = 19,
	EGEC_CHARACTER_USING                     = 20,
	EGEC_CHARACTER_LOCKED                    = 21,
	EGEC_ZONE_OVERLOAD                       = 22,
	EGEC_NOT_ONLINE                          = 23,
	EGEC_MAIL_UPDATE_ERROR                   = 24,
	EGEC_MAIL_TONAME_INVALID                 = 25,
	EGEC_MAIL_DELETE_ERROR                   = 26,
	EGEC_MAIL_TOWNAME_EQUAL                  = 27,
	EGEC_LACK_MONEY                          = 28,
	EGEC_FULL_PACKAGE                        = 29,
	EGEC_INVALID_ITEM                        = 30,
	EGEC_INVALID_CONSIGNMENT                 = 31,
	EGEC_NOT_ENOUGH_VIP                      = 32,
	EGEC_NEED_LEVEL                          = 33,
	EGEC_MAX_FRIEND_LIST                     = 34,
	EGEC_MAX_ENEMY_LIST                      = 35,
	EGEC_MAX_GANGS_LSIT                      = 36,
	EGEC_LIMITS_TO_RIGHTS                    = 37,
	EGEC_INVALID_GANGS_NAME                  = 38,
	EGEC_REPEAT_ENTER_GANGS                  = 39,
	EGEC_INVALID_GANGSMEMBER                 = 40,
	EGEC_MASTER_LEAVE_GANGS                  = 41,
	EGEC_GANGS_TITLE_OUTOF                   = 42,
	EGEC_ENTER_GATEWAY_FAILD                 = 43,
	EGEC_NO_SERVER4ZONE                      = 44,
	EGEC_INVALID_SKILL                       = 45,
	EGEC_ENTER_GAME_SUCCESS                  = 46,
	EGEC_CREATE_GUILD_SUCCESS                = 47,
	EGEC_JOIN_GUILD_SUCCESS                  = 48,
	EGEC_LEAVE_GUILD_SUCCESS                 = 49,
	EGEC_FREEMAN                             = 50,
	EGEC_ALREAY_IN_TEAM                      = 51,
	EGEC_INVALID_TEAM_INVITE                 = 52,
	EGEC_TEAM_FULL                           = 53,
	EGEC_CREATE_TEAM_FAIL                    = 54,
	EGEC_INVALID_TEAM                        = 55,
	EGEC_FINISH_MATCH                        = 56,
	EGEC_MATCHING                            = 57,
	EGEC_PLAYING                             = 58,
	EGEC_MAX                                 = 59,
};

// ScriptStruct SiliconRising.YYMsgVector4
// 0x0010 (0x0010 - 0x0000)
struct FYYMsgVector4 final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Z;                                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         W;                                                 // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgVector4) == 0x000004, "Wrong alignment on FYYMsgVector4");
static_assert(sizeof(FYYMsgVector4) == 0x000010, "Wrong size on FYYMsgVector4");
static_assert(offsetof(FYYMsgVector4, X) == 0x000000, "Member 'FYYMsgVector4::X' has a wrong offset!");
static_assert(offsetof(FYYMsgVector4, Y) == 0x000004, "Member 'FYYMsgVector4::Y' has a wrong offset!");
static_assert(offsetof(FYYMsgVector4, Z) == 0x000008, "Member 'FYYMsgVector4::Z' has a wrong offset!");
static_assert(offsetof(FYYMsgVector4, W) == 0x00000C, "Member 'FYYMsgVector4::W' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgData
// 0x0018 (0x0018 - 0x0000)
struct FYYMsgData final
{
public:
	EYYMsgEGameMsgID                              MsgID;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 MsgData;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgData) == 0x000008, "Wrong alignment on FYYMsgData");
static_assert(sizeof(FYYMsgData) == 0x000018, "Wrong size on FYYMsgData");
static_assert(offsetof(FYYMsgData, MsgID) == 0x000000, "Member 'FYYMsgData::MsgID' has a wrong offset!");
static_assert(offsetof(FYYMsgData, MsgData) == 0x000008, "Member 'FYYMsgData::MsgData' has a wrong offset!");

// ScriptStruct SiliconRising.SteamUserData
// 0x0090 (0x0090 - 0x0000)
struct FSteamUserData final
{
public:
	class FString                                 steamid;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         communityvisibilitystate;                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         profilestate;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 personaname;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         lastlogoff;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 profileurl;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 avatar;                                            // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 avatarmedium;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 avatarfull;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         personastate;                                      // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 primaryclanid;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         timecreated;                                       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         personastateflags;                                 // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSteamUserData) == 0x000008, "Wrong alignment on FSteamUserData");
static_assert(sizeof(FSteamUserData) == 0x000090, "Wrong size on FSteamUserData");
static_assert(offsetof(FSteamUserData, steamid) == 0x000000, "Member 'FSteamUserData::steamid' has a wrong offset!");
static_assert(offsetof(FSteamUserData, communityvisibilitystate) == 0x000010, "Member 'FSteamUserData::communityvisibilitystate' has a wrong offset!");
static_assert(offsetof(FSteamUserData, profilestate) == 0x000014, "Member 'FSteamUserData::profilestate' has a wrong offset!");
static_assert(offsetof(FSteamUserData, personaname) == 0x000018, "Member 'FSteamUserData::personaname' has a wrong offset!");
static_assert(offsetof(FSteamUserData, lastlogoff) == 0x000028, "Member 'FSteamUserData::lastlogoff' has a wrong offset!");
static_assert(offsetof(FSteamUserData, profileurl) == 0x000030, "Member 'FSteamUserData::profileurl' has a wrong offset!");
static_assert(offsetof(FSteamUserData, avatar) == 0x000040, "Member 'FSteamUserData::avatar' has a wrong offset!");
static_assert(offsetof(FSteamUserData, avatarmedium) == 0x000050, "Member 'FSteamUserData::avatarmedium' has a wrong offset!");
static_assert(offsetof(FSteamUserData, avatarfull) == 0x000060, "Member 'FSteamUserData::avatarfull' has a wrong offset!");
static_assert(offsetof(FSteamUserData, personastate) == 0x000070, "Member 'FSteamUserData::personastate' has a wrong offset!");
static_assert(offsetof(FSteamUserData, primaryclanid) == 0x000078, "Member 'FSteamUserData::primaryclanid' has a wrong offset!");
static_assert(offsetof(FSteamUserData, timecreated) == 0x000088, "Member 'FSteamUserData::timecreated' has a wrong offset!");
static_assert(offsetof(FSteamUserData, personastateflags) == 0x00008C, "Member 'FSteamUserData::personastateflags' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgVector2
// 0x0008 (0x0008 - 0x0000)
struct FYYMsgVector2 final
{
public:
	float                                         X;                                                 // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Y;                                                 // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgVector2) == 0x000004, "Wrong alignment on FYYMsgVector2");
static_assert(sizeof(FYYMsgVector2) == 0x000008, "Wrong size on FYYMsgVector2");
static_assert(offsetof(FYYMsgVector2, X) == 0x000000, "Member 'FYYMsgVector2::X' has a wrong offset!");
static_assert(offsetof(FYYMsgVector2, Y) == 0x000004, "Member 'FYYMsgVector2::Y' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgPropertyVector2
// 0x0018 (0x0018 - 0x0000)
struct FYYMsgPropertyVector2 final
{
public:
	class FString                                 property_name;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgVector2                          Data;                                              // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgPropertyVector2) == 0x000008, "Wrong alignment on FYYMsgPropertyVector2");
static_assert(sizeof(FYYMsgPropertyVector2) == 0x000018, "Wrong size on FYYMsgPropertyVector2");
static_assert(offsetof(FYYMsgPropertyVector2, property_name) == 0x000000, "Member 'FYYMsgPropertyVector2::property_name' has a wrong offset!");
static_assert(offsetof(FYYMsgPropertyVector2, Data) == 0x000010, "Member 'FYYMsgPropertyVector2::Data' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgInt64
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FYYMsgInt64 final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FYYMsgInt64) == 0x000008, "Wrong alignment on FYYMsgInt64");
static_assert(sizeof(FYYMsgInt64) == 0x000008, "Wrong size on FYYMsgInt64");

// ScriptStruct SiliconRising.YYMsgIdent
// 0x0010 (0x0010 - 0x0000)
struct FYYMsgIdent final
{
public:
	struct FYYMsgInt64                            svrid;                                             // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FYYMsgInt64                            Index;                                             // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgIdent) == 0x000008, "Wrong alignment on FYYMsgIdent");
static_assert(sizeof(FYYMsgIdent) == 0x000010, "Wrong size on FYYMsgIdent");
static_assert(offsetof(FYYMsgIdent, svrid) == 0x000000, "Member 'FYYMsgIdent::svrid' has a wrong offset!");
static_assert(offsetof(FYYMsgIdent, Index) == 0x000008, "Member 'FYYMsgIdent::Index' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgReqAckPVPServerStart
// 0x0010 (0x0010 - 0x0000)
struct FYYMsgReqAckPVPServerStart final
{
public:
	struct FYYMsgIdent                            RoomID;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgReqAckPVPServerStart) == 0x000008, "Wrong alignment on FYYMsgReqAckPVPServerStart");
static_assert(sizeof(FYYMsgReqAckPVPServerStart) == 0x000010, "Wrong size on FYYMsgReqAckPVPServerStart");
static_assert(offsetof(FYYMsgReqAckPVPServerStart, RoomID) == 0x000000, "Member 'FYYMsgReqAckPVPServerStart::RoomID' has a wrong offset!");

// ScriptStruct SiliconRising.SpecialBulletCfg
// 0x001C (0x001C - 0x0000)
struct FSpecialBulletCfg final
{
public:
	int32                                         Speed;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Scale;                                             // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                collisonScale;                                     // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSpecialBulletCfg) == 0x000004, "Wrong alignment on FSpecialBulletCfg");
static_assert(sizeof(FSpecialBulletCfg) == 0x00001C, "Wrong size on FSpecialBulletCfg");
static_assert(offsetof(FSpecialBulletCfg, Speed) == 0x000000, "Member 'FSpecialBulletCfg::Speed' has a wrong offset!");
static_assert(offsetof(FSpecialBulletCfg, Scale) == 0x000004, "Member 'FSpecialBulletCfg::Scale' has a wrong offset!");
static_assert(offsetof(FSpecialBulletCfg, collisonScale) == 0x000010, "Member 'FSpecialBulletCfg::collisonScale' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgRoomCampMember
// 0x0038 (0x0038 - 0x0000)
struct FYYMsgRoomCampMember final
{
public:
	struct FYYMsgIdent                            player_id;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 Name;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         avatar;                                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgIdent                            battle_player_id;                                  // 0x0028(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgRoomCampMember) == 0x000008, "Wrong alignment on FYYMsgRoomCampMember");
static_assert(sizeof(FYYMsgRoomCampMember) == 0x000038, "Wrong size on FYYMsgRoomCampMember");
static_assert(offsetof(FYYMsgRoomCampMember, player_id) == 0x000000, "Member 'FYYMsgRoomCampMember::player_id' has a wrong offset!");
static_assert(offsetof(FYYMsgRoomCampMember, Name) == 0x000010, "Member 'FYYMsgRoomCampMember::Name' has a wrong offset!");
static_assert(offsetof(FYYMsgRoomCampMember, avatar) == 0x000020, "Member 'FYYMsgRoomCampMember::avatar' has a wrong offset!");
static_assert(offsetof(FYYMsgRoomCampMember, Level) == 0x000024, "Member 'FYYMsgRoomCampMember::Level' has a wrong offset!");
static_assert(offsetof(FYYMsgRoomCampMember, battle_player_id) == 0x000028, "Member 'FYYMsgRoomCampMember::battle_player_id' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgRoomCamp
// 0x0018 (0x0018 - 0x0000)
struct FYYMsgRoomCamp final
{
public:
	int32                                         camp_id;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FYYMsgRoomCampMember>           members;                                           // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgRoomCamp) == 0x000008, "Wrong alignment on FYYMsgRoomCamp");
static_assert(sizeof(FYYMsgRoomCamp) == 0x000018, "Wrong size on FYYMsgRoomCamp");
static_assert(offsetof(FYYMsgRoomCamp, camp_id) == 0x000000, "Member 'FYYMsgRoomCamp::camp_id' has a wrong offset!");
static_assert(offsetof(FYYMsgRoomCamp, members) == 0x000008, "Member 'FYYMsgRoomCamp::members' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgAckFinishMatch
// 0x0050 (0x0050 - 0x0000)
struct FYYMsgAckFinishMatch final
{
public:
	struct FYYMsgIdent                            team_id;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         is_ok;                                             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FYYMsgIdent                            game_idx;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 hostname;                                          // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FYYMsgRoomCamp>                 camps;                                             // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgAckFinishMatch) == 0x000008, "Wrong alignment on FYYMsgAckFinishMatch");
static_assert(sizeof(FYYMsgAckFinishMatch) == 0x000050, "Wrong size on FYYMsgAckFinishMatch");
static_assert(offsetof(FYYMsgAckFinishMatch, team_id) == 0x000000, "Member 'FYYMsgAckFinishMatch::team_id' has a wrong offset!");
static_assert(offsetof(FYYMsgAckFinishMatch, is_ok) == 0x000010, "Member 'FYYMsgAckFinishMatch::is_ok' has a wrong offset!");
static_assert(offsetof(FYYMsgAckFinishMatch, game_idx) == 0x000018, "Member 'FYYMsgAckFinishMatch::game_idx' has a wrong offset!");
static_assert(offsetof(FYYMsgAckFinishMatch, hostname) == 0x000028, "Member 'FYYMsgAckFinishMatch::hostname' has a wrong offset!");
static_assert(offsetof(FYYMsgAckFinishMatch, Port) == 0x000038, "Member 'FYYMsgAckFinishMatch::Port' has a wrong offset!");
static_assert(offsetof(FYYMsgAckFinishMatch, camps) == 0x000040, "Member 'FYYMsgAckFinishMatch::camps' has a wrong offset!");

// ScriptStruct SiliconRising.LeaderBoardData
// 0x0058 (0x0058 - 0x0000)
struct FLeaderBoardData final
{
public:
	class FString                                 rank;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 nickName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Score;                                             // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ID;                                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HeadUrl;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsLocal;                                           // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FLeaderBoardData) == 0x000008, "Wrong alignment on FLeaderBoardData");
static_assert(sizeof(FLeaderBoardData) == 0x000058, "Wrong size on FLeaderBoardData");
static_assert(offsetof(FLeaderBoardData, rank) == 0x000000, "Member 'FLeaderBoardData::rank' has a wrong offset!");
static_assert(offsetof(FLeaderBoardData, nickName) == 0x000010, "Member 'FLeaderBoardData::nickName' has a wrong offset!");
static_assert(offsetof(FLeaderBoardData, Score) == 0x000020, "Member 'FLeaderBoardData::Score' has a wrong offset!");
static_assert(offsetof(FLeaderBoardData, ID) == 0x000030, "Member 'FLeaderBoardData::ID' has a wrong offset!");
static_assert(offsetof(FLeaderBoardData, HeadUrl) == 0x000040, "Member 'FLeaderBoardData::HeadUrl' has a wrong offset!");
static_assert(offsetof(FLeaderBoardData, IsLocal) == 0x000050, "Member 'FLeaderBoardData::IsLocal' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgRecordVector2
// 0x0010 (0x0010 - 0x0000)
struct FYYMsgRecordVector2 final
{
public:
	int32                                         row;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         col;                                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgVector2                          Data;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgRecordVector2) == 0x000004, "Wrong alignment on FYYMsgRecordVector2");
static_assert(sizeof(FYYMsgRecordVector2) == 0x000010, "Wrong size on FYYMsgRecordVector2");
static_assert(offsetof(FYYMsgRecordVector2, row) == 0x000000, "Member 'FYYMsgRecordVector2::row' has a wrong offset!");
static_assert(offsetof(FYYMsgRecordVector2, col) == 0x000004, "Member 'FYYMsgRecordVector2::col' has a wrong offset!");
static_assert(offsetof(FYYMsgRecordVector2, Data) == 0x000008, "Member 'FYYMsgRecordVector2::Data' has a wrong offset!");

// ScriptStruct SiliconRising.OnlineAchievementSteam
// 0x0028 (0x0028 - 0x0000)
struct FOnlineAchievementSteam final
{
public:
	class FString                                 ID;                                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EN;                                                // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Progress;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReadFromSteam;                                    // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FOnlineAchievementSteam) == 0x000008, "Wrong alignment on FOnlineAchievementSteam");
static_assert(sizeof(FOnlineAchievementSteam) == 0x000028, "Wrong size on FOnlineAchievementSteam");
static_assert(offsetof(FOnlineAchievementSteam, ID) == 0x000000, "Member 'FOnlineAchievementSteam::ID' has a wrong offset!");
static_assert(offsetof(FOnlineAchievementSteam, EN) == 0x000010, "Member 'FOnlineAchievementSteam::EN' has a wrong offset!");
static_assert(offsetof(FOnlineAchievementSteam, Progress) == 0x000020, "Member 'FOnlineAchievementSteam::Progress' has a wrong offset!");
static_assert(offsetof(FOnlineAchievementSteam, bReadFromSteam) == 0x000024, "Member 'FOnlineAchievementSteam::bReadFromSteam' has a wrong offset!");

// ScriptStruct SiliconRising.PlayerTopInfo
// 0x0050 (0x0050 - 0x0000)
struct FPlayerTopInfo final
{
public:
	class FString                                 gameTime;                                          // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 hitRate;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 killNum;                                           // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 topScore;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 topRank;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPlayerTopInfo) == 0x000008, "Wrong alignment on FPlayerTopInfo");
static_assert(sizeof(FPlayerTopInfo) == 0x000050, "Wrong size on FPlayerTopInfo");
static_assert(offsetof(FPlayerTopInfo, gameTime) == 0x000000, "Member 'FPlayerTopInfo::gameTime' has a wrong offset!");
static_assert(offsetof(FPlayerTopInfo, hitRate) == 0x000010, "Member 'FPlayerTopInfo::hitRate' has a wrong offset!");
static_assert(offsetof(FPlayerTopInfo, killNum) == 0x000020, "Member 'FPlayerTopInfo::killNum' has a wrong offset!");
static_assert(offsetof(FPlayerTopInfo, topScore) == 0x000030, "Member 'FPlayerTopInfo::topScore' has a wrong offset!");
static_assert(offsetof(FPlayerTopInfo, topRank) == 0x000040, "Member 'FPlayerTopInfo::topRank' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgObjectRecordVector2
// 0x0030 (0x0030 - 0x0000)
struct FYYMsgObjectRecordVector2 final
{
public:
	struct FYYMsgIdent                            player_id;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 record_name;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FYYMsgRecordVector2>            property_list;                                     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FYYMsgObjectRecordVector2) == 0x000008, "Wrong alignment on FYYMsgObjectRecordVector2");
static_assert(sizeof(FYYMsgObjectRecordVector2) == 0x000030, "Wrong size on FYYMsgObjectRecordVector2");
static_assert(offsetof(FYYMsgObjectRecordVector2, player_id) == 0x000000, "Member 'FYYMsgObjectRecordVector2::player_id' has a wrong offset!");
static_assert(offsetof(FYYMsgObjectRecordVector2, record_name) == 0x000010, "Member 'FYYMsgObjectRecordVector2::record_name' has a wrong offset!");
static_assert(offsetof(FYYMsgObjectRecordVector2, property_list) == 0x000020, "Member 'FYYMsgObjectRecordVector2::property_list' has a wrong offset!");

// ScriptStruct SiliconRising.CampConfig
// 0x0002 (0x0002 - 0x0000)
struct FCampConfig final
{
public:
	EPawnCamp                                     camp;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECampState                                    State;                                             // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FCampConfig) == 0x000001, "Wrong alignment on FCampConfig");
static_assert(sizeof(FCampConfig) == 0x000002, "Wrong size on FCampConfig");
static_assert(offsetof(FCampConfig, camp) == 0x000000, "Member 'FCampConfig::camp' has a wrong offset!");
static_assert(offsetof(FCampConfig, State) == 0x000001, "Member 'FCampConfig::State' has a wrong offset!");

// ScriptStruct SiliconRising.YYMsgAckCancelMatch
// 0x0018 (0x0018 - 0x0000)
struct FYYMsgAckCancelMatch final
{
public:
	struct FYYMsgIdent                            team_id;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	EYYMsgECancelMatchResult                      Result;                                            // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FYYMsgAckCancelMatch) == 0x000008, "Wrong alignment on FYYMsgAckCancelMatch");
static_assert(sizeof(FYYMsgAckCancelMatch) == 0x000018, "Wrong size on FYYMsgAckCancelMatch");
static_assert(offsetof(FYYMsgAckCancelMatch, team_id) == 0x000000, "Member 'FYYMsgAckCancelMatch::team_id' has a wrong offset!");
static_assert(offsetof(FYYMsgAckCancelMatch, Result) == 0x000010, "Member 'FYYMsgAckCancelMatch::Result' has a wrong offset!");

// ScriptStruct SiliconRising.BulletConfig
// 0x0158 (0x0158 - 0x0000)
struct FBulletConfig final
{
public:
	float                                         Power;                                             // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Range;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LifeTime;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ExplosionDamage;                                   // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionRadius;                                   // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UDamageType>                DamageType;                                        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      SoundAttenuation;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundConcurrency*                      SoundConcurrency;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     DefaultSound;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UParticleSystem*                        DefaultEffect;                                     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HitDefaultDecal;                                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     HitBodySound;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     HitBodyFakeSound;                                  // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UParticleSystem*                        HitBodyEffect;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                        HitBodyFakeEffect;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     HitConcreteSound;                                  // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UParticleSystem*                        HitConcreteEffect;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HitConcreteDecal;                                  // 0x0098(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     HitMetalSound;                                     // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UParticleSystem*                        HitMetalEffect;                                    // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     HitMetaleDecal;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundBase*>                     HitWoodSound;                                      // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
