#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SiliconRising

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "SiliconRising_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SiliconRising.FlatBuffersYYMsgObjectPropertyVector2.PackObjectPropertyVector2
// 0x0040 (0x0040 - 0x0000)
struct FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2 final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgObjectPropertyVector2            InUE4Data;                                         // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 OutData;                                           // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2");
static_assert(sizeof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2) == 0x000040, "Wrong size on FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2, InUE4Data) == 0x000008, "Member 'FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2::InUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2, OutData) == 0x000028, "Member 'FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2::OutData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2, ReturnValue) == 0x000038, "Member 'FlatBuffersYYMsgObjectPropertyVector2_PackObjectPropertyVector2::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectPropertyVector2.UnpackObjectPropertyVector2
// 0x0040 (0x0040 - 0x0000)
struct FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2 final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InData;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FYYMsgObjectPropertyVector2            OutUE4Data;                                        // 0x0018(0x0020)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2");
static_assert(sizeof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2) == 0x000040, "Wrong size on FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2, InData) == 0x000008, "Member 'FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2::InData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2, OutUE4Data) == 0x000018, "Member 'FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2::OutUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2, ReturnValue) == 0x000038, "Member 'FlatBuffersYYMsgObjectPropertyVector2_UnpackObjectPropertyVector2::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordString.PackObjectRecordString
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordString_PackObjectRecordString final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordString               InUE4Data;                                         // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 OutData;                                           // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordString_PackObjectRecordString");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordString_PackObjectRecordString");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordString_PackObjectRecordString::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString, InUE4Data) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordString_PackObjectRecordString::InUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString, OutData) == 0x000038, "Member 'FlatBuffersYYMsgObjectRecordString_PackObjectRecordString::OutData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_PackObjectRecordString, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordString_PackObjectRecordString::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordString.UnpackObjectRecordString
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InData;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordString               OutUE4Data;                                        // 0x0018(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString, InData) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString::InData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString, OutUE4Data) == 0x000018, "Member 'FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString::OutUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordString_UnpackObjectRecordString::ReturnValue' has a wrong offset!");

// Function SiliconRising.BTT_MoveToBlackboardBase.BindReceiveMoveCompleted
// 0x0008 (0x0008 - 0x0000)
struct BTT_MoveToBlackboardBase_BindReceiveMoveCompleted final
{
public:
	class AAIController*                          AI_Controller;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTT_MoveToBlackboardBase_BindReceiveMoveCompleted) == 0x000008, "Wrong alignment on BTT_MoveToBlackboardBase_BindReceiveMoveCompleted");
static_assert(sizeof(BTT_MoveToBlackboardBase_BindReceiveMoveCompleted) == 0x000008, "Wrong size on BTT_MoveToBlackboardBase_BindReceiveMoveCompleted");
static_assert(offsetof(BTT_MoveToBlackboardBase_BindReceiveMoveCompleted, AI_Controller) == 0x000000, "Member 'BTT_MoveToBlackboardBase_BindReceiveMoveCompleted::AI_Controller' has a wrong offset!");

// Function SiliconRising.BTT_MoveToBlackboardBase.ReceiveMoveCompleted
// 0x0001 (0x0001 - 0x0000)
struct BTT_MoveToBlackboardBase_ReceiveMoveCompleted final
{
public:
	EPathFollowingResult                          Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BTT_MoveToBlackboardBase_ReceiveMoveCompleted) == 0x000001, "Wrong alignment on BTT_MoveToBlackboardBase_ReceiveMoveCompleted");
static_assert(sizeof(BTT_MoveToBlackboardBase_ReceiveMoveCompleted) == 0x000001, "Wrong size on BTT_MoveToBlackboardBase_ReceiveMoveCompleted");
static_assert(offsetof(BTT_MoveToBlackboardBase_ReceiveMoveCompleted, Result) == 0x000000, "Member 'BTT_MoveToBlackboardBase_ReceiveMoveCompleted::Result' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordByte.PackObjectRecordByte
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordByte                 InUE4Data;                                         // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 OutData;                                           // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte, InUE4Data) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte::InUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte, OutData) == 0x000038, "Member 'FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte::OutData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordByte_PackObjectRecordByte::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordByte.UnpackObjectRecordByte
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InData;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordByte                 OutUE4Data;                                        // 0x0018(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte, InData) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte::InData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte, OutUE4Data) == 0x000018, "Member 'FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte::OutUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordByte_UnpackObjectRecordByte::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordObject.PackObjectRecordObject
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordObject               InUE4Data;                                         // 0x0008(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 OutData;                                           // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject, InUE4Data) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject::InUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject, OutData) == 0x000038, "Member 'FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject::OutData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordObject_PackObjectRecordObject::ReturnValue' has a wrong offset!");

// Function SiliconRising.FlatBuffersYYMsgObjectRecordObject.UnpackObjectRecordObject
// 0x0050 (0x0050 - 0x0000)
struct FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InData;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FYYMsgObjectRecordObject               OutUE4Data;                                        // 0x0018(0x0030)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject) == 0x000008, "Wrong alignment on FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject");
static_assert(sizeof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject) == 0x000050, "Wrong size on FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject, InWorldContextObject) == 0x000000, "Member 'FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject::InWorldContextObject' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject, InData) == 0x000008, "Member 'FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject::InData' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject, OutUE4Data) == 0x000018, "Member 'FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject::OutUE4Data' has a wrong offset!");
static_assert(offsetof(FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject, ReturnValue) == 0x000048, "Member 'FlatBuffersYYMsgObjectRecordObject_UnpackObjectRecordObject::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.AppendToCommandLine
// 0x0010 (0x0010 - 0x0000)
struct CommandLineParametersBPLibrary_AppendToCommandLine final
{
public:
	class FString                                 argument;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandLineParametersBPLibrary_AppendToCommandLine) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_AppendToCommandLine");
static_assert(sizeof(CommandLineParametersBPLibrary_AppendToCommandLine) == 0x000010, "Wrong size on CommandLineParametersBPLibrary_AppendToCommandLine");
static_assert(offsetof(CommandLineParametersBPLibrary_AppendToCommandLine, argument) == 0x000000, "Member 'CommandLineParametersBPLibrary_AppendToCommandLine::argument' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.CommandLineArgIntValue
// 0x0018 (0x0018 - 0x0000)
struct CommandLineParametersBPLibrary_CommandLineArgIntValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineParametersBPLibrary_CommandLineArgIntValue) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_CommandLineArgIntValue");
static_assert(sizeof(CommandLineParametersBPLibrary_CommandLineArgIntValue) == 0x000018, "Wrong size on CommandLineParametersBPLibrary_CommandLineArgIntValue");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgIntValue, Key) == 0x000000, "Member 'CommandLineParametersBPLibrary_CommandLineArgIntValue::Key' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgIntValue, Value) == 0x000010, "Member 'CommandLineParametersBPLibrary_CommandLineArgIntValue::Value' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgIntValue, ReturnValue) == 0x000014, "Member 'CommandLineParametersBPLibrary_CommandLineArgIntValue::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.CommandLineArgPresent
// 0x0018 (0x0018 - 0x0000)
struct CommandLineParametersBPLibrary_CommandLineArgPresent final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineParametersBPLibrary_CommandLineArgPresent) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_CommandLineArgPresent");
static_assert(sizeof(CommandLineParametersBPLibrary_CommandLineArgPresent) == 0x000018, "Wrong size on CommandLineParametersBPLibrary_CommandLineArgPresent");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgPresent, Key) == 0x000000, "Member 'CommandLineParametersBPLibrary_CommandLineArgPresent::Key' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgPresent, ReturnValue) == 0x000010, "Member 'CommandLineParametersBPLibrary_CommandLineArgPresent::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.CommandLineArgValue
// 0x0028 (0x0028 - 0x0000)
struct CommandLineParametersBPLibrary_CommandLineArgValue final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineParametersBPLibrary_CommandLineArgValue) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_CommandLineArgValue");
static_assert(sizeof(CommandLineParametersBPLibrary_CommandLineArgValue) == 0x000028, "Wrong size on CommandLineParametersBPLibrary_CommandLineArgValue");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgValue, Key) == 0x000000, "Member 'CommandLineParametersBPLibrary_CommandLineArgValue::Key' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgValue, Value) == 0x000010, "Member 'CommandLineParametersBPLibrary_CommandLineArgValue::Value' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_CommandLineArgValue, ReturnValue) == 0x000020, "Member 'CommandLineParametersBPLibrary_CommandLineArgValue::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.GetFullCommandLine
// 0x0010 (0x0010 - 0x0000)
struct CommandLineParametersBPLibrary_GetFullCommandLine final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandLineParametersBPLibrary_GetFullCommandLine) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_GetFullCommandLine");
static_assert(sizeof(CommandLineParametersBPLibrary_GetFullCommandLine) == 0x000010, "Wrong size on CommandLineParametersBPLibrary_GetFullCommandLine");
static_assert(offsetof(CommandLineParametersBPLibrary_GetFullCommandLine, ReturnValue) == 0x000000, "Member 'CommandLineParametersBPLibrary_GetFullCommandLine::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.GetOriginalCommandLine
// 0x0010 (0x0010 - 0x0000)
struct CommandLineParametersBPLibrary_GetOriginalCommandLine final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CommandLineParametersBPLibrary_GetOriginalCommandLine) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_GetOriginalCommandLine");
static_assert(sizeof(CommandLineParametersBPLibrary_GetOriginalCommandLine) == 0x000010, "Wrong size on CommandLineParametersBPLibrary_GetOriginalCommandLine");
static_assert(offsetof(CommandLineParametersBPLibrary_GetOriginalCommandLine, ReturnValue) == 0x000000, "Member 'CommandLineParametersBPLibrary_GetOriginalCommandLine::ReturnValue' has a wrong offset!");

// Function SiliconRising.CommandLineParametersBPLibrary.SetFullCommandLine
// 0x0018 (0x0018 - 0x0000)
struct CommandLineParametersBPLibrary_SetFullCommandLine final
{
public:
	class FString                                 Value;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CommandLineParametersBPLibrary_SetFullCommandLine) == 0x000008, "Wrong alignment on CommandLineParametersBPLibrary_SetFullCommandLine");
static_assert(sizeof(CommandLineParametersBPLibrary_SetFullCommandLine) == 0x000018, "Wrong size on CommandLineParametersBPLibrary_SetFullCommandLine");
static_assert(offsetof(CommandLineParametersBPLibrary_SetFullCommandLine, Value) == 0x000000, "Member 'CommandLineParametersBPLibrary_SetFullCommandLine::Value' has a wrong offset!");
static_assert(offsetof(CommandLineParametersBPLibrary_SetFullCommandLine, ReturnValue) == 0x000010, "Member 'CommandLineParametersBPLibrary_SetFullCommandLine::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CBC_DecryptBytesArray
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CBC_DecryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CBC_DecryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CBC_DecryptBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_CBC_DecryptBytesArray) == 0x000030, "Wrong size on CryptBPLibrary_AES_CBC_DecryptBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArray, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArray::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArray, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CBC_DecryptBytesArrayToString
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CBC_DecryptBytesArrayToString final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CBC_DecryptBytesArrayToString) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CBC_DecryptBytesArrayToString");
static_assert(sizeof(CryptBPLibrary_AES_CBC_DecryptBytesArrayToString) == 0x000030, "Wrong size on CryptBPLibrary_AES_CBC_DecryptBytesArrayToString");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArrayToString, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArrayToString::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArrayToString, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArrayToString::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_DecryptBytesArrayToString, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CBC_DecryptBytesArrayToString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CBC_EncryptBytesArray
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CBC_EncryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CBC_EncryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CBC_EncryptBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_CBC_EncryptBytesArray) == 0x000030, "Wrong size on CryptBPLibrary_AES_CBC_EncryptBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_CBC_EncryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptBytesArray, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CBC_EncryptBytesArray::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptBytesArray, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CBC_EncryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CBC_EncryptStringToBytesArray
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CBC_EncryptStringToBytesArray final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CBC_EncryptStringToBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CBC_EncryptStringToBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_CBC_EncryptStringToBytesArray) == 0x000030, "Wrong size on CryptBPLibrary_AES_CBC_EncryptStringToBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptStringToBytesArray, String) == 0x000000, "Member 'CryptBPLibrary_AES_CBC_EncryptStringToBytesArray::String' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptStringToBytesArray, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CBC_EncryptStringToBytesArray::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CBC_EncryptStringToBytesArray, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CBC_EncryptStringToBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CTR_BytesArray
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CTR_BytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CTR_BytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CTR_BytesArray");
static_assert(sizeof(CryptBPLibrary_AES_CTR_BytesArray) == 0x000030, "Wrong size on CryptBPLibrary_AES_CTR_BytesArray");
static_assert(offsetof(CryptBPLibrary_AES_CTR_BytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_CTR_BytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CTR_BytesArray, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CTR_BytesArray::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CTR_BytesArray, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CTR_BytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_CTR_String
// 0x0030 (0x0030 - 0x0000)
struct CryptBPLibrary_AES_CTR_String final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InitiationVector;                                  // 0x0010(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_CTR_String) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_CTR_String");
static_assert(sizeof(CryptBPLibrary_AES_CTR_String) == 0x000030, "Wrong size on CryptBPLibrary_AES_CTR_String");
static_assert(offsetof(CryptBPLibrary_AES_CTR_String, String) == 0x000000, "Member 'CryptBPLibrary_AES_CTR_String::String' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CTR_String, InitiationVector) == 0x000010, "Member 'CryptBPLibrary_AES_CTR_String::InitiationVector' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_CTR_String, ReturnValue) == 0x000020, "Member 'CryptBPLibrary_AES_CTR_String::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_ECB_DecryptBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_AES_ECB_DecryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_ECB_DecryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_ECB_DecryptBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_ECB_DecryptBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_AES_ECB_DecryptBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_ECB_DecryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_ECB_DecryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_ECB_DecryptBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_AES_ECB_DecryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_ECB_DecryptBytesArrayToString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_AES_ECB_DecryptBytesArrayToString final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_ECB_DecryptBytesArrayToString) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_ECB_DecryptBytesArrayToString");
static_assert(sizeof(CryptBPLibrary_AES_ECB_DecryptBytesArrayToString) == 0x000020, "Wrong size on CryptBPLibrary_AES_ECB_DecryptBytesArrayToString");
static_assert(offsetof(CryptBPLibrary_AES_ECB_DecryptBytesArrayToString, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_ECB_DecryptBytesArrayToString::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_ECB_DecryptBytesArrayToString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_AES_ECB_DecryptBytesArrayToString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_ECB_EncryptBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_AES_ECB_EncryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_ECB_EncryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_ECB_EncryptBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_ECB_EncryptBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_AES_ECB_EncryptBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_ECB_EncryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_AES_ECB_EncryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_ECB_EncryptBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_AES_ECB_EncryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.AES_ECB_EncryptStringToBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_AES_ECB_EncryptStringToBytesArray final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_AES_ECB_EncryptStringToBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_AES_ECB_EncryptStringToBytesArray");
static_assert(sizeof(CryptBPLibrary_AES_ECB_EncryptStringToBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_AES_ECB_EncryptStringToBytesArray");
static_assert(offsetof(CryptBPLibrary_AES_ECB_EncryptStringToBytesArray, String) == 0x000000, "Member 'CryptBPLibrary_AES_ECB_EncryptStringToBytesArray::String' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_AES_ECB_EncryptStringToBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_AES_ECB_EncryptStringToBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64DecodeFromBytesArrayToBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray");
static_assert(sizeof(CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64DecodeFromBytesArrayToBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64DecodeFromBytesArrayToString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64DecodeFromBytesArrayToString final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64DecodeFromBytesArrayToString) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64DecodeFromBytesArrayToString");
static_assert(sizeof(CryptBPLibrary_Base64DecodeFromBytesArrayToString) == 0x000020, "Wrong size on CryptBPLibrary_Base64DecodeFromBytesArrayToString");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromBytesArrayToString, BytesArray) == 0x000000, "Member 'CryptBPLibrary_Base64DecodeFromBytesArrayToString::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromBytesArrayToString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64DecodeFromBytesArrayToString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64DecodeFromStringToBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64DecodeFromStringToBytesArray final
{
public:
	class FString                                 Source;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64DecodeFromStringToBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64DecodeFromStringToBytesArray");
static_assert(sizeof(CryptBPLibrary_Base64DecodeFromStringToBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_Base64DecodeFromStringToBytesArray");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromStringToBytesArray, Source) == 0x000000, "Member 'CryptBPLibrary_Base64DecodeFromStringToBytesArray::Source' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromStringToBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64DecodeFromStringToBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64DecodeFromStringToString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64DecodeFromStringToString final
{
public:
	class FString                                 Source;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64DecodeFromStringToString) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64DecodeFromStringToString");
static_assert(sizeof(CryptBPLibrary_Base64DecodeFromStringToString) == 0x000020, "Wrong size on CryptBPLibrary_Base64DecodeFromStringToString");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromStringToString, Source) == 0x000000, "Member 'CryptBPLibrary_Base64DecodeFromStringToString::Source' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64DecodeFromStringToString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64DecodeFromStringToString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64EncodeFromBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64EncodeFromBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64EncodeFromBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64EncodeFromBytesArray");
static_assert(sizeof(CryptBPLibrary_Base64EncodeFromBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_Base64EncodeFromBytesArray");
static_assert(offsetof(CryptBPLibrary_Base64EncodeFromBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_Base64EncodeFromBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64EncodeFromBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64EncodeFromBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.Base64EncodeFromString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_Base64EncodeFromString final
{
public:
	class FString                                 Source;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_Base64EncodeFromString) == 0x000008, "Wrong alignment on CryptBPLibrary_Base64EncodeFromString");
static_assert(sizeof(CryptBPLibrary_Base64EncodeFromString) == 0x000020, "Wrong size on CryptBPLibrary_Base64EncodeFromString");
static_assert(offsetof(CryptBPLibrary_Base64EncodeFromString, Source) == 0x000000, "Member 'CryptBPLibrary_Base64EncodeFromString::Source' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_Base64EncodeFromString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_Base64EncodeFromString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.BinToDec
// 0x0018 (0x0018 - 0x0000)
struct CryptBPLibrary_BinToDec final
{
public:
	class FString                                 BinaryString;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(CryptBPLibrary_BinToDec) == 0x000008, "Wrong alignment on CryptBPLibrary_BinToDec");
static_assert(sizeof(CryptBPLibrary_BinToDec) == 0x000018, "Wrong size on CryptBPLibrary_BinToDec");
static_assert(offsetof(CryptBPLibrary_BinToDec, BinaryString) == 0x000000, "Member 'CryptBPLibrary_BinToDec::BinaryString' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_BinToDec, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_BinToDec::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.CaesarDecryptBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_CaesarDecryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_CaesarDecryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_CaesarDecryptBytesArray");
static_assert(sizeof(CryptBPLibrary_CaesarDecryptBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_CaesarDecryptBytesArray");
static_assert(offsetof(CryptBPLibrary_CaesarDecryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_CaesarDecryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_CaesarDecryptBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_CaesarDecryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.CaesarDecryptString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_CaesarDecryptString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_CaesarDecryptString) == 0x000008, "Wrong alignment on CryptBPLibrary_CaesarDecryptString");
static_assert(sizeof(CryptBPLibrary_CaesarDecryptString) == 0x000020, "Wrong size on CryptBPLibrary_CaesarDecryptString");
static_assert(offsetof(CryptBPLibrary_CaesarDecryptString, String) == 0x000000, "Member 'CryptBPLibrary_CaesarDecryptString::String' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_CaesarDecryptString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_CaesarDecryptString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.CaesarEncryptBytesArray
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_CaesarEncryptBytesArray final
{
public:
	TArray<uint8>                                 BytesArray;                                        // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_CaesarEncryptBytesArray) == 0x000008, "Wrong alignment on CryptBPLibrary_CaesarEncryptBytesArray");
static_assert(sizeof(CryptBPLibrary_CaesarEncryptBytesArray) == 0x000020, "Wrong size on CryptBPLibrary_CaesarEncryptBytesArray");
static_assert(offsetof(CryptBPLibrary_CaesarEncryptBytesArray, BytesArray) == 0x000000, "Member 'CryptBPLibrary_CaesarEncryptBytesArray::BytesArray' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_CaesarEncryptBytesArray, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_CaesarEncryptBytesArray::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.CaesarEncryptString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_CaesarEncryptString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_CaesarEncryptString) == 0x000008, "Wrong alignment on CryptBPLibrary_CaesarEncryptString");
static_assert(sizeof(CryptBPLibrary_CaesarEncryptString) == 0x000020, "Wrong size on CryptBPLibrary_CaesarEncryptString");
static_assert(offsetof(CryptBPLibrary_CaesarEncryptString, String) == 0x000000, "Member 'CryptBPLibrary_CaesarEncryptString::String' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_CaesarEncryptString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_CaesarEncryptString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.ConvertBytesToString
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_ConvertBytesToString final
{
public:
	TArray<uint8>                                 Bytes;                                             // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_ConvertBytesToString) == 0x000008, "Wrong alignment on CryptBPLibrary_ConvertBytesToString");
static_assert(sizeof(CryptBPLibrary_ConvertBytesToString) == 0x000020, "Wrong size on CryptBPLibrary_ConvertBytesToString");
static_assert(offsetof(CryptBPLibrary_ConvertBytesToString, Bytes) == 0x000000, "Member 'CryptBPLibrary_ConvertBytesToString::Bytes' has a wrong offset!");
static_assert(offsetof(CryptBPLibrary_ConvertBytesToString, ReturnValue) == 0x000010, "Member 'CryptBPLibrary_ConvertBytesToString::ReturnValue' has a wrong offset!");

// Function SiliconRising.CryptBPLibrary.ConvertStringToBytes
// 0x0020 (0x0020 - 0x0000)
struct CryptBPLibrary_ConvertStringToBytes final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(CryptBPLibrary_ConvertStringToBytes) == 0x000008, "Wrong alignment on CryptBPLibrary_ConvertStringToBytes");
static_assert(sizeof(CryptBPLibrary_ConvertStringToBytes) == 0x000020, "Wrong size on CryptBPLibrary_ConvertStringToBytes");
static_assert(offsetof(CryptBPLibrary_ConvertStringToBytes, String) == 0x000000, "Member 'CryptBPLibrary_ConvertStringToBytes::String' has a wrong offset!");
