#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SplinePath

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SplinePath.SplinePath_C.ExecuteUbergraph_SplinePath
// 0x00F8 (0x00F8 - 0x0000)
struct SplinePath_C_ExecuteUbergraph_SplinePath final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue; // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue1;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0070(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(SplinePath_C_ExecuteUbergraph_SplinePath) == 0x000008, "Wrong alignment on SplinePath_C_ExecuteUbergraph_SplinePath");
static_assert(sizeof(SplinePath_C_ExecuteUbergraph_SplinePath) == 0x0000F8, "Wrong size on SplinePath_C_ExecuteUbergraph_SplinePath");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, EntryPoint) == 0x000000, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::EntryPoint' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Array_Get_Item) == 0x000008, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Add_IntInt_ReturnValue1) == 0x00000C, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Add_IntInt_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Less_FloatFloat_ReturnValue) == 0x00001D, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Less_IntInt_ReturnValue) == 0x00001E, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_GetSplineLength_ReturnValue) == 0x000020, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, K2Node_Event_DeltaSeconds) == 0x000024, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_FInterpTo_ReturnValue) == 0x000028, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Add_FloatFloat_ReturnValue) == 0x00002C, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue) == 0x000030, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_GetRotationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x00003C, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000048, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_BreakVector_X) == 0x000050, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_BreakVector_Y) == 0x000054, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_BreakVector_Z) == 0x000058, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_Add_FloatFloat_ReturnValue1) == 0x00005C, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_Add_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_ExecuteUbergraph_SplinePath, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000070, "Member 'SplinePath_C_ExecuteUbergraph_SplinePath::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");

// Function SplinePath.SplinePath_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SplinePath_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SplinePath_C_ReceiveTick) == 0x000004, "Wrong alignment on SplinePath_C_ReceiveTick");
static_assert(sizeof(SplinePath_C_ReceiveTick) == 0x000004, "Wrong size on SplinePath_C_ReceiveTick");
static_assert(offsetof(SplinePath_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SplinePath_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function SplinePath.SplinePath_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct SplinePath_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SplinePath_C_UserConstructionScript) == 0x000004, "Wrong alignment on SplinePath_C_UserConstructionScript");
static_assert(sizeof(SplinePath_C_UserConstructionScript) == 0x000018, "Wrong size on SplinePath_C_UserConstructionScript");
static_assert(offsetof(SplinePath_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'SplinePath_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_UserConstructionScript, Temp_int_Variable) == 0x000004, "Member 'SplinePath_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SplinePath_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'SplinePath_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_UserConstructionScript, CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue) == 0x00000C, "Member 'SplinePath_C_UserConstructionScript::CallFunc_GetDistanceAlongSplineAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000010, "Member 'SplinePath_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(SplinePath_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000014, "Member 'SplinePath_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

