#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SSplineMeshDetails

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ESplineMeshStretchMode_structs.hpp"
#include "ESplineMeshType_structs.hpp"
#include "ESplineMeshSequenceType_structs.hpp"
#include "ESplineMeshSequenceDistanceModifierType_structs.hpp"


namespace SDK
{

// UserDefinedStruct SSplineMeshDetails.SSplineMeshDetails
// 0x00B0 (0x00B0 - 0x0000)
struct FSSplineMeshDetails final
{
public:
	TArray<class UStaticMesh*>                    Meshes_60_29F9A50B466891F28C98768C30E73D4F;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	ESplineMeshType                               PlacementMethod_33_D5645BDE4F4CEEAB24A775A48991372A; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshStretchMode                        StretchMode_34_C0A2DEC74762753D6B2000A329043571;   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshSequenceType                       MeshSequence_62_52D12A3D4F20092B81AFF1837A7F9CF3;  // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESplineMeshSequenceDistanceModifierType       MeshSequenceDistanceModifier_61_E7CC019D4188FCE9A117BD8FA133151A; // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AtStart_64_9BB0B9614BA261F0DAE4E5A52904B672;       // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InMiddle_65_0F645F1A46F1E0E4F4C4BA8D7D9C8AB9;      // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AtEnd_66_96CA00BA4416D3415CA6DB92D9B26E45;         // 0x0016(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DesiredSpacing_58_0B7D78974C86158CABFF5194B616A8F6; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gap_42_CBA8DE1B42D85111B04E1AA0B1B341F3;           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParentGroup_59_7113ECA545391EA2ADADCC93F300F8CC;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeshLengthTolerance_57_8FF838794A1DD10BDFD6DBA5856B3E41; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    StartMeshes_73_EE8E41CF4344F26F8081D7B8EFBC8FDA;   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<class UStaticMesh*>                    EndMeshes_74_E3E6E734498E6E8EAC8B6CA90677F76C;     // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             OffsetTransform_81_97E75E504E9F52272B2DCD98B9EFCF48; // 0x0050(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	struct FTransform                             RandomOffsetTransform_82_1B085090443BE35EF3BCD5B9A1C29B33; // 0x0080(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FSSplineMeshDetails) == 0x000010, "Wrong alignment on FSSplineMeshDetails");
static_assert(sizeof(FSSplineMeshDetails) == 0x0000B0, "Wrong size on FSSplineMeshDetails");
static_assert(offsetof(FSSplineMeshDetails, Meshes_60_29F9A50B466891F28C98768C30E73D4F) == 0x000000, "Member 'FSSplineMeshDetails::Meshes_60_29F9A50B466891F28C98768C30E73D4F' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, PlacementMethod_33_D5645BDE4F4CEEAB24A775A48991372A) == 0x000010, "Member 'FSSplineMeshDetails::PlacementMethod_33_D5645BDE4F4CEEAB24A775A48991372A' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, StretchMode_34_C0A2DEC74762753D6B2000A329043571) == 0x000011, "Member 'FSSplineMeshDetails::StretchMode_34_C0A2DEC74762753D6B2000A329043571' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, MeshSequence_62_52D12A3D4F20092B81AFF1837A7F9CF3) == 0x000012, "Member 'FSSplineMeshDetails::MeshSequence_62_52D12A3D4F20092B81AFF1837A7F9CF3' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, MeshSequenceDistanceModifier_61_E7CC019D4188FCE9A117BD8FA133151A) == 0x000013, "Member 'FSSplineMeshDetails::MeshSequenceDistanceModifier_61_E7CC019D4188FCE9A117BD8FA133151A' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, AtStart_64_9BB0B9614BA261F0DAE4E5A52904B672) == 0x000014, "Member 'FSSplineMeshDetails::AtStart_64_9BB0B9614BA261F0DAE4E5A52904B672' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, InMiddle_65_0F645F1A46F1E0E4F4C4BA8D7D9C8AB9) == 0x000015, "Member 'FSSplineMeshDetails::InMiddle_65_0F645F1A46F1E0E4F4C4BA8D7D9C8AB9' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, AtEnd_66_96CA00BA4416D3415CA6DB92D9B26E45) == 0x000016, "Member 'FSSplineMeshDetails::AtEnd_66_96CA00BA4416D3415CA6DB92D9B26E45' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, DesiredSpacing_58_0B7D78974C86158CABFF5194B616A8F6) == 0x000018, "Member 'FSSplineMeshDetails::DesiredSpacing_58_0B7D78974C86158CABFF5194B616A8F6' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, Gap_42_CBA8DE1B42D85111B04E1AA0B1B341F3) == 0x00001C, "Member 'FSSplineMeshDetails::Gap_42_CBA8DE1B42D85111B04E1AA0B1B341F3' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, ParentGroup_59_7113ECA545391EA2ADADCC93F300F8CC) == 0x000020, "Member 'FSSplineMeshDetails::ParentGroup_59_7113ECA545391EA2ADADCC93F300F8CC' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, MeshLengthTolerance_57_8FF838794A1DD10BDFD6DBA5856B3E41) == 0x000024, "Member 'FSSplineMeshDetails::MeshLengthTolerance_57_8FF838794A1DD10BDFD6DBA5856B3E41' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, StartMeshes_73_EE8E41CF4344F26F8081D7B8EFBC8FDA) == 0x000028, "Member 'FSSplineMeshDetails::StartMeshes_73_EE8E41CF4344F26F8081D7B8EFBC8FDA' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, EndMeshes_74_E3E6E734498E6E8EAC8B6CA90677F76C) == 0x000038, "Member 'FSSplineMeshDetails::EndMeshes_74_E3E6E734498E6E8EAC8B6CA90677F76C' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, OffsetTransform_81_97E75E504E9F52272B2DCD98B9EFCF48) == 0x000050, "Member 'FSSplineMeshDetails::OffsetTransform_81_97E75E504E9F52272B2DCD98B9EFCF48' has a wrong offset!");
static_assert(offsetof(FSSplineMeshDetails, RandomOffsetTransform_82_1B085090443BE35EF3BCD5B9A1C29B33) == 0x000080, "Member 'FSSplineMeshDetails::RandomOffsetTransform_82_1B085090443BE35EF3BCD5B9A1C29B33' has a wrong offset!");

}

