#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StartButton

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StartButton.StartButton_C
// 0x0298 (0x04A0 - 0x0208)
class UStartButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonBG;                                          // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                StartButton;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABPMainMenu_C*                          ParentActor;                                       // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           NewVar_0;                                          // 0x0228(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_StartButton(int32 EntryPoint);
	void BndEvt__StartButton_K2Node_ComponentBoundEvent_55_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StartButton_C">();
	}
	static class UStartButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartButton_C>();
	}
};
static_assert(alignof(UStartButton_C) == 0x000008, "Wrong alignment on UStartButton_C");
static_assert(sizeof(UStartButton_C) == 0x0004A0, "Wrong size on UStartButton_C");
static_assert(offsetof(UStartButton_C, UberGraphFrame) == 0x000208, "Member 'UStartButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartButton_C, ButtonBG) == 0x000210, "Member 'UStartButton_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UStartButton_C, StartButton) == 0x000218, "Member 'UStartButton_C::StartButton' has a wrong offset!");
static_assert(offsetof(UStartButton_C, ParentActor) == 0x000220, "Member 'UStartButton_C::ParentActor' has a wrong offset!");
static_assert(offsetof(UStartButton_C, NewVar_0) == 0x000228, "Member 'UStartButton_C::NewVar_0' has a wrong offset!");

}

