#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SteamTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "buttonParent_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SteamTips.SteamTips_C
// 0x0018 (0x0228 - 0x0210)
class USteamTips_C final : public UbuttonParent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_0;                                           // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                okButton;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SteamTips(int32 EntryPoint);
	void BndEvt__okButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SteamTips_C">();
	}
	static class USteamTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteamTips_C>();
	}
};
static_assert(alignof(USteamTips_C) == 0x000008, "Wrong alignment on USteamTips_C");
static_assert(sizeof(USteamTips_C) == 0x000228, "Wrong size on USteamTips_C");
static_assert(offsetof(USteamTips_C, UberGraphFrame) == 0x000210, "Member 'USteamTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USteamTips_C, Image_0) == 0x000218, "Member 'USteamTips_C::Image_0' has a wrong offset!");
static_assert(offsetof(USteamTips_C, okButton) == 0x000220, "Member 'USteamTips_C::okButton' has a wrong offset!");

}

