#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoryBoard

#include "Basic.hpp"

#include "Enum_ControllerType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Enum_Language_structs.hpp"


namespace SDK::Params
{

// Function StoryBoard.StoryBoard_C.ExecuteUbergraph_StoryBoard
// 0x02D0 (0x02D0 - 0x0000)
struct StoryBoard_C_ExecuteUbergraph_StoryBoard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ControllerType                           CallFunc_GetControllerType_ControllerType;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable2;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable3;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable4;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable5;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable6;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable7;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable8;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           Temp_object_Variable9;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable1;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable10;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable11;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable12;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable13;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable14;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable15;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable16;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable17;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable18;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable19;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable2;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable20;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable21;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable22;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable23;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable24;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable25;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable26;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable27;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable28;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable29;                            // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable3;                               // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable30;                            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable31;                            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable32;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable33;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable34;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable35;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable36;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable37;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable38;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable39;                            // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_ControllerType                           Temp_byte_Variable4;                               // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable40;                            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable5;                               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable41;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable42;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable43;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable44;                            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable45;                            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable46;                            // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable47;                            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable48;                            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable49;                            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable50;                            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Language                                 Temp_byte_Variable6;                               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable51;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable52;                            // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable53;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable54;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable55;                            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable56;                            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable57;                            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable58;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable59;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable60;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetDuration_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BreakTimespan_Days;                       // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Hours;                      // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Minutes;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Seconds;                    // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan_Milliseconds;               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_263[0x5];                                      // 0x0263(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           K2Node_Select_Default;                             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenSource_ReturnValue1;                  // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenSource_ReturnValue2;                  // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_273[0x1];                                      // 0x0273(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Progress;                       // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue1;             // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMer2GameInstance_C*                    K2Node_DynamicCast_AsMer_2Game_Instance1;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select1_Default;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select2_Default;                            // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select3_Default;                            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select4_Default;                            // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select5_Default;                            // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select6_Default;                            // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoryBoard_C_ExecuteUbergraph_StoryBoard) == 0x000008, "Wrong alignment on StoryBoard_C_ExecuteUbergraph_StoryBoard");
static_assert(sizeof(StoryBoard_C_ExecuteUbergraph_StoryBoard) == 0x0002D0, "Wrong size on StoryBoard_C_ExecuteUbergraph_StoryBoard");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, EntryPoint) == 0x000000, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_GetControllerType_ControllerType) == 0x000004, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_GetControllerType_ControllerType' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable) == 0x000005, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable) == 0x000008, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable1) == 0x000010, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable2) == 0x000018, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable3) == 0x000020, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable3' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable4) == 0x000028, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable4' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable5) == 0x000030, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable5' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable6) == 0x000038, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable6' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable7) == 0x000040, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable7' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable8) == 0x000048, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable8' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable9) == 0x000050, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable9' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable1) == 0x000058, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable10) == 0x000060, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable10' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable11) == 0x000068, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable11' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable12) == 0x000070, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable12' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable13) == 0x000078, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable13' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable14) == 0x000080, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable14' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable15) == 0x000088, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable15' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable16) == 0x000090, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable16' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable17) == 0x000098, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable17' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable18) == 0x0000A0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable18' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable19) == 0x0000A8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable19' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable2) == 0x0000B0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable20) == 0x0000B8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable20' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable21) == 0x0000C0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable21' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable22) == 0x0000C8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable22' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable23) == 0x0000D0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable23' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable24) == 0x0000D8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable24' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable25) == 0x0000E0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable25' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable26) == 0x0000E8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable26' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable27) == 0x0000F0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable27' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable28) == 0x0000F8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable28' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable29) == 0x000100, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable29' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable3) == 0x000108, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable30) == 0x000110, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable30' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable31) == 0x000118, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable31' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable32) == 0x000120, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable32' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable33) == 0x000128, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable33' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable34) == 0x000130, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable34' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable35) == 0x000138, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable35' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable36) == 0x000140, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable36' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable37) == 0x000148, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable37' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable38) == 0x000150, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable38' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable39) == 0x000158, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable39' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable4) == 0x000160, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable40) == 0x000168, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable40' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable5) == 0x000170, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable5' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable41) == 0x000178, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable41' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable42) == 0x000180, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable42' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable43) == 0x000188, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable43' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable44) == 0x000190, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable44' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable45) == 0x000198, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable45' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable46) == 0x0001A0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable46' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable47) == 0x0001A8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable47' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable48) == 0x0001B0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable48' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable49) == 0x0001B8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable49' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable50) == 0x0001C0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable50' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_byte_Variable6) == 0x0001C8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_byte_Variable6' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable51) == 0x0001D0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable51' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable52) == 0x0001D8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable52' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable53) == 0x0001E0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable53' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable54) == 0x0001E8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable54' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable55) == 0x0001F0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable55' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable56) == 0x0001F8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable56' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable57) == 0x000200, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable57' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable58) == 0x000208, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable58' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable59) == 0x000210, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable59' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, Temp_object_Variable60) == 0x000218, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::Temp_object_Variable60' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_GetDuration_ReturnValue) == 0x000220, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_GetDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_OpenSource_ReturnValue) == 0x000228, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BreakTimespan_Days) == 0x00022C, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BreakTimespan_Days' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BreakTimespan_Hours) == 0x000230, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BreakTimespan_Hours' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BreakTimespan_Minutes) == 0x000234, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BreakTimespan_Minutes' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BreakTimespan_Seconds) == 0x000238, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BreakTimespan_Seconds' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BreakTimespan_Milliseconds) == 0x00023C, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BreakTimespan_Milliseconds' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_GetGameInstance_ReturnValue) == 0x000240, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_Add_IntInt_ReturnValue) == 0x000248, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_DynamicCast_AsMer_2Game_Instance) == 0x000250, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_DynamicCast_AsMer_2Game_Instance' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_DynamicCast_bSuccess) == 0x000258, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00025C, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000260, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_EqualEqual_ByteByte_ReturnValue1) == 0x000261, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_EqualEqual_ByteByte_ReturnValue1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_BooleanOR_ReturnValue) == 0x000262, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select_Default) == 0x000268, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_Not_PreBool_ReturnValue) == 0x000270, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_OpenSource_ReturnValue1) == 0x000271, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_OpenSource_ReturnValue1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_OpenSource_ReturnValue2) == 0x000272, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_OpenSource_ReturnValue2' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_CustomEvent_Progress) == 0x000274, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_CustomEvent_Progress' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000278, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00027C, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_GetGameInstance_ReturnValue1) == 0x000280, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_GetGameInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_DynamicCast_AsMer_2Game_Instance1) == 0x000288, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_DynamicCast_AsMer_2Game_Instance1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_DynamicCast_bSuccess1) == 0x000290, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_DynamicCast_bSuccess1' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select1_Default) == 0x000298, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select1_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select2_Default) == 0x0002A0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select3_Default) == 0x0002A8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select3_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select4_Default) == 0x0002B0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select4_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select5_Default) == 0x0002B8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select5_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, K2Node_Select6_Default) == 0x0002C0, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::K2Node_Select6_Default' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_ExecuteUbergraph_StoryBoard, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002C8, "Member 'StoryBoard_C_ExecuteUbergraph_StoryBoard::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function StoryBoard.StoryBoard_C.OnSetSkipProgress
// 0x0004 (0x0004 - 0x0000)
struct StoryBoard_C_OnSetSkipProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoryBoard_C_OnSetSkipProgress) == 0x000004, "Wrong alignment on StoryBoard_C_OnSetSkipProgress");
static_assert(sizeof(StoryBoard_C_OnSetSkipProgress) == 0x000004, "Wrong size on StoryBoard_C_OnSetSkipProgress");
static_assert(offsetof(StoryBoard_C_OnSetSkipProgress, Progress) == 0x000000, "Member 'StoryBoard_C_OnSetSkipProgress::Progress' has a wrong offset!");

// Function StoryBoard.StoryBoard_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct StoryBoard_C_UserConstructionScript final
{
public:
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoryBoard_C_UserConstructionScript) == 0x000008, "Wrong alignment on StoryBoard_C_UserConstructionScript");
static_assert(sizeof(StoryBoard_C_UserConstructionScript) == 0x000010, "Wrong size on StoryBoard_C_UserConstructionScript");
static_assert(offsetof(StoryBoard_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000000, "Member 'StoryBoard_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoryBoard_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'StoryBoard_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

