#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SpawnerConfig

#include "Basic.hpp"

#include "Enum_SpawnerGenerationType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SpawnerConfig.Struct_SpawnerConfig
// 0x0058 (0x0058 - 0x0000)
struct FStruct_SpawnerConfig final
{
public:
	class UClass*                                 AIType_18_6EE7F25F428C16DC41E381A795536ED0;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AITag_48_C911C0B749221CCA403D189FF1705ED6;         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinFirstDelay_60_A4F753814D7CD749172902B36FB738BE; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxFirstDelay_59_42BCCDD842CA292D5E166F923CC0CAD1; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDelay_8_B754465E43C851B00397278155476A60;       // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F;      // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SpawnerGenerationType                    GenerationType_33_C8D12EC34F931C3573C132A1586CD72D; // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 OtherSpawner_53_0037BC2842506DFF7CDA5A950470A922;  // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          OtherAllDead_44_24D928E34B6C176628650C8EAC0A5AAC;  // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count_25_25CBC0EA4BFE51CAB989D592DAF39C30;         // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_StartSpline_C*                      SpawnSpline_28_00629B47480D0B5198856EAAF8846A6D;   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AICover_C*>                  CoverList_52_2A4B7DCF404036737D70CB8920BF8E88;     // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
};
static_assert(alignof(FStruct_SpawnerConfig) == 0x000008, "Wrong alignment on FStruct_SpawnerConfig");
static_assert(sizeof(FStruct_SpawnerConfig) == 0x000058, "Wrong size on FStruct_SpawnerConfig");
static_assert(offsetof(FStruct_SpawnerConfig, AIType_18_6EE7F25F428C16DC41E381A795536ED0) == 0x000000, "Member 'FStruct_SpawnerConfig::AIType_18_6EE7F25F428C16DC41E381A795536ED0' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, AITag_48_C911C0B749221CCA403D189FF1705ED6) == 0x000008, "Member 'FStruct_SpawnerConfig::AITag_48_C911C0B749221CCA403D189FF1705ED6' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, MinFirstDelay_60_A4F753814D7CD749172902B36FB738BE) == 0x000010, "Member 'FStruct_SpawnerConfig::MinFirstDelay_60_A4F753814D7CD749172902B36FB738BE' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, MaxFirstDelay_59_42BCCDD842CA292D5E166F923CC0CAD1) == 0x000014, "Member 'FStruct_SpawnerConfig::MaxFirstDelay_59_42BCCDD842CA292D5E166F923CC0CAD1' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, MinDelay_8_B754465E43C851B00397278155476A60) == 0x000018, "Member 'FStruct_SpawnerConfig::MinDelay_8_B754465E43C851B00397278155476A60' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F) == 0x00001C, "Member 'FStruct_SpawnerConfig::MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, GenerationType_33_C8D12EC34F931C3573C132A1586CD72D) == 0x000020, "Member 'FStruct_SpawnerConfig::GenerationType_33_C8D12EC34F931C3573C132A1586CD72D' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, OtherSpawner_53_0037BC2842506DFF7CDA5A950470A922) == 0x000028, "Member 'FStruct_SpawnerConfig::OtherSpawner_53_0037BC2842506DFF7CDA5A950470A922' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, OtherAllDead_44_24D928E34B6C176628650C8EAC0A5AAC) == 0x000038, "Member 'FStruct_SpawnerConfig::OtherAllDead_44_24D928E34B6C176628650C8EAC0A5AAC' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, Count_25_25CBC0EA4BFE51CAB989D592DAF39C30) == 0x00003C, "Member 'FStruct_SpawnerConfig::Count_25_25CBC0EA4BFE51CAB989D592DAF39C30' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, SpawnSpline_28_00629B47480D0B5198856EAAF8846A6D) == 0x000040, "Member 'FStruct_SpawnerConfig::SpawnSpline_28_00629B47480D0B5198856EAAF8846A6D' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnerConfig, CoverList_52_2A4B7DCF404036737D70CB8920BF8E88) == 0x000048, "Member 'FStruct_SpawnerConfig::CoverList_52_2A4B7DCF404036737D70CB8920BF8E88' has a wrong offset!");

}

