#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DeadlyBulletSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DeadlyBulletSettings.Struct_DeadlyBulletSettings
// 0x004C (0x004C - 0x0000)
struct FStruct_DeadlyBulletSettings final
{
public:
	int32                                         BulletNumMIN_42_FCC34FA34787551031045CA4F6D011C9;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletNumMAX_43_466928DC4F1015D44FD3538B357BBAC8;  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletWaveIntervalMIN_38_58D434754F27FD7355FB1D899CD3B50D; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletWaveIntervalMAX_39_1B5FEC864E95BBEB247B138CA428F962; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletIntervalMin_40_8C81FE254A65ABAAB1A0BC821F5030D5; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BulletIntervalMax_41_9041E9F34D78FD45E288E1805EF9D104; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoneWeight_23_D3A7E44346B9416B31199D9C34BAA75D;    // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealPackWeight_26_239AA3A64406FE6FC8BD429A3B08155B; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GunAyWeight_25_23D6B46244B42723704F5A915C3FA48A;   // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RevolverWeight_24_A5F274AE41B52CEC4DB2F9B4821AB0F9; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         M32Weight_60_0693071641BA36B52364A991F3271AC8;     // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SniperWeight_61_0E4A1407403B0619ACC3DBB019F9D8E6;  // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PowerUpWeight_64_50566449461A2179EDC6CBBCA4081394; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeadBulletSpeed_46_E5F1490542E92A7A6FA5F88539908C99; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeadBulletDamage_48_17080B02438CE42C969B9391914A094D; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DroneMissileDamage_53_EECDBDE64825BCE55583E88FDA88E685; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BossMissileDamage_55_318A1DD54640D92EAD12489C33D64862; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpiderExplodeDamage_68_B5206A4E4DF2BFADBF4EC7B9C1415F4A; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrenadeDamgeRate_71_9454977B4662582343F17483CF2255EC; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_DeadlyBulletSettings) == 0x000004, "Wrong alignment on FStruct_DeadlyBulletSettings");
static_assert(sizeof(FStruct_DeadlyBulletSettings) == 0x00004C, "Wrong size on FStruct_DeadlyBulletSettings");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletNumMIN_42_FCC34FA34787551031045CA4F6D011C9) == 0x000000, "Member 'FStruct_DeadlyBulletSettings::BulletNumMIN_42_FCC34FA34787551031045CA4F6D011C9' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletNumMAX_43_466928DC4F1015D44FD3538B357BBAC8) == 0x000004, "Member 'FStruct_DeadlyBulletSettings::BulletNumMAX_43_466928DC4F1015D44FD3538B357BBAC8' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletWaveIntervalMIN_38_58D434754F27FD7355FB1D899CD3B50D) == 0x000008, "Member 'FStruct_DeadlyBulletSettings::BulletWaveIntervalMIN_38_58D434754F27FD7355FB1D899CD3B50D' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletWaveIntervalMAX_39_1B5FEC864E95BBEB247B138CA428F962) == 0x00000C, "Member 'FStruct_DeadlyBulletSettings::BulletWaveIntervalMAX_39_1B5FEC864E95BBEB247B138CA428F962' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletIntervalMin_40_8C81FE254A65ABAAB1A0BC821F5030D5) == 0x000010, "Member 'FStruct_DeadlyBulletSettings::BulletIntervalMin_40_8C81FE254A65ABAAB1A0BC821F5030D5' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BulletIntervalMax_41_9041E9F34D78FD45E288E1805EF9D104) == 0x000014, "Member 'FStruct_DeadlyBulletSettings::BulletIntervalMax_41_9041E9F34D78FD45E288E1805EF9D104' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, NoneWeight_23_D3A7E44346B9416B31199D9C34BAA75D) == 0x000018, "Member 'FStruct_DeadlyBulletSettings::NoneWeight_23_D3A7E44346B9416B31199D9C34BAA75D' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, HealPackWeight_26_239AA3A64406FE6FC8BD429A3B08155B) == 0x00001C, "Member 'FStruct_DeadlyBulletSettings::HealPackWeight_26_239AA3A64406FE6FC8BD429A3B08155B' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, GunAyWeight_25_23D6B46244B42723704F5A915C3FA48A) == 0x000020, "Member 'FStruct_DeadlyBulletSettings::GunAyWeight_25_23D6B46244B42723704F5A915C3FA48A' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, RevolverWeight_24_A5F274AE41B52CEC4DB2F9B4821AB0F9) == 0x000024, "Member 'FStruct_DeadlyBulletSettings::RevolverWeight_24_A5F274AE41B52CEC4DB2F9B4821AB0F9' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, M32Weight_60_0693071641BA36B52364A991F3271AC8) == 0x000028, "Member 'FStruct_DeadlyBulletSettings::M32Weight_60_0693071641BA36B52364A991F3271AC8' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, SniperWeight_61_0E4A1407403B0619ACC3DBB019F9D8E6) == 0x00002C, "Member 'FStruct_DeadlyBulletSettings::SniperWeight_61_0E4A1407403B0619ACC3DBB019F9D8E6' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, PowerUpWeight_64_50566449461A2179EDC6CBBCA4081394) == 0x000030, "Member 'FStruct_DeadlyBulletSettings::PowerUpWeight_64_50566449461A2179EDC6CBBCA4081394' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, DeadBulletSpeed_46_E5F1490542E92A7A6FA5F88539908C99) == 0x000034, "Member 'FStruct_DeadlyBulletSettings::DeadBulletSpeed_46_E5F1490542E92A7A6FA5F88539908C99' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, DeadBulletDamage_48_17080B02438CE42C969B9391914A094D) == 0x000038, "Member 'FStruct_DeadlyBulletSettings::DeadBulletDamage_48_17080B02438CE42C969B9391914A094D' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, DroneMissileDamage_53_EECDBDE64825BCE55583E88FDA88E685) == 0x00003C, "Member 'FStruct_DeadlyBulletSettings::DroneMissileDamage_53_EECDBDE64825BCE55583E88FDA88E685' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, BossMissileDamage_55_318A1DD54640D92EAD12489C33D64862) == 0x000040, "Member 'FStruct_DeadlyBulletSettings::BossMissileDamage_55_318A1DD54640D92EAD12489C33D64862' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, SpiderExplodeDamage_68_B5206A4E4DF2BFADBF4EC7B9C1415F4A) == 0x000044, "Member 'FStruct_DeadlyBulletSettings::SpiderExplodeDamage_68_B5206A4E4DF2BFADBF4EC7B9C1415F4A' has a wrong offset!");
static_assert(offsetof(FStruct_DeadlyBulletSettings, GrenadeDamgeRate_71_9454977B4662582343F17483CF2255EC) == 0x000048, "Member 'FStruct_DeadlyBulletSettings::GrenadeDamgeRate_71_9454977B4662582343F17483CF2255EC' has a wrong offset!");

}

