#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Lv2_FailedTips

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Lv2_FailedTips.Struct_Lv2_FailedTips
// 0x0050 (0x0050 - 0x0000)
struct FStruct_Lv2_FailedTips final
{
public:
	class UParticleSystem*                        ZH_10_4B2F2CE84BCDBDD23C60C694C8A77541;            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EN_11_C9A28D954841C74C918F9090ADCA58A7;            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FR_12_4A580B9D4F380C011946828C3750F49A;            // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        DE_13_92DE3BFE45826C02CE6655A45C0F2A7F;            // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ES_14_D90948DC438F63BC71D23C9C0E46F19F;            // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        IT_15_9086009A453255F23E9AB78AF9482483;            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        JP_20_0EFBC3C0479AE253B4B93F8A6C561BBF;            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        KR_21_B958955C4BE311675B973C8E5CFA0CCC;            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        RU_22_DEE2844B48C810162B45C8A92BF0E9F4;            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ZH_T_23_ED398E4D4D05D923EDEEB1906AED5313;          // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Lv2_FailedTips) == 0x000008, "Wrong alignment on FStruct_Lv2_FailedTips");
static_assert(sizeof(FStruct_Lv2_FailedTips) == 0x000050, "Wrong size on FStruct_Lv2_FailedTips");
static_assert(offsetof(FStruct_Lv2_FailedTips, ZH_10_4B2F2CE84BCDBDD23C60C694C8A77541) == 0x000000, "Member 'FStruct_Lv2_FailedTips::ZH_10_4B2F2CE84BCDBDD23C60C694C8A77541' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, EN_11_C9A28D954841C74C918F9090ADCA58A7) == 0x000008, "Member 'FStruct_Lv2_FailedTips::EN_11_C9A28D954841C74C918F9090ADCA58A7' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, FR_12_4A580B9D4F380C011946828C3750F49A) == 0x000010, "Member 'FStruct_Lv2_FailedTips::FR_12_4A580B9D4F380C011946828C3750F49A' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, DE_13_92DE3BFE45826C02CE6655A45C0F2A7F) == 0x000018, "Member 'FStruct_Lv2_FailedTips::DE_13_92DE3BFE45826C02CE6655A45C0F2A7F' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, ES_14_D90948DC438F63BC71D23C9C0E46F19F) == 0x000020, "Member 'FStruct_Lv2_FailedTips::ES_14_D90948DC438F63BC71D23C9C0E46F19F' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, IT_15_9086009A453255F23E9AB78AF9482483) == 0x000028, "Member 'FStruct_Lv2_FailedTips::IT_15_9086009A453255F23E9AB78AF9482483' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, JP_20_0EFBC3C0479AE253B4B93F8A6C561BBF) == 0x000030, "Member 'FStruct_Lv2_FailedTips::JP_20_0EFBC3C0479AE253B4B93F8A6C561BBF' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, KR_21_B958955C4BE311675B973C8E5CFA0CCC) == 0x000038, "Member 'FStruct_Lv2_FailedTips::KR_21_B958955C4BE311675B973C8E5CFA0CCC' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, RU_22_DEE2844B48C810162B45C8A92BF0E9F4) == 0x000040, "Member 'FStruct_Lv2_FailedTips::RU_22_DEE2844B48C810162B45C8A92BF0E9F4' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_FailedTips, ZH_T_23_ED398E4D4D05D923EDEEB1906AED5313) == 0x000048, "Member 'FStruct_Lv2_FailedTips::ZH_T_23_ED398E4D4D05D923EDEEB1906AED5313' has a wrong offset!");

}

