#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_LanguageText

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_LanguageText.Struct_LanguageText
// 0x00F0 (0x00F0 - 0x0000)
struct FStruct_LanguageText final
{
public:
	class FString                                 EN_13_7E3695264964AFDB3A28D4A301FE7328;            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         EN_SIZE_14_FC6925774288FC09F98336A3DC1ADFC7;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ZH_15_1CAAFD924AD0E267AEAE918D0F827FD6;            // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ZH_SIZE_16_CA0A3D3F424E0954B21459B16A6CB639;       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FR_53_2A31D9E948DD39CA1FEEC08B3906FFA4;            // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         FR_SIZE_54_2344E25A4442430838FA0685893FB98B;       // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DE_55_17046A4B4986AC53C05616B03AC27B4A;            // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         DE_SIZE_56_10324BCA4F8A9AC231D123A65631DB3E;       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ES_57_74F789854112771AC8F93E92A414BE2A;            // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ES_SIZE_58_0CC3AFFB4C2D88553E6C959570BCF2B8;       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 IT_59_73EFACB94C88F9A78C2493B3C8361F8F;            // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         IT_SIZE_60_76DA524545AB2991CF0F4EA9349CDB82;       // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 JP_61_D3E903554023947E0C54E19F7FD7DB6A;            // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         JP_SIZE_62_8C9CA0274B986F8805178B9A9A2A3098;       // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 KR_63_57CDD8F54C7A7C1E7204358579E77B1B;            // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         KR_SIZE_64_8E26BC0548A638C9E2934AAE122D6D28;       // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RU_65_214C3721409B688888E965B3B1BF4673;            // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         RU_SIZE_66_EA8ABF9A4E44EDB826CA19981739D29E;       // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ZH_TW_71_62B234E040EA21DA2E42D48AC8F8825E;         // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ZH_TW_SIZE_70_1E9E6DD146C3B7C75D99DAA5DC7B2DD9;    // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_LanguageText) == 0x000008, "Wrong alignment on FStruct_LanguageText");
static_assert(sizeof(FStruct_LanguageText) == 0x0000F0, "Wrong size on FStruct_LanguageText");
static_assert(offsetof(FStruct_LanguageText, EN_13_7E3695264964AFDB3A28D4A301FE7328) == 0x000000, "Member 'FStruct_LanguageText::EN_13_7E3695264964AFDB3A28D4A301FE7328' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, EN_SIZE_14_FC6925774288FC09F98336A3DC1ADFC7) == 0x000010, "Member 'FStruct_LanguageText::EN_SIZE_14_FC6925774288FC09F98336A3DC1ADFC7' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ZH_15_1CAAFD924AD0E267AEAE918D0F827FD6) == 0x000018, "Member 'FStruct_LanguageText::ZH_15_1CAAFD924AD0E267AEAE918D0F827FD6' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ZH_SIZE_16_CA0A3D3F424E0954B21459B16A6CB639) == 0x000028, "Member 'FStruct_LanguageText::ZH_SIZE_16_CA0A3D3F424E0954B21459B16A6CB639' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, FR_53_2A31D9E948DD39CA1FEEC08B3906FFA4) == 0x000030, "Member 'FStruct_LanguageText::FR_53_2A31D9E948DD39CA1FEEC08B3906FFA4' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, FR_SIZE_54_2344E25A4442430838FA0685893FB98B) == 0x000040, "Member 'FStruct_LanguageText::FR_SIZE_54_2344E25A4442430838FA0685893FB98B' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, DE_55_17046A4B4986AC53C05616B03AC27B4A) == 0x000048, "Member 'FStruct_LanguageText::DE_55_17046A4B4986AC53C05616B03AC27B4A' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, DE_SIZE_56_10324BCA4F8A9AC231D123A65631DB3E) == 0x000058, "Member 'FStruct_LanguageText::DE_SIZE_56_10324BCA4F8A9AC231D123A65631DB3E' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ES_57_74F789854112771AC8F93E92A414BE2A) == 0x000060, "Member 'FStruct_LanguageText::ES_57_74F789854112771AC8F93E92A414BE2A' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ES_SIZE_58_0CC3AFFB4C2D88553E6C959570BCF2B8) == 0x000070, "Member 'FStruct_LanguageText::ES_SIZE_58_0CC3AFFB4C2D88553E6C959570BCF2B8' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, IT_59_73EFACB94C88F9A78C2493B3C8361F8F) == 0x000078, "Member 'FStruct_LanguageText::IT_59_73EFACB94C88F9A78C2493B3C8361F8F' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, IT_SIZE_60_76DA524545AB2991CF0F4EA9349CDB82) == 0x000088, "Member 'FStruct_LanguageText::IT_SIZE_60_76DA524545AB2991CF0F4EA9349CDB82' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, JP_61_D3E903554023947E0C54E19F7FD7DB6A) == 0x000090, "Member 'FStruct_LanguageText::JP_61_D3E903554023947E0C54E19F7FD7DB6A' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, JP_SIZE_62_8C9CA0274B986F8805178B9A9A2A3098) == 0x0000A0, "Member 'FStruct_LanguageText::JP_SIZE_62_8C9CA0274B986F8805178B9A9A2A3098' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, KR_63_57CDD8F54C7A7C1E7204358579E77B1B) == 0x0000A8, "Member 'FStruct_LanguageText::KR_63_57CDD8F54C7A7C1E7204358579E77B1B' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, KR_SIZE_64_8E26BC0548A638C9E2934AAE122D6D28) == 0x0000B8, "Member 'FStruct_LanguageText::KR_SIZE_64_8E26BC0548A638C9E2934AAE122D6D28' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, RU_65_214C3721409B688888E965B3B1BF4673) == 0x0000C0, "Member 'FStruct_LanguageText::RU_65_214C3721409B688888E965B3B1BF4673' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, RU_SIZE_66_EA8ABF9A4E44EDB826CA19981739D29E) == 0x0000D0, "Member 'FStruct_LanguageText::RU_SIZE_66_EA8ABF9A4E44EDB826CA19981739D29E' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ZH_TW_71_62B234E040EA21DA2E42D48AC8F8825E) == 0x0000D8, "Member 'FStruct_LanguageText::ZH_TW_71_62B234E040EA21DA2E42D48AC8F8825E' has a wrong offset!");
static_assert(offsetof(FStruct_LanguageText, ZH_TW_SIZE_70_1E9E6DD146C3B7C75D99DAA5DC7B2DD9) == 0x0000E8, "Member 'FStruct_LanguageText::ZH_TW_SIZE_70_1E9E6DD146C3B7C75D99DAA5DC7B2DD9' has a wrong offset!");

}

