#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_BindTriggerAllure

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_BindTriggerAllure.Struct_BindTriggerAllure
// 0x0018 (0x0018 - 0x0000)
struct FStruct_BindTriggerAllure final
{
public:
	class ABP_TriggerAllure_C*                    _TriggerAllure_8_2068794F41CC06690CB1F8ABA3F03A49; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 _TargetPos_11_BC90052C4ED3441E3F78BFA6654ECD53;    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           _AllureAnim_9_380BDEB14A42FDE7EFE0FF9381A8D994;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_BindTriggerAllure) == 0x000008, "Wrong alignment on FStruct_BindTriggerAllure");
static_assert(sizeof(FStruct_BindTriggerAllure) == 0x000018, "Wrong size on FStruct_BindTriggerAllure");
static_assert(offsetof(FStruct_BindTriggerAllure, _TriggerAllure_8_2068794F41CC06690CB1F8ABA3F03A49) == 0x000000, "Member 'FStruct_BindTriggerAllure::_TriggerAllure_8_2068794F41CC06690CB1F8ABA3F03A49' has a wrong offset!");
static_assert(offsetof(FStruct_BindTriggerAllure, _TargetPos_11_BC90052C4ED3441E3F78BFA6654ECD53) == 0x000008, "Member 'FStruct_BindTriggerAllure::_TargetPos_11_BC90052C4ED3441E3F78BFA6654ECD53' has a wrong offset!");
static_assert(offsetof(FStruct_BindTriggerAllure, _AllureAnim_9_380BDEB14A42FDE7EFE0FF9381A8D994) == 0x000010, "Member 'FStruct_BindTriggerAllure::_AllureAnim_9_380BDEB14A42FDE7EFE0FF9381A8D994' has a wrong offset!");

}

