#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_PatrolParam

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_PatrolParam.Struct_PatrolParam
// 0x0010 (0x0010 - 0x0000)
struct FStruct_PatrolParam final
{
public:
	int32                                         _Indexspline_10_0CEAA48B478EE360442430A38959F970;  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _WaitTime_9_5F247A87497AED596EF5DB851ED84DB8;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           _AnimToPlay_11_9FFA954146E3AF90C022779B161AF65F;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_PatrolParam) == 0x000008, "Wrong alignment on FStruct_PatrolParam");
static_assert(sizeof(FStruct_PatrolParam) == 0x000010, "Wrong size on FStruct_PatrolParam");
static_assert(offsetof(FStruct_PatrolParam, _Indexspline_10_0CEAA48B478EE360442430A38959F970) == 0x000000, "Member 'FStruct_PatrolParam::_Indexspline_10_0CEAA48B478EE360442430A38959F970' has a wrong offset!");
static_assert(offsetof(FStruct_PatrolParam, _WaitTime_9_5F247A87497AED596EF5DB851ED84DB8) == 0x000004, "Member 'FStruct_PatrolParam::_WaitTime_9_5F247A87497AED596EF5DB851ED84DB8' has a wrong offset!");
static_assert(offsetof(FStruct_PatrolParam, _AnimToPlay_11_9FFA954146E3AF90C022779B161AF65F) == 0x000008, "Member 'FStruct_PatrolParam::_AnimToPlay_11_9FFA954146E3AF90C022779B161AF65F' has a wrong offset!");

}

