#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NumberTrigger

#include "Basic.hpp"

#include "Enum_OperationType_structs.hpp"
#include "Enum_BehaviorType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NumberTrigger.Struct_NumberTrigger
// 0x000C (0x000C - 0x0000)
struct FStruct_NumberTrigger final
{
public:
	Enum_OperationType                            ArithmeticOperation_43_FDC772354B4F5CFF82FCEABB9240AE3D; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Percentage_28_2794CD11424E9D3F9B4849B9A9887458;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BehaviorType                             BehaviorTo_25_9958D2FF4F7AA18327C6A1ABFE7A0EEA;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OneTimeOnly_45_7B223F744C914A01AD264C95E697C350;   // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_NumberTrigger) == 0x000004, "Wrong alignment on FStruct_NumberTrigger");
static_assert(sizeof(FStruct_NumberTrigger) == 0x00000C, "Wrong size on FStruct_NumberTrigger");
static_assert(offsetof(FStruct_NumberTrigger, ArithmeticOperation_43_FDC772354B4F5CFF82FCEABB9240AE3D) == 0x000000, "Member 'FStruct_NumberTrigger::ArithmeticOperation_43_FDC772354B4F5CFF82FCEABB9240AE3D' has a wrong offset!");
static_assert(offsetof(FStruct_NumberTrigger, Percentage_28_2794CD11424E9D3F9B4849B9A9887458) == 0x000004, "Member 'FStruct_NumberTrigger::Percentage_28_2794CD11424E9D3F9B4849B9A9887458' has a wrong offset!");
static_assert(offsetof(FStruct_NumberTrigger, BehaviorTo_25_9958D2FF4F7AA18327C6A1ABFE7A0EEA) == 0x000008, "Member 'FStruct_NumberTrigger::BehaviorTo_25_9958D2FF4F7AA18327C6A1ABFE7A0EEA' has a wrong offset!");
static_assert(offsetof(FStruct_NumberTrigger, OneTimeOnly_45_7B223F744C914A01AD264C95E697C350) == 0x000009, "Member 'FStruct_NumberTrigger::OneTimeOnly_45_7B223F744C914A01AD264C95E697C350' has a wrong offset!");

}

