#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_SpawnProjectile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_SpawnProjectile.Struct_SpawnProjectile
// 0x0018 (0x0018 - 0x0000)
struct FStruct_SpawnProjectile final
{
public:
	class UClass*                                 ProjectileClass_4_570C5EB14E66FDB6A387779D1AC7CE1E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction_7_20A70BBA4A3090A57BE6768422C1CC36;      // 0x0008(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpecial_10_200C4C80427F58365C235399F3A7EA0B;     // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FStruct_SpawnProjectile) == 0x000008, "Wrong alignment on FStruct_SpawnProjectile");
static_assert(sizeof(FStruct_SpawnProjectile) == 0x000018, "Wrong size on FStruct_SpawnProjectile");
static_assert(offsetof(FStruct_SpawnProjectile, ProjectileClass_4_570C5EB14E66FDB6A387779D1AC7CE1E) == 0x000000, "Member 'FStruct_SpawnProjectile::ProjectileClass_4_570C5EB14E66FDB6A387779D1AC7CE1E' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnProjectile, Direction_7_20A70BBA4A3090A57BE6768422C1CC36) == 0x000008, "Member 'FStruct_SpawnProjectile::Direction_7_20A70BBA4A3090A57BE6768422C1CC36' has a wrong offset!");
static_assert(offsetof(FStruct_SpawnProjectile, IsSpecial_10_200C4C80427F58365C235399F3A7EA0B) == 0x000014, "Member 'FStruct_SpawnProjectile::IsSpecial_10_200C4C80427F58365C235399F3A7EA0B' has a wrong offset!");

}

