#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Lv2_Spawner

#include "Basic.hpp"

#include "Enum_BehaviorType_structs.hpp"
#include "Enum_SpawnerGenerationType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Lv2_Spawner.Struct_Lv2_Spawner
// 0x0038 (0x0038 - 0x0000)
struct FStruct_Lv2_Spawner final
{
public:
	class UClass*                                 AIType_66_6EE7F25F428C16DC41E381A795536ED0;        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BehaviorType                             InitBehaviorType_70_47AEE3224340654617280FAB3FA919B7; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FirstDelay_67_A4F753814D7CD749172902B36FB738BE;    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDelay_8_B754465E43C851B00397278155476A60;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SpawnerGenerationType                    GenerationType_33_C8D12EC34F931C3573C132A1586CD72D; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Count_25_25CBC0EA4BFE51CAB989D592DAF39C30;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PatrolRoute_C*                      SpawnSpline_65_00629B47480D0B5198856EAAF8846A6D;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Lv2_TargetPoint_C*>          MovePoint_74_5640889E4A575B8D16748B882F056D4A;     // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate)
};
static_assert(alignof(FStruct_Lv2_Spawner) == 0x000008, "Wrong alignment on FStruct_Lv2_Spawner");
static_assert(sizeof(FStruct_Lv2_Spawner) == 0x000038, "Wrong size on FStruct_Lv2_Spawner");
static_assert(offsetof(FStruct_Lv2_Spawner, AIType_66_6EE7F25F428C16DC41E381A795536ED0) == 0x000000, "Member 'FStruct_Lv2_Spawner::AIType_66_6EE7F25F428C16DC41E381A795536ED0' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, InitBehaviorType_70_47AEE3224340654617280FAB3FA919B7) == 0x000008, "Member 'FStruct_Lv2_Spawner::InitBehaviorType_70_47AEE3224340654617280FAB3FA919B7' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, FirstDelay_67_A4F753814D7CD749172902B36FB738BE) == 0x00000C, "Member 'FStruct_Lv2_Spawner::FirstDelay_67_A4F753814D7CD749172902B36FB738BE' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, MinDelay_8_B754465E43C851B00397278155476A60) == 0x000010, "Member 'FStruct_Lv2_Spawner::MinDelay_8_B754465E43C851B00397278155476A60' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F) == 0x000014, "Member 'FStruct_Lv2_Spawner::MaxDelay_10_9004E2BE48B699FEB2C19E8C7B1CF91F' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, GenerationType_33_C8D12EC34F931C3573C132A1586CD72D) == 0x000018, "Member 'FStruct_Lv2_Spawner::GenerationType_33_C8D12EC34F931C3573C132A1586CD72D' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, Count_25_25CBC0EA4BFE51CAB989D592DAF39C30) == 0x00001C, "Member 'FStruct_Lv2_Spawner::Count_25_25CBC0EA4BFE51CAB989D592DAF39C30' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, SpawnSpline_65_00629B47480D0B5198856EAAF8846A6D) == 0x000020, "Member 'FStruct_Lv2_Spawner::SpawnSpline_65_00629B47480D0B5198856EAAF8846A6D' has a wrong offset!");
static_assert(offsetof(FStruct_Lv2_Spawner, MovePoint_74_5640889E4A575B8D16748B882F056D4A) == 0x000028, "Member 'FStruct_Lv2_Spawner::MovePoint_74_5640889E4A575B8D16748B882F056D4A' has a wrong offset!");

}

