#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_DelayTrigger

#include "Basic.hpp"

#include "Enum_BehaviorType_structs.hpp"


namespace SDK
{

// UserDefinedStruct Struct_DelayTrigger.Struct_DelayTrigger
// 0x000C (0x000C - 0x0000)
struct FStruct_DelayTrigger final
{
public:
	float                                         Delay_12_A0D2C79541759213041F4D98AD235F21;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomDeviation_15_F4B483FC400E4FAEB1800EA3F9698C58; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_BehaviorType                             BehaviorTo_5_2C5AC3CF4016F66DAB9D21814A8B8F0C;     // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_DelayTrigger) == 0x000004, "Wrong alignment on FStruct_DelayTrigger");
static_assert(sizeof(FStruct_DelayTrigger) == 0x00000C, "Wrong size on FStruct_DelayTrigger");
static_assert(offsetof(FStruct_DelayTrigger, Delay_12_A0D2C79541759213041F4D98AD235F21) == 0x000000, "Member 'FStruct_DelayTrigger::Delay_12_A0D2C79541759213041F4D98AD235F21' has a wrong offset!");
static_assert(offsetof(FStruct_DelayTrigger, RandomDeviation_15_F4B483FC400E4FAEB1800EA3F9698C58) == 0x000004, "Member 'FStruct_DelayTrigger::RandomDeviation_15_F4B483FC400E4FAEB1800EA3F9698C58' has a wrong offset!");
static_assert(offsetof(FStruct_DelayTrigger, BehaviorTo_5_2C5AC3CF4016F66DAB9D21814A8B8F0C) == 0x000008, "Member 'FStruct_DelayTrigger::BehaviorTo_5_2C5AC3CF4016F66DAB9D21814A8B8F0C' has a wrong offset!");

}

