#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SwitchPointComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function SwitchPointComponent.SwitchPointComponent_C.ExecuteUbergraph_SwitchPointComponent
// 0x000C (0x000C - 0x0000)
struct SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent) == 0x000004, "Wrong alignment on SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent");
static_assert(sizeof(SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent) == 0x00000C, "Wrong size on SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent");
static_assert(offsetof(SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent, EntryPoint) == 0x000000, "Member 'SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'SwitchPointComponent_C_ExecuteUbergraph_SwitchPointComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function SwitchPointComponent.SwitchPointComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct SwitchPointComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SwitchPointComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on SwitchPointComponent_C_ReceiveTick");
static_assert(sizeof(SwitchPointComponent_C_ReceiveTick) == 0x000004, "Wrong size on SwitchPointComponent_C_ReceiveTick");
static_assert(offsetof(SwitchPointComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'SwitchPointComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

