#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "PhysXVehicles_structs.hpp"
#include "PhysXVehicles_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Tunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint.Tunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C
// 0x01C0 (0x0AC0 - 0x0900)
class UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C final : public UVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0900(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F9E988AB487EF51CBF1F24A9644F6830; // 0x0908(0x0040)()
	struct FAnimNode_WheelHandler                 AnimGraphNode_WheelHandler_98FD2A4F4F747FAD2BFB37B76D35D4A0; // 0x0948(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C46E1F614BEE21203C011698CABEE09F; // 0x0A50(0x0040)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose_CD191DC0408BC25F0F7E04AED0BA9243; // 0x0A90(0x0030)()

public:
	void ExecuteUbergraph_Tunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Tunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C">();
	}
	static class UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C) == 0x000008, "Wrong alignment on UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C) == 0x000AC0, "Wrong size on UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000900, "Member 'UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C, AnimGraphNode_Root_F9E988AB487EF51CBF1F24A9644F6830) == 0x000908, "Member 'UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C::AnimGraphNode_Root_F9E988AB487EF51CBF1F24A9644F6830' has a wrong offset!");
static_assert(offsetof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C, AnimGraphNode_WheelHandler_98FD2A4F4F747FAD2BFB37B76D35D4A0) == 0x000948, "Member 'UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C::AnimGraphNode_WheelHandler_98FD2A4F4F747FAD2BFB37B76D35D4A0' has a wrong offset!");
static_assert(offsetof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_C46E1F614BEE21203C011698CABEE09F) == 0x000A50, "Member 'UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_C46E1F614BEE21203C011698CABEE09F' has a wrong offset!");
static_assert(offsetof(UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C, AnimGraphNode_MeshRefPose_CD191DC0408BC25F0F7E04AED0BA9243) == 0x000A90, "Member 'UTunnel_Vehicle_Prison_Van_Skeleton_AnimBlueprint_C::AnimGraphNode_MeshRefPose_CD191DC0408BC25F0F7E04AED0BA9243' has a wrong offset!");

}

