#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Tunnel_Vehicle_MC_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Tunnel_Vehicle_MC_Skeleton_AnimBlueprint.Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C.ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint
// 0x0068 (0x0068 - 0x0000)
struct Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue1;                 // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue2;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVehicle_MC_C*                          K2Node_DynamicCast_AsVehicle_MC;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEngineRotationSpeed_ReturnValue;       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint");
static_assert(sizeof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint) == 0x000068, "Wrong size on Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x00000C, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue1) == 0x000018, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000024, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue2) == 0x000028, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_GetOwningActor_ReturnValue) == 0x000038, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsVehicle_MC) == 0x000040, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsVehicle_MC' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_GetEngineRotationSpeed_ReturnValue) == 0x00004C, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_GetEngineRotationSpeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000050, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_Divide_FloatFloat_ReturnValue1) == 0x000054, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_Divide_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue1) == 0x00005C, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint, CallFunc_FInterpTo_ReturnValue) == 0x000060, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_ExecuteUbergraph_Tunnel_Vehicle_MC_Skeleton_AnimBlueprint::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function Tunnel_Vehicle_MC_Skeleton_AnimBlueprint.Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Tunnel_Vehicle_MC_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

}

