#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariantManagerContent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "VariantManagerContent_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class VariantManagerContent.LevelVariantSets
// 0x0060 (0x0088 - 0x0028)
class ULevelVariantSets final : public UObject
{
public:
	TArray<class UVariantSet*>                    VariantSets;                                       // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class UVariantSet*, bool>                DisplayNodeExpansionStates;                        // 0x0038(0x0050)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	int32 GetNumVariantSets();
	class UVariantSet* GetVariantSet(int32 VariantSetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelVariantSets">();
	}
	static class ULevelVariantSets* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULevelVariantSets>();
	}
};
static_assert(alignof(ULevelVariantSets) == 0x000008, "Wrong alignment on ULevelVariantSets");
static_assert(sizeof(ULevelVariantSets) == 0x000088, "Wrong size on ULevelVariantSets");
static_assert(offsetof(ULevelVariantSets, VariantSets) == 0x000028, "Member 'ULevelVariantSets::VariantSets' has a wrong offset!");
static_assert(offsetof(ULevelVariantSets, DisplayNodeExpansionStates) == 0x000038, "Member 'ULevelVariantSets::DisplayNodeExpansionStates' has a wrong offset!");

// Class VariantManagerContent.LevelVariantSetsActor
// 0x0018 (0x0340 - 0x0328)
class ALevelVariantSetsActor final : public AActor
{
public:
	struct FSoftObjectPath                        LevelVariantSets;                                  // 0x0328(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void SetLevelVariantSets(class ULevelVariantSets* InVariantSets);
	bool SwitchOnVariantByIndex(int32 VariantSetIndex, int32 VariantIndex);
	bool SwitchOnVariantByName(const class FString& VariantSetName, const class FString& VariantName);

	class ULevelVariantSets* GetLevelVariantSets(bool bLoad) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LevelVariantSetsActor">();
	}
	static class ALevelVariantSetsActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALevelVariantSetsActor>();
	}
};
static_assert(alignof(ALevelVariantSetsActor) == 0x000008, "Wrong alignment on ALevelVariantSetsActor");
static_assert(sizeof(ALevelVariantSetsActor) == 0x000340, "Wrong size on ALevelVariantSetsActor");
static_assert(offsetof(ALevelVariantSetsActor, LevelVariantSets) == 0x000328, "Member 'ALevelVariantSetsActor::LevelVariantSets' has a wrong offset!");

// Class VariantManagerContent.PropertyValue
// 0x00C8 (0x00F0 - 0x0028)
class UPropertyValue : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FullDisplayString;                                 // 0x0078(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bHasRecordedData;                                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsObjectProperty;                                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 ValueBytes;                                        // 0x0090(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	EPropertyValueCategory                        PropCategory;                                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UProperty*>                      Properties;                                        // 0x00A8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                 PropertyIndices;                                   // 0x00B8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0x28];                                      // 0x00C8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyValue">();
	}
	static class UPropertyValue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValue>();
	}
};
static_assert(alignof(UPropertyValue) == 0x000008, "Wrong alignment on UPropertyValue");
static_assert(sizeof(UPropertyValue) == 0x0000F0, "Wrong size on UPropertyValue");
static_assert(offsetof(UPropertyValue, FullDisplayString) == 0x000078, "Member 'UPropertyValue::FullDisplayString' has a wrong offset!");
static_assert(offsetof(UPropertyValue, bHasRecordedData) == 0x000088, "Member 'UPropertyValue::bHasRecordedData' has a wrong offset!");
static_assert(offsetof(UPropertyValue, bIsObjectProperty) == 0x000089, "Member 'UPropertyValue::bIsObjectProperty' has a wrong offset!");
static_assert(offsetof(UPropertyValue, ValueBytes) == 0x000090, "Member 'UPropertyValue::ValueBytes' has a wrong offset!");
static_assert(offsetof(UPropertyValue, PropCategory) == 0x0000A0, "Member 'UPropertyValue::PropCategory' has a wrong offset!");
static_assert(offsetof(UPropertyValue, Properties) == 0x0000A8, "Member 'UPropertyValue::Properties' has a wrong offset!");
static_assert(offsetof(UPropertyValue, PropertyIndices) == 0x0000B8, "Member 'UPropertyValue::PropertyIndices' has a wrong offset!");

// Class VariantManagerContent.PropertyValueMaterial
// 0x0000 (0x00F0 - 0x00F0)
class UPropertyValueMaterial final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyValueMaterial">();
	}
	static class UPropertyValueMaterial* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueMaterial>();
	}
};
static_assert(alignof(UPropertyValueMaterial) == 0x000008, "Wrong alignment on UPropertyValueMaterial");
static_assert(sizeof(UPropertyValueMaterial) == 0x0000F0, "Wrong size on UPropertyValueMaterial");

// Class VariantManagerContent.PropertyValueTransform
// 0x0000 (0x00F0 - 0x00F0)
class UPropertyValueTransform final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyValueTransform">();
	}
	static class UPropertyValueTransform* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueTransform>();
	}
};
static_assert(alignof(UPropertyValueTransform) == 0x000008, "Wrong alignment on UPropertyValueTransform");
static_assert(sizeof(UPropertyValueTransform) == 0x0000F0, "Wrong size on UPropertyValueTransform");

// Class VariantManagerContent.PropertyValueVisibility
// 0x0000 (0x00F0 - 0x00F0)
class UPropertyValueVisibility final : public UPropertyValue
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PropertyValueVisibility">();
	}
	static class UPropertyValueVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPropertyValueVisibility>();
	}
};
static_assert(alignof(UPropertyValueVisibility) == 0x000008, "Wrong alignment on UPropertyValueVisibility");
static_assert(sizeof(UPropertyValueVisibility) == 0x0000F0, "Wrong size on UPropertyValueVisibility");

// Class VariantManagerContent.Variant
// 0x0028 (0x0050 - 0x0028)
class UVariant final : public UObject
{
public:
	class FText                                   DisplayText;                                       // 0x0028(0x0018)(NativeAccessSpecifierPrivate)
	TArray<class UVariantObjectBinding*>          ObjectBindings;                                    // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	class AActor* GetActor(int32 ActorIndex);
	int32 GetNumActors();
	void SetDisplayText(const class FText& NewDisplayText);
	void SwitchOn();

	class FText GetDisplayText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"Variant">();
	}
	static class UVariant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariant>();
	}
};
static_assert(alignof(UVariant) == 0x000008, "Wrong alignment on UVariant");
static_assert(sizeof(UVariant) == 0x000050, "Wrong size on UVariant");
static_assert(offsetof(UVariant, DisplayText) == 0x000028, "Member 'UVariant::DisplayText' has a wrong offset!");
static_assert(offsetof(UVariant, ObjectBindings) == 0x000040, "Member 'UVariant::ObjectBindings' has a wrong offset!");

// Class VariantManagerContent.VariantObjectBinding
// 0x0048 (0x0070 - 0x0028)
class UVariantObjectBinding final : public UObject
{
public:
	struct FSoftObjectPath                        ObjectPtr;                                         // 0x0028(0x0018)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TLazyObjectPtr<class UObject>                 LazyObjectPtr;                                     // 0x0040(0x001C)(IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPropertyValue*>                 CapturedProperties;                                // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VariantObjectBinding">();
	}
	static class UVariantObjectBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariantObjectBinding>();
	}
};
static_assert(alignof(UVariantObjectBinding) == 0x000008, "Wrong alignment on UVariantObjectBinding");
static_assert(sizeof(UVariantObjectBinding) == 0x000070, "Wrong size on UVariantObjectBinding");
static_assert(offsetof(UVariantObjectBinding, ObjectPtr) == 0x000028, "Member 'UVariantObjectBinding::ObjectPtr' has a wrong offset!");
static_assert(offsetof(UVariantObjectBinding, LazyObjectPtr) == 0x000040, "Member 'UVariantObjectBinding::LazyObjectPtr' has a wrong offset!");
static_assert(offsetof(UVariantObjectBinding, CapturedProperties) == 0x000060, "Member 'UVariantObjectBinding::CapturedProperties' has a wrong offset!");

// Class VariantManagerContent.VariantSet
// 0x0028 (0x0050 - 0x0028)
class UVariantSet final : public UObject
{
public:
	class FText                                   DisplayText;                                       // 0x0028(0x0018)(NativeAccessSpecifierPrivate)
	TArray<class UVariant*>                       Variants;                                          // 0x0040(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	int32 GetNumVariants();
	class UVariant* GetVariant(int32 VariantIndex);
	void SetDisplayText(const class FText& NewDisplayText);

	class FText GetDisplayText() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"VariantSet">();
	}
	static class UVariantSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVariantSet>();
	}
};
static_assert(alignof(UVariantSet) == 0x000008, "Wrong alignment on UVariantSet");
static_assert(sizeof(UVariantSet) == 0x000050, "Wrong size on UVariantSet");
static_assert(offsetof(UVariantSet, DisplayText) == 0x000028, "Member 'UVariantSet::DisplayText' has a wrong offset!");
static_assert(offsetof(UVariantSet, Variants) == 0x000040, "Member 'UVariantSet::Variants' has a wrong offset!");

}

