#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VerifyGame

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VerifyGame.VerifyGame_C
// 0x0020 (0x0228 - 0x0208)
class UVerifyGame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_38;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VerifyGame(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ApplyText(const class FString& Text_0, class UTextBlock* TextBox, bool ApplySize);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VerifyGame_C">();
	}
	static class UVerifyGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVerifyGame_C>();
	}
};
static_assert(alignof(UVerifyGame_C) == 0x000008, "Wrong alignment on UVerifyGame_C");
static_assert(sizeof(UVerifyGame_C) == 0x000228, "Wrong size on UVerifyGame_C");
static_assert(offsetof(UVerifyGame_C, UberGraphFrame) == 0x000208, "Member 'UVerifyGame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVerifyGame_C, TextBlock_38) == 0x000210, "Member 'UVerifyGame_C::TextBlock_38' has a wrong offset!");
static_assert(offsetof(UVerifyGame_C, Text) == 0x000218, "Member 'UVerifyGame_C::Text' has a wrong offset!");

}

