#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ViveportSDK

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class ViveportSDK.ViveportApi
// 0x0000 (0x0028 - 0x0028)
class UViveportApi final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportApi">();
	}
	static class UViveportApi* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportApi>();
	}
};
static_assert(alignof(UViveportApi) == 0x000008, "Wrong alignment on UViveportApi");
static_assert(sizeof(UViveportApi) == 0x000028, "Wrong size on UViveportApi");

// Class ViveportSDK.ViveportApiDemo
// 0x0038 (0x0128 - 0x00F0)
class UViveportApiDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x38];                                      // 0x00F0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportApiDemo">();
	}
	static class UViveportApiDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportApiDemo>();
	}
};
static_assert(alignof(UViveportApiDemo) == 0x000008, "Wrong alignment on UViveportApiDemo");
static_assert(sizeof(UViveportApiDemo) == 0x000128, "Wrong size on UViveportApiDemo");

// Class ViveportSDK.ViveportArcadeSession
// 0x0000 (0x0028 - 0x0028)
class UViveportArcadeSession final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportArcadeSession">();
	}
	static class UViveportArcadeSession* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportArcadeSession>();
	}
};
static_assert(alignof(UViveportArcadeSession) == 0x000008, "Wrong alignment on UViveportArcadeSession");
static_assert(sizeof(UViveportArcadeSession) == 0x000028, "Wrong size on UViveportArcadeSession");

// Class ViveportSDK.ViveportArcadeSessionDemo
// 0x0060 (0x0150 - 0x00F0)
class UViveportArcadeSessionDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x60];                                      // 0x00F0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportArcadeSessionDemo">();
	}
	static class UViveportArcadeSessionDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportArcadeSessionDemo>();
	}
};
static_assert(alignof(UViveportArcadeSessionDemo) == 0x000008, "Wrong alignment on UViveportArcadeSessionDemo");
static_assert(sizeof(UViveportArcadeSessionDemo) == 0x000150, "Wrong size on UViveportArcadeSessionDemo");

// Class ViveportSDK.ViveportDLC
// 0x0000 (0x0028 - 0x0028)
class UViveportDLC final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportDLC">();
	}
	static class UViveportDLC* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportDLC>();
	}
};
static_assert(alignof(UViveportDLC) == 0x000008, "Wrong alignment on UViveportDLC");
static_assert(sizeof(UViveportDLC) == 0x000028, "Wrong size on UViveportDLC");

// Class ViveportSDK.ViveportDLCDemo
// 0x0040 (0x0130 - 0x00F0)
class UViveportDLCDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x40];                                      // 0x00F0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportDLCDemo">();
	}
	static class UViveportDLCDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportDLCDemo>();
	}
};
static_assert(alignof(UViveportDLCDemo) == 0x000008, "Wrong alignment on UViveportDLCDemo");
static_assert(sizeof(UViveportDLCDemo) == 0x000130, "Wrong size on UViveportDLCDemo");

// Class ViveportSDK.ViveportIAPQueryPurchaseListDemo
// 0x0070 (0x0160 - 0x00F0)
class UViveportIAPQueryPurchaseListDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x70];                                      // 0x00F0(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPQueryPurchaseListDemo">();
	}
	static class UViveportIAPQueryPurchaseListDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPQueryPurchaseListDemo>();
	}
};
static_assert(alignof(UViveportIAPQueryPurchaseListDemo) == 0x000008, "Wrong alignment on UViveportIAPQueryPurchaseListDemo");
static_assert(sizeof(UViveportIAPQueryPurchaseListDemo) == 0x000160, "Wrong size on UViveportIAPQueryPurchaseListDemo");

// Class ViveportSDK.ViveportIAPSubscriptionDemo
// 0x00A0 (0x0190 - 0x00F0)
class UViveportIAPSubscriptionDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0xA0];                                      // 0x00F0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPSubscriptionDemo">();
	}
	static class UViveportIAPSubscriptionDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPSubscriptionDemo>();
	}
};
static_assert(alignof(UViveportIAPSubscriptionDemo) == 0x000008, "Wrong alignment on UViveportIAPSubscriptionDemo");
static_assert(sizeof(UViveportIAPSubscriptionDemo) == 0x000190, "Wrong size on UViveportIAPSubscriptionDemo");

// Class ViveportSDK.ViveportIAPSubscriptionListDemo
// 0x0060 (0x0150 - 0x00F0)
class UViveportIAPSubscriptionListDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x60];                                      // 0x00F0(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPSubscriptionListDemo">();
	}
	static class UViveportIAPSubscriptionListDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPSubscriptionListDemo>();
	}
};
static_assert(alignof(UViveportIAPSubscriptionListDemo) == 0x000008, "Wrong alignment on UViveportIAPSubscriptionListDemo");
static_assert(sizeof(UViveportIAPSubscriptionListDemo) == 0x000150, "Wrong size on UViveportIAPSubscriptionListDemo");

// Class ViveportSDK.ViveportIAPurchase
// 0x0000 (0x0028 - 0x0028)
class UViveportIAPurchase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPurchase">();
	}
	static class UViveportIAPurchase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPurchase>();
	}
};
static_assert(alignof(UViveportIAPurchase) == 0x000008, "Wrong alignment on UViveportIAPurchase");
static_assert(sizeof(UViveportIAPurchase) == 0x000028, "Wrong size on UViveportIAPurchase");

// Class ViveportSDK.ViveportIAPurchaseDemo
// 0x0090 (0x0180 - 0x00F0)
class UViveportIAPurchaseDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x90];                                      // 0x00F0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPurchaseDemo">();
	}
	static class UViveportIAPurchaseDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPurchaseDemo>();
	}
};
static_assert(alignof(UViveportIAPurchaseDemo) == 0x000008, "Wrong alignment on UViveportIAPurchaseDemo");
static_assert(sizeof(UViveportIAPurchaseDemo) == 0x000180, "Wrong size on UViveportIAPurchaseDemo");

// Class ViveportSDK.ViveportIAPurchaseUserDataDemo
// 0x0090 (0x0180 - 0x00F0)
class UViveportIAPurchaseUserDataDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x90];                                      // 0x00F0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportIAPurchaseUserDataDemo">();
	}
	static class UViveportIAPurchaseUserDataDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportIAPurchaseUserDataDemo>();
	}
};
static_assert(alignof(UViveportIAPurchaseUserDataDemo) == 0x000008, "Wrong alignment on UViveportIAPurchaseUserDataDemo");
static_assert(sizeof(UViveportIAPurchaseUserDataDemo) == 0x000180, "Wrong size on UViveportIAPurchaseUserDataDemo");

// Class ViveportSDK.ViveportSubscription
// 0x0000 (0x0028 - 0x0028)
class UViveportSubscription final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportSubscription">();
	}
	static class UViveportSubscription* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportSubscription>();
	}
};
static_assert(alignof(UViveportSubscription) == 0x000008, "Wrong alignment on UViveportSubscription");
static_assert(sizeof(UViveportSubscription) == 0x000028, "Wrong size on UViveportSubscription");

// Class ViveportSDK.ViveportSubscriptionDemo
// 0x0030 (0x0120 - 0x00F0)
class UViveportSubscriptionDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x30];                                      // 0x00F0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportSubscriptionDemo">();
	}
	static class UViveportSubscriptionDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportSubscriptionDemo>();
	}
};
static_assert(alignof(UViveportSubscriptionDemo) == 0x000008, "Wrong alignment on UViveportSubscriptionDemo");
static_assert(sizeof(UViveportSubscriptionDemo) == 0x000120, "Wrong size on UViveportSubscriptionDemo");

// Class ViveportSDK.ViveportToken
// 0x0000 (0x0028 - 0x0028)
class UViveportToken final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportToken">();
	}
	static class UViveportToken* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportToken>();
	}
};
static_assert(alignof(UViveportToken) == 0x000008, "Wrong alignment on UViveportToken");
static_assert(sizeof(UViveportToken) == 0x000028, "Wrong size on UViveportToken");

// Class ViveportSDK.ViveportTokenDemo
// 0x0020 (0x0110 - 0x00F0)
class UViveportTokenDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportTokenDemo">();
	}
	static class UViveportTokenDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportTokenDemo>();
	}
};
static_assert(alignof(UViveportTokenDemo) == 0x000008, "Wrong alignment on UViveportTokenDemo");
static_assert(sizeof(UViveportTokenDemo) == 0x000110, "Wrong size on UViveportTokenDemo");

// Class ViveportSDK.ViveportUser
// 0x0000 (0x0028 - 0x0028)
class UViveportUser final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportUser">();
	}
	static class UViveportUser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportUser>();
	}
};
static_assert(alignof(UViveportUser) == 0x000008, "Wrong alignment on UViveportUser");
static_assert(sizeof(UViveportUser) == 0x000028, "Wrong size on UViveportUser");

// Class ViveportSDK.ViveportUserDemo
// 0x0010 (0x0100 - 0x00F0)
class UViveportUserDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportUserDemo">();
	}
	static class UViveportUserDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportUserDemo>();
	}
};
static_assert(alignof(UViveportUserDemo) == 0x000008, "Wrong alignment on UViveportUserDemo");
static_assert(sizeof(UViveportUserDemo) == 0x000100, "Wrong size on UViveportUserDemo");

// Class ViveportSDK.ViveportUserStats
// 0x0000 (0x0028 - 0x0028)
class UViveportUserStats final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportUserStats">();
	}
	static class UViveportUserStats* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportUserStats>();
	}
};
static_assert(alignof(UViveportUserStats) == 0x000008, "Wrong alignment on UViveportUserStats");
static_assert(sizeof(UViveportUserStats) == 0x000028, "Wrong size on UViveportUserStats");

// Class ViveportSDK.ViveportUserStatsDemo
// 0x0010 (0x0100 - 0x00F0)
class UViveportUserStatsDemo final : public UActorComponent
{
public:
	uint8                                         Pad_F0[0x10];                                      // 0x00F0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ViveportUserStatsDemo">();
	}
	static class UViveportUserStatsDemo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViveportUserStatsDemo>();
	}
};
static_assert(alignof(UViveportUserStatsDemo) == 0x000008, "Wrong alignment on UViveportUserStatsDemo");
static_assert(sizeof(UViveportUserStatsDemo) == 0x000100, "Wrong size on UViveportUserStatsDemo");

}

