#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponUI

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WeaponUI.WeaponUI_C
// 0x0020 (0x0228 - 0x0208)
class UWeaponUI_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TxtCurrentNum;                                     // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TxtLeftNum;                                        // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentNum;                                        // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftNum;                                           // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WeaponUI(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponUI_C">();
	}
	static class UWeaponUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponUI_C>();
	}
};
static_assert(alignof(UWeaponUI_C) == 0x000008, "Wrong alignment on UWeaponUI_C");
static_assert(sizeof(UWeaponUI_C) == 0x000228, "Wrong size on UWeaponUI_C");
static_assert(offsetof(UWeaponUI_C, UberGraphFrame) == 0x000208, "Member 'UWeaponUI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponUI_C, TxtCurrentNum) == 0x000210, "Member 'UWeaponUI_C::TxtCurrentNum' has a wrong offset!");
static_assert(offsetof(UWeaponUI_C, TxtLeftNum) == 0x000218, "Member 'UWeaponUI_C::TxtLeftNum' has a wrong offset!");
static_assert(offsetof(UWeaponUI_C, CurrentNum) == 0x000220, "Member 'UWeaponUI_C::CurrentNum' has a wrong offset!");
static_assert(offsetof(UWeaponUI_C, LeftNum) == 0x000224, "Member 'UWeaponUI_C::LeftNum' has a wrong offset!");

}

