#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_AI_Thunder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_AI_Thunder.Wpn_AI_Thunder_C
// 0x0030 (0x0358 - 0x0328)
class AWpn_AI_Thunder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 WPN_Grenade;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         KeepDistance;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DropTime;                                          // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wpn_AI_Thunder(int32 EntryPoint);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_2_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void Init(const struct FRotator& TargetRotation, const struct FVector& TargetLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wpn_AI_Thunder_C">();
	}
	static class AWpn_AI_Thunder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWpn_AI_Thunder_C>();
	}
};
static_assert(alignof(AWpn_AI_Thunder_C) == 0x000008, "Wrong alignment on AWpn_AI_Thunder_C");
static_assert(sizeof(AWpn_AI_Thunder_C) == 0x000358, "Wrong size on AWpn_AI_Thunder_C");
static_assert(offsetof(AWpn_AI_Thunder_C, UberGraphFrame) == 0x000328, "Member 'AWpn_AI_Thunder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, WPN_Grenade) == 0x000330, "Member 'AWpn_AI_Thunder_C::WPN_Grenade' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, Scene) == 0x000338, "Member 'AWpn_AI_Thunder_C::Scene' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, Sphere) == 0x000340, "Member 'AWpn_AI_Thunder_C::Sphere' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, ProjectileMovement) == 0x000348, "Member 'AWpn_AI_Thunder_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, KeepDistance) == 0x000350, "Member 'AWpn_AI_Thunder_C::KeepDistance' has a wrong offset!");
static_assert(offsetof(AWpn_AI_Thunder_C, DropTime) == 0x000354, "Member 'AWpn_AI_Thunder_C::DropTime' has a wrong offset!");

}

