#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_AI_EnemySentry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_AI_EnemySentry.Wpn_AI_EnemySentry_C
// 0x0020 (0x08A0 - 0x0880)
class AWpn_AI_EnemySentry_C final : public ABPWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Wpn_AI_EnemySentry_C;               // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         BulletShootCount;                                  // 0x0888(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     FireSound;                                         // 0x0890(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_Wpn_AI_EnemySentry(int32 EntryPoint);
	void Evt_ClipEmpty();
	void Evt_StopFire();
	void Evt_Fire();
	void Evt_Reload();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wpn_AI_EnemySentry_C">();
	}
	static class AWpn_AI_EnemySentry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWpn_AI_EnemySentry_C>();
	}
};
static_assert(alignof(AWpn_AI_EnemySentry_C) == 0x000010, "Wrong alignment on AWpn_AI_EnemySentry_C");
static_assert(sizeof(AWpn_AI_EnemySentry_C) == 0x0008A0, "Wrong size on AWpn_AI_EnemySentry_C");
static_assert(offsetof(AWpn_AI_EnemySentry_C, UberGraphFrame_Wpn_AI_EnemySentry_C) == 0x000880, "Member 'AWpn_AI_EnemySentry_C::UberGraphFrame_Wpn_AI_EnemySentry_C' has a wrong offset!");
static_assert(offsetof(AWpn_AI_EnemySentry_C, BulletShootCount) == 0x000888, "Member 'AWpn_AI_EnemySentry_C::BulletShootCount' has a wrong offset!");
static_assert(offsetof(AWpn_AI_EnemySentry_C, FireSound) == 0x000890, "Member 'AWpn_AI_EnemySentry_C::FireSound' has a wrong offset!");

}

