#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_RPG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_RPG.WPN_RPG_C
// 0x0020 (0x08A0 - 0x0880)
class AWPN_RPG_C final : public ABPWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WPN_RPG_C;                          // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Rocket;                                            // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWeaponAnimInstance*                    AnimBP_0;                                          // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wpn_RPG(int32 EntryPoint);
	void Evt_ClipEmpty();
	void Evt_StopFire();
	void OnLineTriggerPull(bool IsFromRightHand, class AActor* hand);
	void Evt_Fire();
	void ReceiveTick(float DeltaSeconds);
	void Evt_Reload();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WPN_RPG_C">();
	}
	static class AWPN_RPG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWPN_RPG_C>();
	}
};
static_assert(alignof(AWPN_RPG_C) == 0x000010, "Wrong alignment on AWPN_RPG_C");
static_assert(sizeof(AWPN_RPG_C) == 0x0008A0, "Wrong size on AWPN_RPG_C");
static_assert(offsetof(AWPN_RPG_C, UberGraphFrame_WPN_RPG_C) == 0x000880, "Member 'AWPN_RPG_C::UberGraphFrame_WPN_RPG_C' has a wrong offset!");
static_assert(offsetof(AWPN_RPG_C, Rocket) == 0x000888, "Member 'AWPN_RPG_C::Rocket' has a wrong offset!");
static_assert(offsetof(AWPN_RPG_C, AnimBP_0) == 0x000890, "Member 'AWPN_RPG_C::AnimBP_0' has a wrong offset!");

}

