#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_AI_HeavyRiotShield

#include "Basic.hpp"


namespace SDK::Params
{

// Function Wpn_AI_HeavyRiotShield.Wpn_AI_HeavyRiotShield_C.ExecuteUbergraph_Wpn_AI_HeavyRiotShield
// 0x0040 (0x0040 - 0x0000)
struct Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Second;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsDefend;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_HeavyRiot_Shield_C*             K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_HeavyRiot_Shield_C*             K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess1;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield) == 0x000008, "Wrong alignment on Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield");
static_assert(sizeof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield) == 0x000040, "Wrong size on Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, EntryPoint) == 0x000000, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_CustomEvent_Second) == 0x000004, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_CustomEvent_Second' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_CustomEvent_IsDefend) == 0x000008, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_CustomEvent_IsDefend' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, CallFunc_GetAnimInstance_ReturnValue) == 0x000010, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield) == 0x000018, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, CallFunc_GetAnimInstance_ReturnValue1) == 0x000028, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::CallFunc_GetAnimInstance_ReturnValue1' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield1) == 0x000030, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_DynamicCast_AsAnim_BP_Heavy_Riot_Shield1' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield, K2Node_DynamicCast_bSuccess1) == 0x000038, "Member 'Wpn_AI_HeavyRiotShield_C_ExecuteUbergraph_Wpn_AI_HeavyRiotShield::K2Node_DynamicCast_bSuccess1' has a wrong offset!");

// Function Wpn_AI_HeavyRiotShield.Wpn_AI_HeavyRiotShield_C.SetDefend
// 0x0001 (0x0001 - 0x0000)
struct Wpn_AI_HeavyRiotShield_C_SetDefend final
{
public:
	bool                                          IsDefend;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wpn_AI_HeavyRiotShield_C_SetDefend) == 0x000001, "Wrong alignment on Wpn_AI_HeavyRiotShield_C_SetDefend");
static_assert(sizeof(Wpn_AI_HeavyRiotShield_C_SetDefend) == 0x000001, "Wrong size on Wpn_AI_HeavyRiotShield_C_SetDefend");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_SetDefend, IsDefend) == 0x000000, "Member 'Wpn_AI_HeavyRiotShield_C_SetDefend::IsDefend' has a wrong offset!");

// Function Wpn_AI_HeavyRiotShield.Wpn_AI_HeavyRiotShield_C.DelayDestroy
// 0x0004 (0x0004 - 0x0000)
struct Wpn_AI_HeavyRiotShield_C_DelayDestroy final
{
public:
	float                                         Second;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wpn_AI_HeavyRiotShield_C_DelayDestroy) == 0x000004, "Wrong alignment on Wpn_AI_HeavyRiotShield_C_DelayDestroy");
static_assert(sizeof(Wpn_AI_HeavyRiotShield_C_DelayDestroy) == 0x000004, "Wrong size on Wpn_AI_HeavyRiotShield_C_DelayDestroy");
static_assert(offsetof(Wpn_AI_HeavyRiotShield_C_DelayDestroy, Second) == 0x000000, "Member 'Wpn_AI_HeavyRiotShield_C_DelayDestroy::Second' has a wrong offset!");

}

