#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_Pistol_MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeaponBase_classes.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_Pistol_MainMenu.Wpn_Pistol_MainMenu_C
// 0x0020 (0x08A0 - 0x0880)
class AWpn_Pistol_MainMenu_C final : public ABPWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Wpn_Pistol_MainMenu_C;              // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        LaserPoint;                                        // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AWpn_Clip_C*                            Clip;                                              // 0x0890(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wpn_Pistol_MainMenu(int32 EntryPoint);
	void ChangeAnimState(EWState CurState, bool NewValue);
	void Evt_ClipEmpty();
	void Evt_StopFire();
	void OnLineTriggerPull(bool IsFromRightHand, class AActor* hand);
	void Evt_Fire();
	void ReceiveTick(float DeltaSeconds);
	void Evt_Reload();
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wpn_Pistol_MainMenu_C">();
	}
	static class AWpn_Pistol_MainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWpn_Pistol_MainMenu_C>();
	}
};
static_assert(alignof(AWpn_Pistol_MainMenu_C) == 0x000010, "Wrong alignment on AWpn_Pistol_MainMenu_C");
static_assert(sizeof(AWpn_Pistol_MainMenu_C) == 0x0008A0, "Wrong size on AWpn_Pistol_MainMenu_C");
static_assert(offsetof(AWpn_Pistol_MainMenu_C, UberGraphFrame_Wpn_Pistol_MainMenu_C) == 0x000880, "Member 'AWpn_Pistol_MainMenu_C::UberGraphFrame_Wpn_Pistol_MainMenu_C' has a wrong offset!");
static_assert(offsetof(AWpn_Pistol_MainMenu_C, LaserPoint) == 0x000888, "Member 'AWpn_Pistol_MainMenu_C::LaserPoint' has a wrong offset!");
static_assert(offsetof(AWpn_Pistol_MainMenu_C, Clip) == 0x000890, "Member 'AWpn_Pistol_MainMenu_C::Clip' has a wrong offset!");

}

