#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_RPG_PVE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPWeaponBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_RPG_PVE.Wpn_RPG_PVE_C
// 0x0020 (0x08A0 - 0x0880)
class AWpn_RPG_PVE_C final : public ABPWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Wpn_RPG_PVE_C;                      // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               effect_enemy_interrupter_detectlaser;              // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LaserRoot;                                         // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Rocket;                                            // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wpn_RPG_PVE(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void Evt_Fire();
	void UserConstructionScript();
	void DropWeapon();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wpn_RPG_PVE_C">();
	}
	static class AWpn_RPG_PVE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWpn_RPG_PVE_C>();
	}
};
static_assert(alignof(AWpn_RPG_PVE_C) == 0x000010, "Wrong alignment on AWpn_RPG_PVE_C");
static_assert(sizeof(AWpn_RPG_PVE_C) == 0x0008A0, "Wrong size on AWpn_RPG_PVE_C");
static_assert(offsetof(AWpn_RPG_PVE_C, UberGraphFrame_Wpn_RPG_PVE_C) == 0x000880, "Member 'AWpn_RPG_PVE_C::UberGraphFrame_Wpn_RPG_PVE_C' has a wrong offset!");
static_assert(offsetof(AWpn_RPG_PVE_C, effect_enemy_interrupter_detectlaser) == 0x000888, "Member 'AWpn_RPG_PVE_C::effect_enemy_interrupter_detectlaser' has a wrong offset!");
static_assert(offsetof(AWpn_RPG_PVE_C, LaserRoot) == 0x000890, "Member 'AWpn_RPG_PVE_C::LaserRoot' has a wrong offset!");
static_assert(offsetof(AWpn_RPG_PVE_C, Rocket) == 0x000898, "Member 'AWpn_RPG_PVE_C::Rocket' has a wrong offset!");

}

