#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_Sniper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BPWeaponBase_classes.hpp"
#include "SiliconRising_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Wpn_Sniper.Wpn_Sniper_C
// 0x00D0 (0x0950 - 0x0880)
class AWpn_Sniper_C final : public ABPWeaponBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Wpn_Sniper_C;                       // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   verticalLine;                                      // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   horizontalLine;                                    // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CamRoot;                                           // 0x0898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x08A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Center;                                            // 0x08A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   markUI;                                            // 0x08B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CameraView;                                        // 0x08B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         minFOV;                                            // 0x08C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          lsPCSniper_;                                       // 0x08C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C5[0x3];                                      // 0x08C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         maxFOV;                                            // 0x08C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StandardFOVLEN;                                    // 0x08CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         minShakeLen;                                       // 0x08D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                lastPos;                                           // 0x08D4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABPDefaultHand_C*                       parentModel;                                       // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Secret_C*                       targetNpc;                                         // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               targetSceneCapture;                                // 0x08F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKRVRMotionController_C*                Control;                                           // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               lastRot;                                           // 0x0900(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                lastFramePos;                                      // 0x090C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FocusLen;                                          // 0x0918(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceLen;                                          // 0x091C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitTargetPos;                                      // 0x0920(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                orgCenterPOS;                                      // 0x092C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NPC_Base_C*                         hitTarget;                                         // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          lshitHead_;                                        // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          lsHitBody_;                                        // 0x0941(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_942[0x2];                                      // 0x0942(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         lerpSpeed;                                         // 0x0944(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Wpn_Sniper(int32 EntryPoint);
	void ChangeAnimState(EWState State, bool NewParam1);
	void UpdateFov();
	void EnablePostProcess(bool lsEnable);
	void UpdateMark();
	void UpdateTransform();
	void UpdateLastPos();
	void UpdateFocus();
	void UpdateTrace();
	void ReceiveTick(float DeltaSeconds);
	void Evt_Fire();
	void Evt_ClipEmpty();
	void Evt_StopFire();
	void Evt_Reload();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void UpdateTraceHit(float _Dt);
	void UpdateHVLine(float _Dt);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Wpn_Sniper_C">();
	}
	static class AWpn_Sniper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWpn_Sniper_C>();
	}
};
static_assert(alignof(AWpn_Sniper_C) == 0x000010, "Wrong alignment on AWpn_Sniper_C");
static_assert(sizeof(AWpn_Sniper_C) == 0x000950, "Wrong size on AWpn_Sniper_C");
static_assert(offsetof(AWpn_Sniper_C, UberGraphFrame_Wpn_Sniper_C) == 0x000880, "Member 'AWpn_Sniper_C::UberGraphFrame_Wpn_Sniper_C' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, verticalLine) == 0x000888, "Member 'AWpn_Sniper_C::verticalLine' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, horizontalLine) == 0x000890, "Member 'AWpn_Sniper_C::horizontalLine' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, CamRoot) == 0x000898, "Member 'AWpn_Sniper_C::CamRoot' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, SceneCaptureComponent2D) == 0x0008A0, "Member 'AWpn_Sniper_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, Center) == 0x0008A8, "Member 'AWpn_Sniper_C::Center' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, markUI) == 0x0008B0, "Member 'AWpn_Sniper_C::markUI' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, CameraView) == 0x0008B8, "Member 'AWpn_Sniper_C::CameraView' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, minFOV) == 0x0008C0, "Member 'AWpn_Sniper_C::minFOV' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lsPCSniper_) == 0x0008C4, "Member 'AWpn_Sniper_C::lsPCSniper_' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, maxFOV) == 0x0008C8, "Member 'AWpn_Sniper_C::maxFOV' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, StandardFOVLEN) == 0x0008CC, "Member 'AWpn_Sniper_C::StandardFOVLEN' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, minShakeLen) == 0x0008D0, "Member 'AWpn_Sniper_C::minShakeLen' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lastPos) == 0x0008D4, "Member 'AWpn_Sniper_C::lastPos' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, parentModel) == 0x0008E0, "Member 'AWpn_Sniper_C::parentModel' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, targetNpc) == 0x0008E8, "Member 'AWpn_Sniper_C::targetNpc' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, targetSceneCapture) == 0x0008F0, "Member 'AWpn_Sniper_C::targetSceneCapture' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, Control) == 0x0008F8, "Member 'AWpn_Sniper_C::Control' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lastRot) == 0x000900, "Member 'AWpn_Sniper_C::lastRot' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lastFramePos) == 0x00090C, "Member 'AWpn_Sniper_C::lastFramePos' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, FocusLen) == 0x000918, "Member 'AWpn_Sniper_C::FocusLen' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, TraceLen) == 0x00091C, "Member 'AWpn_Sniper_C::TraceLen' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, hitTargetPos) == 0x000920, "Member 'AWpn_Sniper_C::hitTargetPos' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, orgCenterPOS) == 0x00092C, "Member 'AWpn_Sniper_C::orgCenterPOS' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, hitTarget) == 0x000938, "Member 'AWpn_Sniper_C::hitTarget' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lshitHead_) == 0x000940, "Member 'AWpn_Sniper_C::lshitHead_' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lsHitBody_) == 0x000941, "Member 'AWpn_Sniper_C::lsHitBody_' has a wrong offset!");
static_assert(offsetof(AWpn_Sniper_C, lerpSpeed) == 0x000944, "Member 'AWpn_Sniper_C::lerpSpeed' has a wrong offset!");

}

