#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_AAC_PVE

#include "Basic.hpp"


namespace SDK::Params
{

// Function Wpn_AAC_PVE.Wpn_AAC_PVE_C.ExecuteUbergraph_Wpn_AAC_PVE
// 0x0008 (0x0008 - 0x0000)
struct Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE) == 0x000004, "Wrong alignment on Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE");
static_assert(sizeof(Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE) == 0x000008, "Wrong size on Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE");
static_assert(offsetof(Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE, EntryPoint) == 0x000000, "Member 'Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Wpn_AAC_PVE_C_ExecuteUbergraph_Wpn_AAC_PVE::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Wpn_AAC_PVE.Wpn_AAC_PVE_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Wpn_AAC_PVE_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Wpn_AAC_PVE_C_ReceiveTick) == 0x000004, "Wrong alignment on Wpn_AAC_PVE_C_ReceiveTick");
static_assert(sizeof(Wpn_AAC_PVE_C_ReceiveTick) == 0x000004, "Wrong size on Wpn_AAC_PVE_C_ReceiveTick");
static_assert(offsetof(Wpn_AAC_PVE_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'Wpn_AAC_PVE_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

