#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wpn_AI_HeavyRiotGun

#include "Basic.hpp"


namespace SDK::Params
{

// Function Wpn_AI_HeavyRiotGun.Wpn_AI_HeavyRiotGun_C.ExecuteUbergraph_Wpn_AI_HeavyRiotGun
// 0x0020 (0x0020 - 0x0000)
struct Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimBP_Wpn_HeavyRiotGun_C*             K2Node_DynamicCast_AsAnim_BP_Wpn_Heavy_Riot_Gun;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun) == 0x000008, "Wrong alignment on Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun");
static_assert(sizeof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun) == 0x000020, "Wrong size on Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun");
static_assert(offsetof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun, EntryPoint) == 0x000000, "Member 'Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun::EntryPoint' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun, K2Node_DynamicCast_AsAnim_BP_Wpn_Heavy_Riot_Gun) == 0x000010, "Member 'Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun::K2Node_DynamicCast_AsAnim_BP_Wpn_Heavy_Riot_Gun' has a wrong offset!");
static_assert(offsetof(Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Wpn_AI_HeavyRiotGun_C_ExecuteUbergraph_Wpn_AI_HeavyRiotGun::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

